#ifndef __REGMAP_8600_H__
#define __REGMAP_8600_H__

/*
 * TYPE: RegisterFile0
 */
typedef struct
{
    // GROUP 000 : Chip Information
    UINT32  stamp                                 ; // 00  (ADDR : 0x9C00_0000)
    UINT32  emulation                             ; // 01  (ADDR : 0x9C00_0004)
    UINT32  G000_reserved_2                       ; // 02  (ADDR : 0x9C00_0008)
    UINT32  G000_reserved_3                       ; // 03  (ADDR : 0x9C00_000C)
    UINT32  clk_sel0                              ; // 04  (ADDR : 0x9C00_0010)
    UINT32  clk_sel1                              ; // 05  (ADDR : 0x9C00_0014)
    UINT32  sspll_cfg                             ; // 06  (ADDR : 0x9C00_0018)
    UINT32  clken0                                ; // 07  (ADDR : 0x9C00_0020)
    UINT32  clken1                                ; // 08  (ADDR : 0x9C00_0024)
    UINT32  clken2                                ; // 09  (ADDR : 0x9C00_0028)
    UINT32  clken3                                ; // 10  (ADDR : 0x9C00_002C)
    UINT32  clken4                                ; // 11  (ADDR : 0x9C00_002C)
    UINT32  gclken0                               ; // 12  (ADDR : 0x9C00_0030)
    UINT32  gclken1                               ; // 13  (ADDR : 0x9C00_0034)
    UINT32  gclken2                               ; // 14  (ADDR : 0x9C00_0038)
    UINT32  gclken3                               ; // 15  (ADDR : 0x9C00_003C)
    UINT32  gclken4                               ; // 16  (ADDR : 0x9C00_003C)
    UINT32  reset0                                ; // 17  (ADDR : 0x9C00_0040)
    UINT32  reset1                                ; // 18  (ADDR : 0x9C00_0044)
    UINT32  reset2                                ; // 19  (ADDR : 0x9C00_0048)
    UINT32  reset3                                ; // 20  (ADDR : 0x9C00_004C)
    UINT32  reset4                                ; // 21  (ADDR : 0x9C00_004C)
    UINT32  pwr_iso                               ; // 22  (ADDR : 0x9C00_0058)
    UINT32  pwr_ctl                               ; // 23  (ADDR : 0x9C00_005C)
    UINT32  hw_bo0                                ; // 24  (ADDR : 0x9C00_0060)
    UINT32  hw_bo1                                ; // 25  (ADDR : 0x9C00_0064)
    UINT32  hw_bo2                                ; // 26  (ADDR : 0x9C00_0068)
    UINT32  hw_bo3                                ; // 27  (ADDR : 0x9C00_006C)
    UINT32  hw_cfg                                ; // 28  (ADDR : 0x9C00_0070)
    UINT32  hw_cfg_chg                            ; // 29  (ADDR : 0x9C00_0074)
    UINT32  G000_reserved_30                      ; // 30  (ADDR : 0x9C00_0078)
    UINT32  show_bo_stamp                         ; // 31  (ADDR : 0x9C00_007C)

    // Group 001 : MOON1
    UINT32  rf_sft_cfg0                           ; // 00  (ADDR : 0x9C00_0080)
    UINT32  rf_sft_cfg1                           ; // 01  (ADDR : 0x9C00_0084)
    UINT32  rf_sft_cfg2                           ; // 02  (ADDR : 0x9C00_0088)
    UINT32  rf_sft_cfg3                           ; // 03  (ADDR : 0x9C00_008C)
    UINT32  rf_sft_cfg4                           ; // 04  (ADDR : 0x9C00_0090)
    UINT32  rf_sft_cfg5                           ; // 05  (ADDR : 0x9C00_0094)
    UINT32  rf_sft_cfg6                           ; // 06  (ADDR : 0x9C00_0098)
    UINT32  rf_sft_cfg7                           ; // 07  (ADDR : 0x9C00_009C)
    UINT32  rf_sft_cfg8                           ; // 08  (ADDR : 0x9C00_00A0)
    UINT32  rf_sft_cfg9                           ; // 09  (ADDR : 0x9C00_00A4)
    UINT32  rf_sft_cfg10                          ; // 10  (ADDR : 0x9C00_00A8)
    UINT32  rf_sft_cfg11                          ; // 11  (ADDR : 0x9C00_00AC)
    UINT32  rf_sft_cfg12                          ; // 12  (ADDR : 0x9C00_00B0)
    UINT32  rf_sft_cfg13                          ; // 13  (ADDR : 0x9C00_00B4)
    UINT32  rf_sft_cfg14                          ; // 14  (ADDR : 0x9C00_00B8)
    UINT32  rf_sft_cfg15                          ; // 15  (ADDR : 0x9C00_00BC)
    UINT32  rf_sft_cfg16                          ; // 16  (ADDR : 0x9C00_00C0)
    UINT32  rf_sft_cfg17                          ; // 17  (ADDR : 0x9C00_00C4)
    UINT32  rf_sft_cfg18                          ; // 18  (ADDR : 0x9C00_00C8)
    UINT32  rf_sft_cfg19                          ; // 19  (ADDR : 0x9C00_00CC)
    UINT32  rf_sft_cfg20                          ; // 20  (ADDR : 0x9C00_00D0)
    UINT32  rf_sft_cfg21                          ; // 21  (ADDR : 0x9C00_00D4)
    UINT32  rf_sft_cfg22                          ; // 22  (ADDR : 0x9C00_00D8)
    UINT32  rf_sft_cfg23                          ; // 23  (ADDR : 0x9C00_00DC)
    UINT32  rf_sft_cfg24                          ; // 24  (ADDR : 0x9C00_00E0)
    UINT32  rf_sft_cfg25                          ; // 25  (ADDR : 0x9C00_00E4)
    UINT32  rf_sft_cfg26                          ; // 26  (ADDR : 0x9C00_00E8)
    UINT32  rf_sft_cfg27                          ; // 27  (ADDR : 0x9C00_00EC)
    UINT32  rf_sft_cfg28                          ; // 28  (ADDR : 0x9C00_00F0)
    UINT32  rf_sft_cfg29                          ; // 29  (ADDR : 0x9C00_00F4)
    UINT32  rf_sft_cfg30                          ; // 30  (ADDR : 0x9C00_00F8)
    UINT32  rf_sft_cfg31                          ; // 31  (ADDR : 0x9C00_00FC)

    // Group 002 : Reserved
    UINT32  G002_RESERVED[32]                     ; //     (ADDR : 0x9C00_0100) ~ (ADDR : 0x9C00_017C)

    // Group 003 : Reserved
    UINT32  G003_RESERVED[32]                     ; //     (ADDR : 0x9C00_0180) ~ (ADDR : 0x9C00_01FC)

    // Group 004 : PAD_CTL
    UINT32  rf_pad_ctl0                           ; // 00  (ADDR : 0x9C00_0200)
    UINT32  rf_pad_ctl1                           ; // 01  (ADDR : 0x9C00_0204)
    UINT32  rf_pad_ctl2                           ; // 02  (ADDR : 0x9C00_0208)
    UINT32  rf_pad_ctl3                           ; // 03  (ADDR : 0x9C00_020C)
    UINT32  rf_pad_ctl4                           ; // 04  (ADDR : 0x9C00_0210)
    UINT32  rf_pad_ctl5                           ; // 05  (ADDR : 0x9C00_0214)
    UINT32  rf_pad_ctl6                           ; // 06  (ADDR : 0x9C00_0218)
    UINT32  rf_pad_ctl7                           ; // 07  (ADDR : 0x9C00_021C)
    UINT32  rf_pad_ctl8                           ; // 08  (ADDR : 0x9C00_0220)
    UINT32  rf_pad_ctl9                           ; // 09  (ADDR : 0x9C00_0224)
    UINT32  rf_pad_ctl10                          ; // 10  (ADDR : 0x9C00_0228)
    UINT32  rf_pad_ctl11                          ; // 11  (ADDR : 0x9C00_022C)
    UINT32  rf_pad_ctl12                          ; // 12  (ADDR : 0x9C00_0230)
    UINT32  rf_pad_ctl13                          ; // 13  (ADDR : 0x9C00_0234)
    UINT32  rf_pad_ctl14                          ; // 14  (ADDR : 0x9C00_0238)
    UINT32  rf_pad_ctl15                          ; // 15  (ADDR : 0x9C00_023C)
    UINT32  rf_pad_ctl16                          ; // 16  (ADDR : 0x9C00_0240)
    UINT32  rf_pad_ctl17                          ; // 17  (ADDR : 0x9C00_0244)
    UINT32  rf_pad_ctl18                          ; // 18  (ADDR : 0x9C00_0248)
    UINT32  rf_pad_ctl19                          ; // 19  (ADDR : 0x9C00_024C)
    UINT32  rf_pad_ctl20                          ; // 20  (ADDR : 0x9C00_0250)
    UINT32  rf_pad_ctl21                          ; // 21  (ADDR : 0x9C00_0254)
    UINT32  rf_pad_ctl22                          ; // 22  (ADDR : 0x9C00_0258)
    UINT32  rf_pad_ctl23                          ; // 23  (ADDR : 0x9C00_025C)
    UINT32  rf_pad_ctl24                          ; // 24  (ADDR : 0x9C00_0260)
    UINT32  rf_pad_ctl25                          ; // 25  (ADDR : 0x9C00_0264)
    UINT32  rf_pad_ctl26                          ; // 26  (ADDR : 0x9C00_0268)
    UINT32  rf_pad_ctl27                          ; // 27  (ADDR : 0x9C00_026C)
    UINT32  rf_pad_ctl28                          ; // 28  (ADDR : 0x9C00_0270)
    UINT32  rf_pad_ctl29                          ; // 29  (ADDR : 0x9C00_0274)
    UINT32  rf_pad_ctl30                          ; // 30  (ADDR : 0x9C00_0278)
    UINT32  rf_pad_ctl31                          ; // 31  (ADDR : 0x9C00_027C)

    // Group 005 : GPIOXT
    UINT32  G005_GPIOXT[32]                       ; //     (ADDR : 0x9C00_0280) ~ (ADDR : 0x9C00_02FC)

    // Group 006 : Reserved
    UINT32  G006_RESERVED[32]                     ; //     (ADDR : 0x9C00_0300) ~ (ADDR : 0x9C00_037C)

    // Group 007 : PAD_CTRL1
    UINT32  G007_PAD_CTRL1[32]                       ; //     (ADDR : 0x9C00_0380) ~ (ADDR : 0x9C00_03FC)

    // Group 008 : IOP
    UINT32  iop_control                           ; //
    UINT32  iop_status                            ; //
    UINT32  iop_bp                                ; //
    UINT32  iop_regsel                            ; //
    UINT32  iop_regout                            ; //
    UINT32  iop_memlimit                          ; //
//  UINT32  reserved[2]                           ; //
    UINT32  iop_resume_pcl                        ; //
    UINT32  iop_resume_pch                        ; //
    UINT32  iop_data[12]                          ; //
    UINT32  iop_lbus_offset_ext                   ; //
    UINT32  iop_lbus_offset                       ; //
    UINT32  iop_lbus_control                      ; //
    UINT32  iop_lbus_offset2_lsb                  ; //
    UINT32  iop_lbus_offset2                      ; //
    UINT32  iop_direct_adr                        ; //
    UINT32  g8_reserved[6]                        ; //

    // Group 009 : Interrupt
    UINT32  intr_type[7]                          ;
    UINT32  intr_polarity[7]                      ;
    UINT32  a926_priority[7]                      ;
    UINT32  a926_intr_mask[7]                     ;
    UINT32  dsp_intr_clr0                         ;
    UINT32  dsp_intr_clr1                         ;
    UINT32  dsp_intr_clr2                         ;
    UINT32  dsp_intr_clr3                         ;

    // Group 010 : interrupt
    UINT32  a926_intr_clr[7]                      ;
    UINT32  masked_a926_fiqs[7]                   ;
    UINT32  masked_a926_irqs[7]                   ;
    UINT32  dsp_intr_mask[7]                      ;
    UINT32  dsp_intr_clr4                         ;
    UINT32  dsp_intr_clr5                         ;
    UINT32  dsp_intr_clr6                         ;
    UINT32  g10_reserved                          ;

    // Group 011 : TSET
    UINT32  G011_TSET[32]                         ;

    // Group 012 : STC
    UINT32  stc_15_0                              ; // 00  384
    UINT32  stc_31_16                             ; // 01  385
    UINT32  stc_64                                ; // 02  386
    UINT32  stc_divisor                           ; // 03  387
    UINT32  rtc_15_0                              ; // 04  388
    UINT32  rtc_31_16                             ; // 05  389
    UINT32  rtc_divisor                           ; // 06  390
    UINT32  stc_config                            ; // 07  391
    UINT32  timer0_ctrl                           ; // 08  392
    UINT32  timer0_cnt                            ; // 09  393
    UINT32  timer1_ctrl                           ; // 0a  394
    UINT32  timer1_cnt                            ; // 0b  395
    UINT32  timerw_ctrl                           ; // 0c  396
    UINT32  timerw_cnt                            ; // 0d  397
    UINT32  stc_47_32                             ; // 0e  385
    UINT32  stc_63_48                             ; // 0f  385
    UINT32  timer2_ctrl                           ; // 10  400
    UINT32  timer2_divisor                        ; // 11  401
    UINT32  timer2_reload                         ; // 12  402
    UINT32  timer2_cnt                            ; // 13  403
    UINT32  timer3_ctrl                           ; // 14  404
    UINT32  timer3_divisor                        ; // 15  405
    UINT32  timer3_reload                         ; // 16  406
    UINT32  timer3_cnt                            ; // 17  407
    UINT32  stcl_0                                ; // 18  408
    UINT32  stcl_1                                ; // 19  409
    UINT32  stcl_2                                ; // 1a  410
    UINT32  atc_0                                 ; // 1b  411
    UINT32  atc_1                                 ; // 1c  412
    UINT32  atc_2                                 ; // 1d  413
    UINT32  g12_reserved[2]                       ; // 1e  414

    // Group 013 : BR_WRAPPER
    UINT32  G013_BR_WRAPPER[32]                   ;

    // Group 014 : DUMMY_MASTER
    UINT32  dummy0_op_mode                        ; // 00  (ADDR : 0x9C00_0700)
    UINT32  dummy0_addr_base                      ; // 01  (ADDR : 0x9C00_0704)
    UINT32  dummy0_addr_offset                    ; // 02  (ADDR : 0x9C00_0708)
    UINT32  dummy0_control                        ; // 03  (ADDR : 0x9C00_070C)
    UINT32  dummy0_urgent                         ; // 04  (ADDR : 0x9C00_0710)
    UINT32  dummy0_request_period                 ; // 05  (ADDR : 0x9C00_0714)
    UINT32  G14_reserved_6                        ; // 06  (ADDR : 0x9C00_0718)
    UINT32  dummy0_error                          ; // 07  (ADDR : 0x9C00_071C)
    UINT32  dummy0_runtime_l                      ; // 08  (ADDR : 0x9C00_0720)
    UINT32  dummy0_runtime_h                      ; // 09  (ADDR : 0x9C00_0724)
    UINT32  dummy0_data_count_l                   ; // 10  (ADDR : 0x9C00_0728)
    UINT32  dummy0_data_count_h                   ; // 11  (ADDR : 0x9C00_072C)
    UINT32  dummy0_mdata_count_l                  ; // 12  (ADDR : 0x9C00_0730)
    UINT32  dummy0_mdata_count_h                  ; // 13  (ADDR : 0x9C00_0734)
    UINT32  dummy0_sdata_count_l                  ; // 14  (ADDR : 0x9C00_0738)
    UINT32  dummy0_sdata_count_h                  ; // 15  (ADDR : 0x9C00_073C)
    UINT32  dummy1_op_mode                        ; // 16  (ADDR : 0x9C00_0740)
    UINT32  dummy1_addr_base                      ; // 17  (ADDR : 0x9C00_0744)
    UINT32  dummy1_addr_offset                    ; // 18  (ADDR : 0x9C00_0748)
    UINT32  dummy1_control                        ; // 19  (ADDR : 0x9C00_074C)
    UINT32  dummy1_urgent                         ; // 20  (ADDR : 0x9C00_0750)
    UINT32  dummy1_request_period                 ; // 21  (ADDR : 0x9C00_0754)
    UINT32  G14_reserved_16                       ; // 22  (ADDR : 0x9C00_0758)
    UINT32  dummy1_error                          ; // 23  (ADDR : 0x9C00_075C)
    UINT32  dummy1_runtime_l                      ; // 24  (ADDR : 0x9C00_0760)
    UINT32  dummy1_runtime_h                      ; // 25  (ADDR : 0x9C00_0764)
    UINT32  dummy1_data_count_l                   ; // 26  (ADDR : 0x9C00_0768)
    UINT32  dummy1_data_count_h                   ; // 27  (ADDR : 0x9C00_076C)
    UINT32  dummy1_mdata_count_l                  ; // 28  (ADDR : 0x9C00_0770)
    UINT32  dummy1_mdata_count_h                  ; // 29  (ADDR : 0x9C00_0774)
    UINT32  dummy1_sdata_count_l                  ; // 30  (ADDR : 0x9C00_0778)
    UINT32  dummy1_sdata_count_h                  ; // 31  (ADDR : 0x9C00_077C)

    // Group 015 : Reserved
    UINT32  G015_RESERVED[32]                     ;

    // Group 016 : UART2
    UINT32  uart2_data                            ; // 00  (ADDR : 0x9C00_0900)
    UINT32  uart2_lsr                             ; // 01  (ADDR : 0x9C00_0904)
    UINT32  uart2_msr                             ; // 02  (ADDR : 0x9C00_0908)
    UINT32  uart2_lcr                             ; // 03  (ADDR : 0x9C00_090C)
    UINT32  uart2_mcr                             ; // 04  (ADDR : 0x9C00_0910)
    UINT32  uart2_div_l                           ; // 05  (ADDR : 0x9C00_0914)
    UINT32  uart2_div_h                           ; // 06  (ADDR : 0x9C00_0918)
    UINT32  uart2_isc                             ; // 07  (ADDR : 0x9C00_091C)
    UINT32  uart2_tx_residue                      ; // 08  (ADDR : 0x9C00_0920)
    UINT32  uart2_rx_residue                      ; // 09  (ADDR : 0x9C00_0924)
    UINT32  uart2_rxfifo_thr                      ; // 10  (ADDR : 0x9C00_0928)
    UINT32  G016_reserved[21]                     ;

    // Group 017 : UART3
    UINT32  uart3_data                            ; // 00  (ADDR : 0x9C00_0880)
    UINT32  uart3_lsr                             ; // 01  (ADDR : 0x9C00_0884)
    UINT32  uart3_msr                             ; // 02  (ADDR : 0x9C00_0888)
    UINT32  uart3_lcr                             ; // 03  (ADDR : 0x9C00_088C)
    UINT32  uart3_mcr                             ; // 04  (ADDR : 0x9C00_0890)
    UINT32  uart3_div_l                           ; // 05  (ADDR : 0x9C00_0894)
    UINT32  uart3_div_h                           ; // 06  (ADDR : 0x9C00_0898)
    UINT32  uart3_isc                             ; // 07  (ADDR : 0x9C00_089C)
    UINT32  uart3_tx_residue                      ; // 08  (ADDR : 0x9C00_08A0)
    UINT32  uart3_rx_residue                      ; // 09  (ADDR : 0x9C00_08A4)
    UINT32  uart3_rxfifo_thr                      ; // 10  (ADDR : 0x9C00_08A8)
    UINT32  G017_reserved[21]                     ; //     (ADDR : 0x9C00_08AC)

    // Group 018 : UART0
    UINT32  uart0_data                            ; // 00  (ADDR : 0x9C00_0900)
    UINT32  uart0_lsr                             ; // 01  (ADDR : 0x9C00_0904)
    UINT32  uart0_msr                             ; // 02  (ADDR : 0x9C00_0908)
    UINT32  uart0_lcr                             ; // 03  (ADDR : 0x9C00_090C)
    UINT32  uart0_mcr                             ; // 04  (ADDR : 0x9C00_0910)
    UINT32  uart0_div_l                           ; // 05  (ADDR : 0x9C00_0914)
    UINT32  uart0_div_h                           ; // 06  (ADDR : 0x9C00_0918)
    UINT32  uart0_isc                             ; // 07  (ADDR : 0x9C00_091C)
    UINT32  uart0_tx_residue                      ; // 08  (ADDR : 0x9C00_0920)
    UINT32  uart0_rx_residue                      ; // 09  (ADDR : 0x9C00_0924)
    UINT32  uart0_rxfifo_thr                      ; // 10  (ADDR : 0x9C00_0928)
    UINT32  G018_reserved[21]                     ;

    // Group 019 : UART1
    UINT32  uart1_data                            ; // 00  (ADDR : 0x9C00_0900)
    UINT32  uart1_lsr                             ; // 01  (ADDR : 0x9C00_0904)
    UINT32  uart1_msr                             ; // 02  (ADDR : 0x9C00_0908)
    UINT32  uart1_lcr                             ; // 03  (ADDR : 0x9C00_090C)
    UINT32  uart1_mcr                             ; // 04  (ADDR : 0x9C00_0910)
    UINT32  uart1_div_l                           ; // 05  (ADDR : 0x9C00_0914)
    UINT32  uart1_div_h                           ; // 06  (ADDR : 0x9C00_0918)
    UINT32  uart1_isc                             ; // 07  (ADDR : 0x9C00_091C)
    UINT32  uart1_tx_residue                      ; // 08  (ADDR : 0x9C00_0920)
    UINT32  uart1_rx_residue                      ; // 09  (ADDR : 0x9C00_0924)
    UINT32  uart1_rxfifo_thr                      ; // 10  (ADDR : 0x9C00_0928)
    UINT32  G019_reserved[21]                     ;

    // Group 020 : DPLL
    UINT32  G020_DPLL[32]                         ;

    // Group 021 : Reserved
    UINT32  G021_RESERVED[32]                     ;

    // Group 022 : SPI_FLASH
    UINT32  spi_ctrl                              ;
    UINT32  spi_wait                              ;
    UINT32  spi_cust_cmd                          ;
    UINT32  spi_addr_low                          ;
    UINT32  spi_addr_high                         ;
    UINT32  spi_data_low                          ;
    UINT32  spi_data_high                         ;
    UINT32  spi_status                            ;
    UINT32  spi_cfg0                              ;
    UINT32  spi_cfg1                              ;
    UINT32  spi_cfg2                              ;
    UINT32  spi_cfg3                              ;
    UINT32  spi_cfg4                              ;
    UINT32  spi_cfg5                              ;
    UINT32  spi_cfg6                              ;
    UINT32  spi_cfg7                              ;
    UINT32  spi_cfg8                              ;
    UINT32  spi_cust_cmd2                         ;
    UINT32  spi_data64                            ;
    UINT32  spi_buf_addr                          ;
    UINT32  spi_status2                           ;
    UINT32  spi_status3                           ;
    UINT32  g22_reserved_0[10]                    ;

    // Group 023 : SPI_FLASH
    UINT32  G023_SPI_FLASH[32]                    ;

    // Group 024 : CB_SWITCH
    UINT32  G024_CB_SWITCH[32]                    ; //     (ADDR : 0x9C00_0C00) ~ (ADDR : 0x9C00_0C7C)

    // Group 025 : PBUS
    UINT32  G025_PBUS[32]                         ; //     (ADDR : 0x9C00_0C80) ~ (ADDR : 0x9C00_0CFC)

    // Group 026 : CB_DMA
    UINT32  cbdma_ver                             ; // 00  (ADDR : 0x9C00_0D00)
    UINT32  cbdma_config                          ; // 01  (ADDR : 0x9C00_0D04)
    UINT32  cbdma_dma_length                      ; // 02  (ADDR : 0x9C00_0D08)
    UINT32  cbdma_src_adr                         ; // 03  (ADDR : 0x9C00_0D0c)
    UINT32  cbdma_des_adr                         ; // 04  (ADDR : 0x9C00_0D10)
    UINT32  cbdma_int_status                      ; // 05  (ADDR : 0x9C00_0D14)
    UINT32  cbdma_int_en                          ; // 06  (ADDR : 0x9C00_0D18)
    UINT32  cbdma_memset_value                    ; // 07  (ADDR : 0x9C00_0D1c)
    UINT32  cbdma_sdram_size                      ; // 08  (ADDR : 0x9C00_0D20)
    UINT32  G026_reserved_09                      ; // 09  (ADDR : 0x9C00_0D24)
    UINT32  cbdma_sg_index                        ; // 10  (ADDR : 0x9C00_0D28)
    UINT32  cbdma_sg_config                       ; // 11  (ADDR : 0x9C00_0D2C)
    UINT32  cbdma_sg_dma_length                   ; // 12  (ADDR : 0x9C00_0D30)
    UINT32  cbdma_sg_src_adr                      ; // 13  (ADDR : 0x9C00_0D34)
    UINT32  cbdma_sg_des_adr                      ; // 14  (ADDR : 0x9C00_0D38)
    UINT32  cbdma_sg_memset_value                 ; // 15  (ADDR : 0x9C00_0D3C)
    UINT32  cbdma_sg_setting                      ; // 16  (ADDR : 0x9C00_0D40)
    UINT32  G026_reserved_17                      ; // 17  (ADDR : 0x9C00_0D44)
    UINT32  G026_reserved_18                      ; // 18  (ADDR : 0x9C00_0D48)
    UINT32  G026_reserved_19                      ; // 19  (ADDR : 0x9C00_0D4C)
    UINT32  G026_reserved_20                      ; // 20  (ADDR : 0x9C00_0D50)
    UINT32  G026_reserved_21                      ; // 21  (ADDR : 0x9C00_0D54)
    UINT32  G026_reserved_22                      ; // 22  (ADDR : 0x9C00_0D58)
    UINT32  G026_reserved_23                      ; // 23  (ADDR : 0x9C00_0D5C)
    UINT32  G026_reserved_24                      ; // 24  (ADDR : 0x9C00_0D60)
    UINT32  G026_reserved_25                      ; // 25  (ADDR : 0x9C00_0D64)
    UINT32  G026_reserved_26                      ; // 26  (ADDR : 0x9C00_0D68)
    UINT32  G026_reserved_27                      ; // 27  (ADDR : 0x9C00_0D6C)
    UINT32  G026_reserved_28                      ; // 28  (ADDR : 0x9C00_0D70)
    UINT32  G026_reserved_29                      ; // 29  (ADDR : 0x9C00_0D74)
    UINT32  G026_reserved_30                      ; // 30  (ADDR : 0x9C00_0D78)
    UINT32  G026_reserved_31                      ; // 31  (ADDR : 0x9C00_0D7C)

    // Group 027 : CB_DMA1
    UINT32  cbdma1_ver                            ; // 00  (ADDR : 0x9C00_0D00)
    UINT32  cbdma1_config                         ; // 01  (ADDR : 0x9C00_0D04)
    UINT32  cbdma1_dma_length                     ; // 02  (ADDR : 0x9C00_0D08)
    UINT32  cbdma1_src_adr                        ; // 03  (ADDR : 0x9C00_0D0c)
    UINT32  cbdma1_des_adr                        ; // 04  (ADDR : 0x9C00_0D10)
    UINT32  cbdma1_int_status                     ; // 05  (ADDR : 0x9C00_0D14)
    UINT32  cbdma1_int_en                         ; // 06  (ADDR : 0x9C00_0D18)
    UINT32  cbdma1_memset_value                   ; // 07  (ADDR : 0x9C00_0D1c)
    UINT32  cbdma1_sdram_size                     ; // 08  (ADDR : 0x9C00_0D20)
    UINT32  G027_reserved_09                      ; // 09  (ADDR : 0x9C00_0D24)
    UINT32  cbdma1_sg_index                       ; // 10  (ADDR : 0x9C00_0D28)
    UINT32  cbdma1_sg_config                      ; // 11  (ADDR : 0x9C00_0D2C)
    UINT32  cbdma1_sg_dma_length                  ; // 12  (ADDR : 0x9C00_0D30)
    UINT32  cbdma1_sg_src_adr                     ; // 13  (ADDR : 0x9C00_0D34)
    UINT32  cbdma1_sg_des_adr                     ; // 14  (ADDR : 0x9C00_0D38)
    UINT32  cbdma1_sg_memset_value                ; // 15  (ADDR : 0x9C00_0D3C)
    UINT32  cbdma1_sg_setting                     ; // 16  (ADDR : 0x9C00_0D40)
    UINT32  G027_reserved_17                      ; // 17  (ADDR : 0x9C00_0D44)
    UINT32  G027_reserved_18                      ; // 18  (ADDR : 0x9C00_0D48)
    UINT32  G027_reserved_19                      ; // 19  (ADDR : 0x9C00_0D4C)
    UINT32  G027_reserved_20                      ; // 20  (ADDR : 0x9C00_0D50)
    UINT32  G027_reserved_21                      ; // 21  (ADDR : 0x9C00_0D54)
    UINT32  G027_reserved_22                      ; // 22  (ADDR : 0x9C00_0D58)
    UINT32  G027_reserved_23                      ; // 23  (ADDR : 0x9C00_0D5C)
    UINT32  G027_reserved_24                      ; // 24  (ADDR : 0x9C00_0D60)
    UINT32  G027_reserved_25                      ; // 25  (ADDR : 0x9C00_0D64)
    UINT32  G027_reserved_26                      ; // 26  (ADDR : 0x9C00_0D68)
    UINT32  G027_reserved_27                      ; // 27  (ADDR : 0x9C00_0D6C)
    UINT32  G027_reserved_28                      ; // 28  (ADDR : 0x9C00_0D70)
    UINT32  G027_reserved_29                      ; // 29  (ADDR : 0x9C00_0D74)
    UINT32  G027_reserved_30                      ; // 30  (ADDR : 0x9C00_0D78)
    UINT32  G027_reserved_31                      ; // 31  (ADDR : 0x9C00_0D7C)

    // Group 028 : Reserved
    UINT32  G028_RESERVED[32]                     ;

    // Group 029 : MBUS
    UINT32  mbus_setting                          ;
    UINT32  G029_reserved[15]                     ;
    UINT32  mbus_int_en                           ;
    UINT32  mbus_int_status                       ;
    UINT32  mbus_int_addr                         ;
    UINT32  mbus_mx_ab_sel                        ;
    UINT32  mbus_mx_ab_arb_type                   ;
    UINT32  mbus_mx_ab_priority                   ;
    UINT32  G029_reserved1[10]                    ;

    // Group 030 : Reserved
    UINT32  G030_RESERVED[32]                     ;

    // Group 031 : MBUS
    UINT32  mbar0_page_setting                    ;
    UINT32  mbar0_m1_setting                      ;
    UINT32  mbar0_m2_setting                      ;
    UINT32  mbar0_m3_setting                      ;
    UINT32  mbar0_m4_setting                      ;
    UINT32  mbar0_m5_setting                      ;
    UINT32  mbar0_m6_setting                      ;
    UINT32  mbar0_m7_setting                      ;
    UINT32  mbar0_m8_setting                      ;
    UINT32  mbar0_m9_setting                      ;
    UINT32  mbar0_m10_setting                     ;
    UINT32  mbar0_m11_setting                     ;
    UINT32  mbar0_m12_setting                     ;
    UINT32  mbar0_m13_setting                     ;
    UINT32  mbar0_m14_setting                     ;
    UINT32  mbar0_m15_setting                     ;
    UINT32  mbar0_m16_setting                     ;
    UINT32  mbar0_m17_setting                     ;
    UINT32  mbar0_m18_setting                     ;
    UINT32  mbar0_m19_setting                     ;
    UINT32  mbar0_m20_setting                     ;
    UINT32  mbar0_m21_setting                     ;
    UINT32  mbar0_m22_setting                     ;
    UINT32  mbar0_m23_setting                     ;
    UINT32  mbar0_m24_setting                     ;
    UINT32  mbar0_m25_setting                     ;
    UINT32  mbar0_m26_setting                     ;
    UINT32  mbar0_m27_setting                     ;
    UINT32  mbar0_m28_setting                     ;
    UINT32  mbar0_m29_setting                     ;
    UINT32  mbar0_m30_setting                     ;
    UINT32  mbar0_m31_setting                     ;

    // Group 032 : SDCTRL0
    UINT32  G032_SDCTRL0[32]                      ;

    // Group 033 : SDCTRL0
    UINT32  G033_SDCTRL0[32]                      ;

    // Group 034 : SDCTRL0
    UINT32  G034_SDCTRL0[32]                      ;

    // Group 035 : SDCTRL0
    UINT32  G035_SDCTRL0[32]                      ;

    // Group 036 : SDCTRL0 (2DBG)
    UINT32  G036_SDCTRL0[32]                     ;

    // Group 037 : SDCTRL0 (2DBG)
    UINT32  G037_SDCTRL0[32]                     ;

    // Group 038 : SDCTRL0 (2DBG)
    UINT32  G038_SDCTRL0[32]                     ;

    // Group 039 : SDCTRL0 (2DBG)
    UINT32  G039_SDCTRL0[32]                     ;

    // Group 040 : SDCTRL0
    UINT32  G040_SDCTRL0[32]                      ;

    // Group 041 : SDCTRL0
    UINT32  G041_SDCTRL0[32]                      ;

    // Group 042 : SDCTRL0
    UINT32  G042_SDCTRL0[32]                      ;

    // Group 043 : Reserved
    UINT32  G043_RESERVED[32]                     ;
    
    // Group 044 : Reserved
    UINT32  G044_RESERVED[32]                     ;
    
    // Group 045 : Reserved
    UINT32  G045_RESERVED[32]                     ;

    //Group 046 : CEVA DSP
    UINT32  dma0_sram_addr                        ; // 00  
    UINT32  dma0_dram_addr                        ; // 01  
    UINT32  dma0_txsize                           ; // 02  
    UINT32  dma0_control                          ; // 03  
    UINT32  dma0_status                           ; // 04  
    UINT32  dma1_sram_addr                        ; // 05  
    UINT32  dma1_dram_addr                        ; // 06  
    UINT32  dma1_txsize                           ; // 07  
    UINT32  dma1_control                          ; // 08  
    UINT32  dma1_status                           ; // 09  
    UINT32  dma2_sram_addr                        ; // 10  
    UINT32  dma2_dram_addr                        ; // 11  
    UINT32  dma2_txsize                           ; // 12  
    UINT32  dma2_control                          ; // 13  
    UINT32  dma2_status                           ; // 14  
    UINT32  g56_reserved15                        ; // 15  
    UINT32  dsp_inst_page_sw                      ; // 16  
    UINT32  dsp_inst_page0                        ; // 17  
    UINT32  dsp_inst_page1                        ; // 18  
    UINT32  dsp_inst_page2                        ; // 19  
    UINT32  dsp_inst_page3                        ; // 20  
    UINT32  dsp_inst_page4                        ; // 21  
    UINT32  dsp_inst_page5                        ; // 22  
    UINT32  dsp_inst_page6                        ; // 23  
    UINT32  dsp_inst_page7                        ; // 24  
    UINT32  dsp_data_page                         ; // 25  
    UINT32  dsp_rom_page                          ; // 26  
    UINT32  g56_reserved27                        ; // 27  
    UINT32  g56_reserved28                        ; // 28  
    UINT32  g56_reserved29                        ; // 29  
    UINT32  g56_reserved30                        ; // 30  
    UINT32  g56_reserved31                        ; // 31  

    //Group 047 : CEVA DSP
    UINT32  rdif_ctrl                             ; // 00  
    UINT32  rdif_int_ctrl                         ; // 01  
    UINT32  rdif_vint_vector                      ; // 02  
    UINT32  rdif_code_key                         ; // 03  
    UINT32  dsp_status                            ; // 04  
    UINT32  rdif_cfg                              ; // 05  
    UINT32  rdif_oh_ctrl                          ; // 06  
    UINT32  g57_reserved7                         ; // 07  
    UINT32  dsp_timer_ctrl                        ; // 08  
    UINT32  dsp_tcount                            ; // 09  
    UINT32  dsp_tperiod                           ; // 10  
    UINT32  dsp_timer_status                      ; // 11  
    UINT32  g57_reserved12                        ; // 12  
    UINT32  g57_reserved13                        ; // 13  
    UINT32  g57_reserved14                        ; // 14  
    UINT32  g57_reserved15                        ; // 15  
    UINT32  g57_reserved16                        ; // 16  
    UINT32  g57_reserved17                        ; // 17  
    UINT32  g57_reserved18                        ; // 18  
    UINT32  g57_reserved19                        ; // 19  
    UINT32  g57_reserved20                        ; // 20  
    UINT32  g57_reserved21                        ; // 21  
    UINT32  g57_reserved22                        ; // 22  
    UINT32  g57_reserved23                        ; // 23  
    UINT32  g57_reserved24                        ; // 24  
    UINT32  g57_reserved25                        ; // 25  
    UINT32  g57_reserved26                        ; // 26  
    UINT32  g57_reserved27                        ; // 27  
    UINT32  g57_reserved28                        ; // 28  
    UINT32  g57_reserved29                        ; // 29  
    UINT32  g57_reserved30                        ; // 30  
    UINT32  g57_reserved31                        ; // 31  

    //Group 048 : CEVA DSP
    UINT32  dsp_monitor_trigger                   ; // 00  
    UINT32  g58_reserved1                         ; // 01  
    UINT32  dsp_cycle                             ; // 02  
    UINT32  dsp_dma_cnt                           ; // 03  
    UINT32  dsp_cache_nseq_cnt                    ; // 04  
    UINT32  dsp_dma_cycle                         ; // 05  
    UINT32  dsp_max_dma_cycle                     ; // 06  
    UINT32  dsp_min_dma_cycle                     ; // 07  
    UINT32  dsp_cache_acc_cycle                   ; // 08  
    UINT32  dsp_dma_status                        ; // 09  
    UINT32  dsp_error                             ; // 10  
    UINT32  g58_reserved11                        ; // 11  
    UINT32  g58_reserved12                        ; // 12  
    UINT32  g58_reserved13                        ; // 13  
    UINT32  g58_reserved14                        ; // 14  
    UINT32  g58_reserved15                        ; // 15  
    UINT32  ocm_inst_reg                          ; // 16  
    UINT32  ocm_cntl_reg                          ; // 17  
    UINT32  ocm_stat_reg                          ; // 18  
    UINT32  g58_reserved19                        ; // 19  
    UINT32  ocm_data_reg0                         ; // 20  
    UINT32  ocm_data_reg1                         ; // 21  
    UINT32  ocm_data_reg2                         ; // 22  
    UINT32  ocm_data_reg3                         ; // 23  
    UINT32  ocm_data_reg4                         ; // 24  
    UINT32  ocm_data_reg5                         ; // 25  
    UINT32  ocm_data_reg6                         ; // 26  
    UINT32  ocm_data_reg7                         ; // 27  
    UINT32  g58_reserved28                        ; // 28  
    UINT32  g58_reserved29                        ; // 29  
    UINT32  g58_reserved30                        ; // 30  
    UINT32  g58_reserved31                        ; // 31  

    //Group 049 : CEVA DSP
    UINT32  dsp_port0                             ; // 00  
    UINT32  dsp_port1                             ; // 01  
    UINT32  dsp_port2                             ; // 02  
    UINT32  dsp_port3                             ; // 03  
    UINT32  dsp_port4                             ; // 04  
    UINT32  dsp_port5                             ; // 05  
    UINT32  dsp_port6                             ; // 06  
    UINT32  dsp_port7                             ; // 07  
    UINT32  dsp_port8                             ; // 08  
    UINT32  dsp_port9                             ; // 09  
    UINT32  dsp_port10                            ; // 10  
    UINT32  dsp_port11                            ; // 11  
    UINT32  dsp_port12                            ; // 12  
    UINT32  dsp_port13                            ; // 13  
    UINT32  dsp_port14                            ; // 14  
    UINT32  dsp_port15                            ; // 15  
    UINT32  dsp_port16                            ; // 16  
    UINT32  dsp_port17                            ; // 17  
    UINT32  dsp_port18                            ; // 18  
    UINT32  dsp_port19                            ; // 19  
    UINT32  dsp_port20                            ; // 20  
    UINT32  dsp_port21                            ; // 21  
    UINT32  dsp_port22                            ; // 22  
    UINT32  dsp_port23                            ; // 23  
    UINT32  dsp_port24                            ; // 24  
    UINT32  dsp_port25                            ; // 25  
    UINT32  dsp_port26                            ; // 26  
    UINT32  dsp_port27                            ; // 27  
    UINT32  dsp_port28                            ; // 28  
    UINT32  dsp_port29                            ; // 29  
    UINT32  dsp_port30                            ; // 30  
    UINT32  dsp_port31                            ; // 31  
    
    // Group 050 : DDR_PHY0
    UINT32  G050_DDR_PHY0[32]                     ;

    // Group 051 : DDR_PHY0
    UINT32  G051_DDR_PHY0[32]                     ;

    // Group 052 : DDR_PHY0
    UINT32  G052_DDR_PHY0[32]                     ;

    // Group 053 : DDR_PHY0
    UINT32  G053_DDR_PHY0[32]                      ;
    
    // Group 054 : Reserved
    UINT32  G054_RESERVED[32]                     ;
    
    // Group 055 : Reserved
    UINT32  G055_DDC0[32]                     ;
    
    // Group 056 : Reserved
    UINT32  G056_RESERVED[32]                     ;
    
    // Group 057 : Reserved
    UINT32  G057_I2CM0[32]                        ;

    // Group 058 : Reserved
    UINT32  G058_I2CM1[32]                        ;

    // Group 059 : Reserved
    UINT32  G059_RESERVED[32]                     ;

    // Group 060 : AUD
    UINT32  audif_ctrl                            ; // 00
    UINT32  aud_enable                            ; // 01
    UINT32  pcm_cfg                               ; // 02
    UINT32  i2s_mute_flag_ctrl                    ; // 03
    UINT32  ext_adc_cfg                           ; // 04
    UINT32  int_dac_ctrl0                         ; // 05
    UINT32  int_adc_ctrl                          ; // 06
    UINT32  adc_in_path_switch                    ; // 07
    UINT32  int_adc_dac_cfg                       ; // 08
    UINT32  G060_reserved_9                       ; // 09
    UINT32  iec_cfg                               ; // 10
    UINT32  iec0_valid_out                        ; // 11
    UINT32  iec0_par0_out                         ; // 12
    UINT32  iec0_par1_out                         ; // 13
    UINT32  iec1_valid_out                        ; // 14
    UINT32  iec1_par0_out                         ; // 15
    UINT32  iec1_par1_out                         ; // 16
    UINT32  iec0_rx_debug_info                    ; // 17
    UINT32  iec0_valid_in                         ; // 18
    UINT32  iec0_par0_in                          ; // 19
    UINT32  iec0_par1_in                          ; // 20
    UINT32  iec1_rx_debug_info                    ; // 21
    UINT32  iec1_valid_in                         ; // 22
    UINT32  iec1_par0_in                          ; // 23
    UINT32  iec1_par1_in                          ; // 24
    UINT32  iec2_rx_debug_info                    ; // 25
    UINT32  iec2_valid_in                         ; // 26
    UINT32  iec2_par0_in                          ; // 27
    UINT32  iec2_par1_in                          ; // 28
    UINT32  G060_reserved_29                      ; // 29
    UINT32  iec_tx_user_wdata                     ; // 30
    UINT32  iec_tx_user_ctrl                      ; // 31

    // Group 061 : AUD
    UINT32  adcp_ch_enable                        ; // 00, ADCPRC Configuration Group 1  
    UINT32  adcp_fubypass                         ; // 01, ADCPRC Configuration Group 2  
    UINT32  adcp_mode_ctrl                        ; // 02, ADCPRC Mode Control  
    UINT32  adcp_init_ctrl                        ; // 03, ADCP Initialization Control  
    UINT32  adcp_coeff_din                        ; // 04, Coefficient Data Input  
    UINT32  adcp_agc_cfg                          ; // 05, ADCPRC AGC Configuration of Ch0/1  
    UINT32  adcp_agc_cfg2                         ; // 06, ADCPRC AGC Configuration of Ch2/3  
    UINT32  adcp_gain_0                           ; // 07, ADCP System Gain1
    UINT32  adcp_gain_1                           ; // 08, ADCP System Gain2
    UINT32  adcp_gain_2                           ; // 09, ADCP System Gain3
    UINT32  adcp_gain_3                           ; // 10, ADCP System Gain4
    UINT32  adcp_risc_gain                        ; // 11, ADCP RISC Gain  
    UINT32  adcp_mic_l                            ; // 12, ADCPRC Microphone - in Left Channel Data  
    UINT32  adcp_mic_r                            ; // 13, ADCPRC Microphone - in Right Channel Data  
    UINT32  adcp_agc_gain                         ; // 14, ADCPRC AGC Gain  
    UINT32  G061_reserved_15                      ; // 15, Reserved  
    UINT32  aud_apt_mode                          ; // 16, Audio Playback Timer Mode  
    UINT32  aud_apt_data                          ; // 17, Audio Playback Timer  
    UINT32  aud_apt_parameter                     ; // 18, Audio Playback Timer Parameter  
    UINT32  G061_reserved_19                      ; // 19, Reserved  
    UINT32  aud_audhwya                           ; // 20, DRAM Base Address Offset  
    UINT32  aud_inc_0                             ; // 21, DMA Counter Increment/Decrement  
    UINT32  aud_delta_0                           ; // 22, Delta Value  
    UINT32  aud_fifo_enable                       ; // 23, Audio FIFO Enable  
    UINT32  aud_fifo_mode                         ; // 24, FIFO Mode Control  
    UINT32  aud_fifo_support                      ; // 25, Supported FIFOs ( Debug Function )  
    UINT32  aud_fifo_reset                        ; // 26, Host FIFO Reset  
    UINT32  aud_chk_ctrl                          ; // 27, Checksum Control ( Debug Function )  
    UINT32  aud_checksum_data                     ; // 28, Checksum Data ( Debug Function )  
    UINT32  aud_chk_tcnt                          ; // 29, Target Count of Checksum ( Debug Function )  
    UINT32  aud_embedded_input_ctrl               ; // 30, Embedded Input Control ( Debug Function )  
    UINT32  aud_misc_ctrl                         ; // 31, Miscellaneous Control  

    // Group 062 : AUD
    UINT32  aud_ext_dac_xck_cfg                   ; // 00
    UINT32  aud_ext_dac_bck_cfg                   ; // 01
    UINT32  aud_iec0_bclk_cfg                     ; // 02
    UINT32  aud_ext_adc_xck_cfg                   ; // 03
    UINT32  aud_ext_adc_bck_cfg                   ; // 04
    UINT32  aud_int_adc_xck_cfg                   ; // 05
    UINT32  G062_reserved_6                       ; // 06
    UINT32  aud_int_dac_xck_cfg                   ; // 07
    UINT32  aud_int_dac_bck_cfg                   ; // 08
    UINT32  aud_iec1_bclk_cfg                     ; // 09
    UINT32  G062_reserved_10                      ; // 10
    UINT32  aud_pcm_iec_bclk_cfg                  ; // 11
    UINT32  aud_xck_osr104_cfg                    ; // 12
    UINT32  aud_hdmi_tx_mclk_cfg                  ; // 13
    UINT32  aud_hdmi_tx_bck_cfg                   ; // 14
    UINT32  hdmi_tx_i2s_cfg                       ; // 15
    UINT32  hdmi_rx_i2s_cfg                       ; // 16
    UINT32  G062_reserved_17                      ; // 17
    UINT32  G062_reserved_18                      ; // 18
    UINT32  G062_reserved_19                      ; // 19
    UINT32  G062_reserved_20                      ; // 20
    UINT32  int_adc_ctrl3                      	  ; // 21
    UINT32  int_adc_ctrl2                         ; // 22
    UINT32  G062_reserved_23                      ; // 23
    UINT32  G062_reserved_24                      ; // 24
    UINT32  int_dac_ctrl1                         ; // 25
    UINT32  G062_reserved_26                      ; // 26
    UINT32  G062_reserved_27                      ; // 27
    UINT32  G062_reserved_28                      ; // 28
    UINT32  G062_reserved_29                      ; // 29
    UINT32  G062_reserved_30                      ; // 30
    UINT32  G062_reserved_31                      ; // 31

    // Group 063 : AUD
    UINT32  aud_bt_ifx_cfg                        ; // 00
    UINT32  aud_bt_i2s_cfg                        ; // 01
    UINT32  aud_bt_xck_cfg                        ; // 02
    UINT32  aud_bt_bck_cfg                        ; // 03
    UINT32  aud_bt_sync_cfg                       ; // 04
    UINT32  G063_reserved_5                       ; // 05
    UINT32  G063_reserved_6                       ; // 06
    UINT32  G063_reserved_7                       ; // 07
    UINT32  G063_reserved_8                       ; // 08
    UINT32  G063_reserved_9                       ; // 09
    UINT32  G063_reserved_10                      ; // 10
    UINT32  G063_reserved_11                      ; // 11
    UINT32  G063_reserved_12                      ; // 12
    UINT32  G063_reserved_13                      ; // 13
    UINT32  G063_reserved_14                      ; // 14
    UINT32  G063_reserved_15                      ; // 15
    UINT32  G063_reserved_16                      ; // 16
    UINT32  G063_reserved_17                      ; // 17
    UINT32  G063_reserved_18                      ; // 18
    UINT32  G063_reserved_19                      ; // 19
    UINT32  G063_reserved_20                      ; // 20
    UINT32  G063_reserved_21                      ; // 21
    UINT32  G063_reserved_22                      ; // 22
    UINT32  G063_reserved_23                      ; // 23
    UINT32  aud_opt_test_pat                      ; // 24
    UINT32  aud_sys_status0                       ; // 25
    UINT32  aud_sys_status1                       ; // 26
    UINT32  int_adc_ctrl1                         ; // 27
    UINT32  bt_mute_flag                          ; // 28
    UINT32  G063_reserved_29                      ; // 29
    UINT32  G063_reserved_30                      ; // 30
    UINT32  other_config                          ; // 31

    // Group 064 : AUD
    UINT32  aud_a0_base                           ; // 
    UINT32  aud_a0_length                         ; // 
    UINT32  aud_a0_ptr                            ; // 
    UINT32  aud_a0_cnt                            ; // 
    UINT32  aud_a1_base                           ; // 
    UINT32  aud_a1_length                         ; // 
    UINT32  aud_a1_ptr                            ; // 
    UINT32  aud_a1_cnt                            ; // 
    UINT32  aud_a2_base                           ; // 
    UINT32  aud_a2_length                         ; // 
    UINT32  aud_a2_ptr                            ; // 
    UINT32  aud_a2_cnt                            ; // 
    UINT32  aud_a3_base                           ; // 
    UINT32  aud_a3_length                         ; // 
    UINT32  aud_a3_ptr                            ; // 
    UINT32  aud_a3_cnt                            ; // 
    UINT32  aud_a4_base                           ; // 
    UINT32  aud_a4_length                         ; // 
    UINT32  aud_a4_ptr                            ; // 
    UINT32  aud_a4_cnt                            ; // 
    UINT32  aud_a5_base                           ; // 
    UINT32  aud_a5_length                         ; // 
    UINT32  aud_a5_ptr                            ; // 
    UINT32  aud_a5_cnt                            ; // 
    UINT32  aud_a6_base                           ; // 
    UINT32  aud_a6_length                         ; // 
    UINT32  aud_a6_ptr                            ; // 
    UINT32  aud_a6_cnt                            ; // 
    UINT32  aud_a7_base                           ; // 
    UINT32  aud_a7_length                         ; // 
    UINT32  aud_a7_ptr                            ; // 
    UINT32  aud_a7_cnt                            ; // 

    // Group 065 : AUD
    UINT32  aud_a8_base                           ; //
    UINT32  aud_a8_length                         ; //
    UINT32  aud_a8_ptr                            ; //
    UINT32  aud_a8_cnt                            ; //
    UINT32  aud_a9_base                           ; //
    UINT32  aud_a9_length                         ; //
    UINT32  aud_a9_ptr                            ; //
    UINT32  aud_a9_cnt                            ; //
    UINT32  aud_a10_base                          ; //
    UINT32  aud_a10_length                        ; //
    UINT32  aud_a10_ptr                           ; //
    UINT32  aud_a10_cnt                           ; //
    UINT32  aud_a11_base                          ; //
    UINT32  aud_a11_length                        ; //
    UINT32  aud_a11_ptr                           ; //
    UINT32  aud_a11_cnt                           ; //
    UINT32  aud_a12_base                          ; //
    UINT32  aud_a12_length                        ; //
    UINT32  aud_a12_ptr                           ; //
    UINT32  aud_a12_cnt                           ; //
    UINT32  aud_a13_base                          ; //
    UINT32  aud_a13_length                        ; //
    UINT32  aud_a13_ptr                           ; //
    UINT32  aud_a13_cnt                           ; //
    UINT32  aud_a14_base                          ; //
    UINT32  aud_a14_length                        ; //
    UINT32  aud_a14_ptr                           ; //
    UINT32  aud_a14_cnt                           ; //
    UINT32  aud_a15_base                          ; //
    UINT32  aud_a15_length                        ; //
    UINT32  aud_a15_ptr                           ; //
    UINT32  aud_a15_cnt                           ; //


    // Group 066 : AUD
    UINT32  aud_a16_base                          ; //
    UINT32  aud_a16_length                        ; //
    UINT32  aud_a16_ptr                           ; //
    UINT32  aud_a16_cnt                           ; //
    UINT32  aud_a17_base                          ; //
    UINT32  aud_a17_length                        ; //
    UINT32  aud_a17_ptr                           ; //
    UINT32  aud_a17_cnt                           ; //
    UINT32  aud_a18_base                          ; //
    UINT32  aud_a18_length                        ; //
    UINT32  aud_a18_ptr                           ; //
    UINT32  aud_a18_cnt                           ; //
    UINT32  aud_a19_base                          ; //
    UINT32  aud_a19_length                        ; //
    UINT32  aud_a19_ptr                           ; //
    UINT32  aud_a19_cnt                           ; //
    UINT32  G066_reserved_16                      ; //
    UINT32  G066_reserved_17                      ; //
    UINT32  G066_reserved_18                      ; //
    UINT32  G066_reserved_19                      ; //
    UINT32  G066_reserved_20                      ; //
    UINT32  G066_reserved_21                      ; //
    UINT32  G066_reserved_22                      ; //
    UINT32  G066_reserved_23                      ; //
    UINT32  G066_reserved_24                      ; //
    UINT32  G066_reserved_25                      ; //
    UINT32  G066_reserved_26                      ; //
    UINT32  G066_reserved_27                      ; //
    UINT32  G066_reserved_28                      ; //
    UINT32  G066_reserved_29                      ; //
    UINT32  G066_reserved_30                      ; //
    UINT32  G066_reserved_31                      ; //

    // Group 067 : AUD
    UINT32  aud_grm_master_gain                   ; // Gain Control  
    UINT32  aud_grm_gain_control_0                ; // Gain Control  
    UINT32  aud_grm_gain_control_1                ; // Gain Control  
    UINT32  aud_grm_gain_control_2                ; // Gain Control  
    UINT32  aud_grm_gain_control_3                ; // Gain Control  
    UINT32  aud_grm_gain_control_4                ; // Gain Control  
    UINT32  aud_grm_mix_control_0                 ; // Mixer Setting  
    UINT32  aud_grm_mix_control_1                 ; // Mixer Setting  
    UINT32  aud_grm_mix_control_2                 ; // Mixer Setting  
    UINT32  aud_grm_switch_0                      ; // Channel Switch  
    UINT32  aud_grm_switch_1                      ; // Channel Switch  
    UINT32  aud_grm_switch_int                    ; // Channel Switch  
    UINT32  aud_grm_delta_volume                  ; // Gain Update  
    UINT32  aud_grm_delta_ramp_pcm                ; // Gain Update  
    UINT32  aud_grm_delta_ramp_risc               ; // Gain Update  
    UINT32  aud_grm_delta_ramp_linein             ; // Gain Update  
    UINT32  aud_grm_other                         ; // Other Setting  
    UINT32  aud_grm_gain_control_5                ; // Gain Control  
    UINT32  aud_grm_gain_control_6                ; // Gain Control  
    UINT32  aud_grm_gain_control_7                ; // Gain Control  
    UINT32  aud_grm_gain_control_8                ; // Gain Control  
    UINT32  aud_grm_fifo_eflag                    ; // FIFO Error Flag  
    UINT32  G067_reserved_22                      ; // 
    UINT32  G067_reserved_23                      ; // 
    UINT32  aud_grm_switch_hdmi_tx                ; // AUD_GRM_SWITCH_HDMI_TX
    UINT32  G067_reserved_25                      ; // 
    UINT32  G067_reserved_26                      ; // 
    UINT32  G067_reserved_27                      ; // 
    UINT32  G067_reserved_28                      ; // 
    UINT32  G067_reserved_29                      ; // 
    UINT32  G067_reserved_30                      ; // 
    UINT32  G067_reserved_31                      ; // 

    // Group 068 : AUD
    UINT32  G068_AUD[32]                          ;

    // Group 069 : Reserved
    UINT32  G069_RESERVED[32]                     ;

    // Group 070 : Reserved
    UINT32  G070_RESERVED[32]                     ;

    // Group 071 : Reserved
    UINT32  G071_RESERVED[32]                     ;

    // Group 072 : Reserved
    UINT32  G072_RESERVED[32]                     ;

    // Group 073 : Reserved
    UINT32  G073_RESERVED[32]                     ;

    // Group 074 : Reserved
    UINT32  G074_RESERVED[32]                     ;

    // Group 075 : Reserved
    UINT32  G075_RESERVED[32]                     ;

    // Group 076 : Reserved
    UINT32  G076_RESERVED[32]                     ;

    // Group 077 : Reserved
    UINT32  G077_RESERVED[32]                     ;

    // Group 078 : Reserved
    UINT32  G078_RESERVED[32]                     ;

    // Group 079 : Reserved
    UINT32  G079_RESERVED[32]                     ;

    // Group 080 : Reserved
    UINT32  G080_RESERVED[32]                     ;

    // Group 081 : Reserved
    UINT32  G081_RESERVED[32]                     ;

    // Group 082 : Reserved
    UINT32  G082_RESERVED[32]                     ;

    // Group 083 : SECGRP1
    UINT32  G083_SECGRP1[32]                      ;

    // Group 084 : MB0_SD0_WP
    UINT32  G084_MB0_SD0_WP[32]                   ;

    // Group 085 : MB1_SD1_WP
    UINT32  G085_MB1_SD1_WP[32]                   ;

    // Group 086 : Reserved
    UINT32  G086_RESERVED[32]                     ;

    // Group 087 : Reserved
    UINT32  spi_nand_ctrl                         ;
    UINT32  spi_nand_wait                         ;
    UINT32  spi_nand_cust_cmd                     ;
    UINT32  spi_nand_addr_low                     ;
    UINT32  spi_nand_addr_high                    ;
    UINT32  spi_nand_data_low                     ;
    UINT32  spi_nand_data_high                    ;
    UINT32  spi_nand_status                       ;
    UINT32  spi_nand_cfg0                         ;
    UINT32  spi_nand_cfg1                         ;
    UINT32  spi_nand_cfg2                         ;
    UINT32  spi_nand_cfg3                         ;
    UINT32  spi_nand_cfg4                         ;
    UINT32  spi_nand_cfg5                         ;
    UINT32  spi_nand_cfg6                         ;
    UINT32  spi_nand_cfg7                         ;
    UINT32  spi_nand_cfg8                         ;
    UINT32  spi_nand_cust_cmd2                    ;
    UINT32  spi_nand_data64                       ;
    UINT32  spi_nand_buf_addr                     ;
    UINT32  spi_nand_status2                      ;
    UINT32  spi_nand_status3                      ;
    UINT32  G087_RESERVED[10]                     ;

    // Group 088 : MIPIRX
    //UINT32  G088_MIPIRX[32]                       ;
    UINT32  mipi_int_status                       ;//0x00 0x00 
    UINT32  mipi_probesel                         ;//0x01 0x04
    UINT32  mipi_lvds_wordcnt                     ;//0x02 0x08
    UINT32  mipi_lvds_test                        ;//0x03 0x0c
    UINT32  mipi_lvds_reset                       ;//0x04 0x10    
    UINT32  mipi_fsm_rsten                        ;//0x05 0x14  
    UINT32  G088_RESERVED6                        ;//0x06 0x18  
    UINT32  mipi_lvdsen                           ;//0x07 0x1c  
    UINT32  mipi_digital_logic_ctrl               ;//0x08 0x20  
    UINT32  mipi_lvds_timing_ctrl                 ;//0x09 0x24  
    UINT32  mipi_image_datanum                    ;//0x0a 0x28  
    UINT32  mipi_syncword                         ;//0x0b 0x2c  
    UINT32  mipi_lvds_ctrlword_start              ;//0x0c 0x30  
    UINT32  mipi_lvds_ctrlword_end                ;//0x0d 0x34  
    UINT32  mipi_sel_lvcmos                       ;//0x0e 0x38  
    UINT32  G088_RESERVED15                       ;//0x0f 0x3c  
    UINT32  mipi_ecc_evt                          ;//0x10 0x40  
    UINT32  mipi_crc_evt                          ;//0x11 0x44  
    UINT32  mipi_ecc_ctrl                         ;//0x12 0x48  
    UINT32  G088_RESERVED19                       ;//0x13 0x4c  
    UINT32  G088_RESERVED20                       ;//0x14 0x50  
    UINT32  G088_RESERVED21                       ;//0x15 0x54  
    UINT32  G088_RESERVED22                       ;//0x16 0x58  
    UINT32  G088_RESERVED23                       ;//0x17 0x5c  
    UINT32  G088_RESERVED24                       ;//0x18 0x60  
    UINT32  G088_RESERVED25                       ;//0x19 0x64  
    UINT32  G088_RESERVED26                       ;//0x1a 0x68  
    UINT32  G088_RESERVED27                       ;//0x1b 0x6c  
    UINT32  G088_RESERVED28                       ;//0x1c 0x70  
    UINT32  G088_RESERVED29                       ;//0x1d 0x74  
    UINT32  G088_RESERVED30                       ;//0x1e 0x78  
    UINT32  G088_RESERVED31                       ;//0x1f 0x7c  


    // Group 089 : Reserved
    UINT32  G089_RESERVED[32]                     ;

    // Group 090 : SPI_TOUCH
    UINT32  TOU_TX_DATA_2_1_0_ADDR                ; // 00  (ADDR : 0x9C00_2D00)
    UINT32  TOU_TX_DATA_6_5_4_3                   ; // 01  (ADDR : 0x9C00_2D04)
    UINT32  TOU_TX_DATA_10_9_8_7                  ; // 02  (ADDR : 0x9C00_2D08)
    UINT32  TOU_TX_DATA_14_13_12_11               ; // 03  (ADDR : 0x9C00_2D0C)
    UINT32  TOU_TX_DATA_15                        ; // 04  (ADDR : 0x9C00_2D10)
    UINT32  G090_RESERVED_0[4]                    ; //     (ADDR : 0x9C00_2D14) ~ (ADDR : 0x9C00_2D20)
    UINT32  TOU_RX_DATA_3_2_1_0                   ; // 09  (ADDR : 0x9C00_2D24)
    UINT32  TOU_RX_DATA_7_6_5_4                   ; // 10  (ADDR : 0x9C00_2D28)
    UINT32  TOU_RX_DATA_11_10_9_8                 ; // 11  (ADDR : 0x9C00_2D2C)
    UINT32  TOU_RX_DATA_15_14_13_12               ; // 12  (ADDR : 0x9C00_2D30)
    UINT32  G090_RESERVED_1[4]                    ; //     (ADDR : 0x9C00_2D34) ~ (ADDR : 0x9C00_2D40)
    UINT32  TOU_SPI_CTRL_CLKSEL                   ; // 17  (ADDR : 0x9C00_2D44)
    UINT32  TOU_BYTE_NO                           ; // 18  (ADDR : 0x9C00_2D48)
    UINT32  TOU_SPI_INT_BUSY                      ; // 19  (ADDR : 0x9C00_2D4C)  
    UINT32  G090_RESERVED_2[12]                   ; // reserved ~0x9C00_2D7C

    // Group 091 : SPI_MASTER
    UINT32  MST_TX_DATA_2_1_0_ADDR                ; // 00  (ADDR : 0x9C00_2D80)
    UINT32  MST_TX_DATA_6_5_4_3                   ; // 01  (ADDR : 0x9C00_2D84)
    UINT32  MST_TX_DATA_10_9_8_7                  ; // 02  (ADDR : 0x9C00_2D88)
    UINT32  MST_TX_DATA_14_13_12_11               ; // 03  (ADDR : 0x9C00_2D8C)
    UINT32  MST_TX_DATA_15                        ; // 04  (ADDR : 0x9C00_2D90)
    UINT32  G091_RESERVED_0[4]                    ; //     (ADDR : 0x9C00_2D94) ~ (ADDR : 0x9C00_2DA0)
    UINT32  MST_RX_DATA_3_2_1_0                   ; // 09  (ADDR : 0x9C00_2DA4)
    UINT32  MST_RX_DATA_7_6_5_4                   ; // 10  (ADDR : 0x9C00_2DA8)
    UINT32  MST_RX_DATA_11_10_9_8                 ; // 11  (ADDR : 0x9C00_2DAC)
    UINT32  MST_RX_DATA_15_14_13_12               ; // 12  (ADDR : 0x9C00_2DB0)
    UINT32  G091_RESERVED_1[4]                    ; //     (ADDR : 0x9C00_2DB4) ~ (ADDR : 0x9C00_2DC0)
    UINT32  SPI_CTRL_CLKSEL                       ; // 17  (ADDR : 0x9C00_2DC4)
    UINT32  BYTE_NO                               ; // 18  (ADDR : 0x9C00_2DC8)
    UINT32  SPI_INT_BUSY                          ; // 19  (ADDR : 0x9C00_2DCC)
    UINT32  DMA_CTRL                              ; // 20  (ADDR : 0x9C00_2DD0)
    UINT32  DMA_LENGTH                            ; // 21  (ADDR : 0x9C00_2DD4)
    UINT32  DMA_ADDR                              ; // 22  (ADDR : 0x9C00_2DD8)
    UINT32  G091_RESERVED_2[1]                    ; // 23  (ADDR : 0x9C00_2DDC)
    UINT32  DMA_ADDR_STAT                         ; // 24  (ADDR : 0x9C00_2DE0)
    UINT32  G091_RESERVED_3[1]                    ; // 25  (ADDR : 0x9C00_2DE4)
    UINT32  UART_DMA_CTRL                         ; // 26  (ADDR : 0x9C00_2DE8)
    UINT32  G091_RESERVED_4[1]                    ; // 27  (ADDR : 0x9C00_2DEC)
    UINT32  G091_RESERVED_5[2]                    ; //     (ADDR : 0x9C00_2DF4) ~ (ADDR : 0x9C00_2DF4)
    UINT32  SPI_EXTRA_CYCLE                       ; // 30  (ADDR : 0x9C00_2DF8)
    UINT32  MST_DMA_DATA_RDY                      ; // 31  (ADDR : 0x9C00_2DFC)

    // Group 092 : SPI_SLAVE
    UINT32  SLV_TX_DATA_2_1_0                     ; // 00  (ADDR : 0x9C00_2E00) 
    UINT32  SLV_TX_DATA_6_5_4_3                   ; // 01  (ADDR : 0x9C00_2E04)
    UINT32  SLV_TX_DATA_10_9_8_7                  ; // 02  (ADDR : 0x9C00_2E08)
    UINT32  SLV_TX_DATA_14_13_12_11               ; // 03  (ADDR : 0x9C00_2E0C)
    UINT32  SLV_TX_DATA_15                        ; // 04  (ADDR : 0x9C00_2E10)
    UINT32  G092_RESERVED_0[4]                    ; //     (ADDR : 0x9C00_2E14) ~ (ADDR : 0x9C00_2E20)
    UINT32  SLV_RX_DATA_3_2_1_0                   ; // 09  (ADDR : 0x9C00_2E24)
    UINT32  SLV_RX_DATA_7_6_5_4                   ; // 10  (ADDR : 0x9C00_2E28)
    UINT32  SLV_RX_DATA_11_10_9_8                 ; // 11  (ADDR : 0x9C00_2E2C)
    UINT32  SLV_RX_DATA_15_14_13_12               ; // 12  (ADDR : 0x9C00_2E30)
    UINT32  G092_RESERVED_1[4]                    ; //     (ADDR : 0x9C00_2E34) ~ (ADDR : 0x9C00_2E40)
    UINT32  RISC_INT_DATA_RDY                     ; // 17  (ADDR : 0x9C00_2E44)
    UINT32  SLV_DMA                               ; // 18  (ADDR : 0x9C00_2E48)
    UINT32  SLV_DMA_LENGTH                        ; // 19  (ADDR : 0x9C00_2E4C)
    UINT32  SLV_DMA_INI_ADDR                      ; // 20  (ADDR : 0x9C00_2E50)
    UINT32  G092_RESERVED_2[2]                    ; //     (ADDR : 0x9C00_2E54) ~ (ADDR : 0x9C00_2E58)
    UINT32  ADDR_SPI_BUSY                         ; // 23  (ADDR : 0x9C00_2E5C)
    UINT32  G092_RESERVED_3[8]                    ; //     (ADDR : 0x9C00_2E60) ~ (ADDR : 0x9C00_2E7C)

    // Group 093 : Reserved
    UINT32  G093_RESERVED[32]                     ;

    // Group 094 : TOUCH CONTROLLER
    UINT32 touch_cfg00;
    UINT32 touch_cfg01;
    UINT32 touch_cfg02;
    UINT32 touch_cfg03;
    UINT32 touch_cfg04;
    UINT32 touch_cfg05;
    UINT32 touch_cfg06;
    UINT32 touch_cfg07;
    UINT32 touch_cfg08;
    UINT32 touch_cfg09;
    UINT32 touch_cfg0a;
    UINT32 touch_cfg0b;
    UINT32 touch_cfg0c;
    UINT32 touch_cfg0d;
    UINT32 touch_cfg0e;
    UINT32 touch_cfg0f;
    UINT32 touch_cfg10;
    UINT32 touch_cfg11;
    UINT32 touch_cfg12;
    UINT32 touch_cfg13;
    UINT32 touch_cfg14;
    UINT32 touch_cfg15;
    UINT32 touch_cfg16;
    UINT32 touch_cfg17;
    UINT32 touch_cfg18;
    UINT32 touch_cfg19;
    UINT32 touch_cfg1a;
    UINT32 touch_cfg1b;
    UINT32 touch_cfg1c;
    UINT32 touch_cfg1d;
    UINT32 touch_cfg1e;
    UINT32 touch_cfg1f;

    // Group 095 : Reserved
    UINT32  G095_RESERVED[32]                     ;

    // Group 096 : STC AV0
    UINT32	stc_15_0_av0;       
    UINT32	stc_31_16_av0;      
    UINT32	stc_64_av0;         
    UINT32	stc_divisor_av0;    
    UINT32	rtc_15_0_av0;       
    UINT32	rtc_31_16_av0;      
    UINT32	rtc_divisor_av0;    
    UINT32	stc_config_av0;     
    UINT32	timer0_ctrl_av0;    
    UINT32	timer0_cnt_av0;     
    UINT32	timer1_ctrl_av0;    
    UINT32	timer1_cnt_av0;     
    UINT32	timerw_ctrl_av0;    
    UINT32	timerw_cnt_av0;     
    UINT32	stc_47_32_av0;      
    UINT32	stc_63_48_av0;      
    UINT32	timer2_ctrl_av0;    
    UINT32	timer2_divisor_av0; 
    UINT32	timer2_reload_av0;  
    UINT32	timer2_cnt_av0;     
    UINT32	timer3_ctrl_av0;    
    UINT32	timer3_divisor_av0; 
    UINT32	timer3_reload_av0;  
    UINT32	timer3_cnt_av0;     
    UINT32	stcl_0_av0;         
    UINT32	stcl_1_av0;         
    UINT32	stcl_2_av0;         
    UINT32	atc_0_av0;          
    UINT32	atc_1_av0;          
    UINT32	atc_2_av0;          
    UINT32	g12_reserved_av0[2];

    // Group 097 : STC AV1
    UINT32	stc_15_0_av1;       
    UINT32	stc_31_16_av1;      
    UINT32	stc_64_av1;         
    UINT32	stc_divisor_av1;    
    UINT32	rtc_15_0_av1;       
    UINT32	rtc_31_16_av1;      
    UINT32	rtc_divisor_av1;    
    UINT32	stc_config_av1;     
    UINT32	timer0_ctrl_av1;    
    UINT32	timer0_cnt_av1;     
    UINT32	timer1_ctrl_av1;    
    UINT32	timer1_cnt_av1;     
    UINT32	timerw_ctrl_av1;    
    UINT32	timerw_cnt_av1;     
    UINT32	stc_47_32_av1;      
    UINT32	stc_63_48_av1;      
    UINT32	timer2_ctrl_av1;    
    UINT32	timer2_divisor_av1; 
    UINT32	timer2_reload_av1;  
    UINT32	timer2_cnt_av1;     
    UINT32	timer3_ctrl_av1;    
    UINT32	timer3_divisor_av1; 
    UINT32	timer3_reload_av1;  
    UINT32	timer3_cnt_av1;     
    UINT32	stcl_0_av1;         
    UINT32	stcl_1_av1;         
    UINT32	stcl_2_av1;         
    UINT32	atc_0_av1;          
    UINT32	atc_1_av1;          
    UINT32	atc_2_av1;          
    UINT32	g12_reserved_av1[2];

    // Group 098 : PMC
    UINT32	PMC_TIMER;  
    UINT32	PMC_CTRL;  
    UINT32	PMC_XTAL27M_PWD_A; 
    UINT32	PMC_XTAL27M_PWD_B; 
    UINT32	PMC_XTAL32K_PWD_A; 
    UINT32	PMC_XTAL32K_PWD_B; 
    UINT32	PMC_CLK27M_PWD_A; 
    UINT32	PMC_CLK27M_PWD_B; 
    UINT32	PMC_TIMER2; 
    UINT32	G098_RESERVED[23]; 

    // Group 099 : STC AV2
    UINT32      stc_15_0_av2                          ; // 00
    UINT32      stc_31_16_av2                         ; // 01
    UINT32      stc_64_av2                            ; // 02
    UINT32      stc_divisor_av2                       ; // 03
    UINT32      rtc_15_0_av2                          ; // 04
    UINT32      rtc_31_16_av2                         ; // 05
    UINT32      rtc_divisor_av2                       ; // 06
    UINT32      stc_config_av2                        ; // 07
    UINT32      timer0_ctrl_av2                       ; // 08
    UINT32      timer0_cnt_av2                        ; // 09
    UINT32      timer1_ctrl_av2                       ; // 10
    UINT32      timer1_cnt_av2                        ; // 11
    UINT32      timerw_ctrl_av2                       ; // 12
    UINT32      timerw_cnt_av2                        ; // 13
    UINT32	stc_47_32_av2                         ; // 14
    UINT32	stc_63_48_av2                         ; // 15
    UINT32      timer2_ctrl_av2                       ; // 16
    UINT32      timer2_divisor_av2                    ; // 17
    UINT32      timer2_reload_av2                     ; // 18
    UINT32      timer2_cnt_av2                        ; // 19
    UINT32      timer3_ctrl_av2                       ; // 20
    UINT32      timer3_divisor_av2                    ; // 21
    UINT32      timer3_reload_av2                     ; // 22
    UINT32      timer3_cnt_av2                        ; // 23
    UINT32      stcl_0_av2                            ; // 24
    UINT32      stcl_1_av2                            ; // 25
    UINT32      stcl_2_av2                            ; // 26
    UINT32      atc_0_av2                             ; // 27
    UINT32      atc_1_av2                             ; // 28
    UINT32      atc_2_av2                             ; // 29
    UINT32      g12_reserved_av2[2]                   ; // 30 ~ 31

    // Group 100 : Reserved
    UINT32  G100_RESERVED[32]                     ;

    // Group 101 : Reserved
    UINT32  G101_RESERVED[32]                     ;

    // Group 102 : CARD3
    UINT32  G102_CARD_CTL3[32]                    ;

    // Group 103 : CARD3
    UINT32  G103_CARD_CTL3[32]                    ;

    // Group 104 : CARD3
    UINT32  G104_CARD_CTL3[32]                    ;

    // Group 105 : CARD3
    UINT32  G105_CARD_CTL3[32]                    ;

    // Group 106 : CARD3
    UINT32  G106_CARD_CTL3[32]                    ;

    // Group 107 : GPU
    UINT32  G107_GPU[32]                     ;

    // Group 108 : FONT_RENDER
    UINT32  font_control                          ;
    UINT32  font_cmd_fifo                         ;
    UINT32  font_cmd_flush                        ;
    UINT32  font_fifo_addr                        ;
    UINT32  font_fifo_w_ptr                       ;
    UINT32  font_fifo_r_ptr                       ;
    UINT32  font_status                           ;
    UINT32  font_debug_status                     ;
    UINT32  font_fifo_empty_cnt                   ;
    UINT32  G108_FONT_RENDER[23]                  ;

    // Group 109 : IMG_DEC/HUF
    UINT32  jpeg_huff_mode                        ;
    UINT32  jpeg_huff_ctrl                        ;
    UINT32  jpeg_huff_stats                       ;
    UINT32  jpeg_huff_scan_ctrl                   ;
    UINT32  jpeg_huff_table                       ;
    UINT32  jpeg_huff_mcuno                       ;
    UINT32  jpeg_huff_jpeghsize                   ;
    UINT32  jpeg_huff_jpegvsize                   ;
    UINT32  jpeg_huff_bitstream                   ;
    UINT32  jpeg_huff_bits_dma_offset             ;
    UINT32  jpeg_huff_wr_huff_info                ;
    UINT32  jpeg_huff_bits_info                   ;
    UINT32  jpeg_huff_rd_huff_info                ;
    UINT32  jpeg_huff_dma_offset_0                ;
    UINT32  jpeg_huff_dma_offset_1                ;
    UINT32  jpeg_huff_acval_offset_0              ;
    UINT32  jpeg_huff_acval_offset_1              ;
    UINT32  jpeg_huff_acval_offset_2              ;
    UINT32  jpeg_huff_acval_offset_3              ;
    UINT32  jpeg_huff_wr_dc_01                    ;
    UINT32  jpeg_huff_wr_dc_23                    ;
    UINT32  jpeg_huff_wr_acval_0                  ;
    UINT32  jpeg_huff_wr_acval_1                  ;
    UINT32  jpeg_huff_wr_acval_2                  ;
    UINT32  jpeg_huff_wr_acval_3                  ;
    UINT32  jpeg_huff_rd_addr                     ;
    UINT32  jpeg_huff_rd_val                      ;
    UINT32  jpeg_huff_probe                       ;
    UINT32  jr_control                            ;
    UINT32  jr_status                             ;
    UINT32  jr_reg_num                            ;
    UINT32  jr_reg_data                           ;

    // Group 110 : IMG_DEC/JDM
    UINT32  jdm_mode                              ;
    UINT32  jdm_status                            ;
    UINT32  jdm_dma1_mode                         ;
    UINT32  jdm_dma1_xaddr                        ;
    UINT32  jdm_dma1_yaddr                        ;
    UINT32  jdm_dma1_done                         ;
    UINT32  jdm_dma1_start_addr                   ;
    UINT32  jdm_dma1_block_num                    ;
    UINT32  g110_reserved_08                      ;
    UINT32  g110_reserved_09                      ;
    UINT32  g110_reserved_10                      ;
    UINT32  g110_reserved_11                      ;
    UINT32  g110_reserved_12                      ;
    UINT32  g110_reserved_13                      ;
    UINT32  g110_reserved_14                      ;
    UINT32  g110_reserved_15                      ;
    UINT32  g110_reserved_16                      ;
    UINT32  g110_reserved_17                      ;
    UINT32  g110_reserved_18                      ;
    UINT32  g110_reserved_19                      ;
    UINT32  g110_reserved_20                      ;
    UINT32  g110_reserved_21                      ;
    UINT32  jdm_dc_luma_base_lsb                  ;
    UINT32  jdm_dc_luma_base_msb                  ;
    UINT32  jdm_dc_chroma_base_lsb                ;
    UINT32  jdm_dc_chroma_base_msb                ;
    UINT32  jdm_dc_width                          ;
    UINT32  g110_reserved_27                      ;
    UINT32  g110_reserved_28                      ;
    UINT32  jdm_jpeg_offset                       ;
    UINT32  g110_reserved_30                      ;
    UINT32  g110_reserved_31                      ;

    // Group 111 : IMG_DEC/INVQ
    UINT32  jpeg_invq_qmx_par                     ;
    UINT32  jpeg_invq_mode                        ;
    UINT32  jpeg_invq_chksum                      ;
    UINT32  g111_reserved[29]                     ;

    // Group 112 : IMG_DEC/PNG
    UINT32  png_dec_mode                          ;
    UINT32  png_bs_str_addr_m                     ;
    UINT32  png_bs_str_addr_l                     ;
    UINT32  png_bs_end_addr_m                     ;
    UINT32  png_bs_end_addr_l                     ;
    UINT32  png_bs_buf_addr                       ;
    UINT32  png_bs_offset                         ;
    UINT32  png_bs_used_cnt                       ;
    UINT32  png_bs_used_bit                       ;
    UINT32  png_dec_ctrl                          ;
    UINT32  png_img_width                         ;
    UINT32  png_img_height                        ;
    UINT32  png_img_type                          ;
    UINT32  png_chunk_size_m                      ;
    UINT32  png_chunk_size_l                      ;
    UINT32  png_blk_info                          ;
    UINT32  png_huf_tb_addr                       ;
    UINT32  png_huf_tb_ctrl                       ;
    UINT32  png_huf_tb_data                       ;
    UINT32  png_interrupt                         ;
    UINT32  png_scl_ext_addr_m                    ;
    UINT32  png_scl_ext_addr_l                    ;
    UINT32  png_scl_buf_addr                      ;
    UINT32  png_bw_ext_addr_m                     ;
    UINT32  png_bw_ext_addr_l                     ;
    UINT32  png_rem_chunk_size_m                  ;
    UINT32  png_rem_chunk_size_l                  ;
    UINT32  png_pxl_ext_addr_m                    ;
    UINT32  png_pxl_ext_addr_l                    ;
    UINT32  png_pxl_line                          ;
    UINT32  png_probe_addr                        ;
    UINT32  png_probe_value                       ;

    // Group 113 : Reserved
    UINT32  G113_RESERVED[32]                     ;

    // Group 114 : BV
    UINT32  bv_ctrl                               ; //
    UINT32  bv_config                             ; //
    UINT32  bv_interrupt                          ; //
    UINT32  bv_ref_base_0                         ; //
    UINT32  bv_ref_base_1                         ; //
    UINT32  bv_ref_base_2                         ; //
    UINT32  bv_ref_base_3                         ; //
    UINT32  bv_ref_base_4                         ; //
    UINT32  bv_ref_base_5                         ; //
    UINT32  bv_ref_stride_03                      ; //
    UINT32  bv_ref_stride_47                      ; //
    UINT32  bv_ref_pic_wh_0                       ; //
    UINT32  bv_ref_pic_wh_1                       ; //
    UINT32  bv_ref_pic_wh_2                       ; //
    UINT32  bv_ref_pic_wh_3                       ; //
    UINT32  bv_ref_pic_wh_4                       ; //
    UINT32  bv_ref_pic_wh_5                       ; //
    UINT32  bv_lut_base                           ; //
    UINT32  bv_lut_size                           ; //
    UINT32  bv_out_base                           ; //
    UINT32  bv_out_pic_wh                         ; //
    UINT32  bv_out_stride                         ; //
    UINT32  bv_chksum                             ; //
    UINT32  bv_status_0                           ; //
    UINT32  bv_status_1                           ; //
    UINT32  bv_status_2                           ; //
    UINT32  bv_status_3                           ; //
    UINT32  G114_RESERVED[5]                      ; //

    // Group 115 : GPS
    UINT32  G115_GPS_RESERVED1                    ;
    UINT32  GPS_CTRL                              ;
    UINT32  G115_GPS_RESERVED2[30]                ;

    // Group 116 : Reserved
    UINT32  G116_RESERVED1                        ;
    UINT32  RTC_CTRL                              ;
    UINT32  RTC_TIMER_CLOCK                       ;
    UINT32  RTC_ONTIME_SET                        ;
    UINT32  RTC_CLOCK_SET                         ;
    UINT32  G116_RESERVED2[27]                    ;

    // Group 117 : Reserved
    UINT32  G117_RESERVED[32]                     ;

    // Group 118 : CARD_CTL0
    UINT32  G118_CARD_CTL0[32]                    ;

    // Group 119 : CARD_CTL0
    UINT32  G119_CARD_CTL0[32]                    ;

    // Group 120 : CARD_CTL0
    UINT32  G120_CARD_CTL0[32]                    ;

    // Group 121 : CARD_CTL0
    UINT32  G121_CARD_CTL0[32]                    ;

    // Group 122 : CARD_CTL0
    UINT32  G122_CARD_CTL0[32]                    ;

    // Group 123 : Reserved
    UINT32  G123_RESERVED[32]                     ;

    // Group 124 : OTP
        UINT32 OTP_RN_CTRL;
	UINT32 OTP_RN_CMD;
	UINT32 OTP_RN_CMD_ST;
	UINT32 OTP_RN_ADDR;
	UINT32 OTP_RN_PGM_CNT;
	UINT32 OTP_RN_RDATA_0;
	UINT32 OTP_RN_RDATA_1;
	UINT32 OTP_RN_RDATA_2;
	UINT32 OTP_RN_RDATA_3;
        UINT32 OTP_RN_WDATA_0;
        UINT32 OTP_RN_WDATA_1;
        UINT32 OTP_RN_WDATA_2;
        UINT32 OTP_RN_WDATA_3;
	UINT32 OTP_RN_SM_STATUS;
	UINT32 OTP_RN_GCLK_CTRL;
        UINT32 OTP_RN_SEL_CTRL;
        UINT32 OTP_RN_GPIO_CTRL;
	UINT32 OTP_RN_GPIO_ADR_MODE;
	UINT32 OTP_RN_CUSTOMER_CMD;
	UINT32 OTP_RN_CUSTOMER_CMD_ST;
	UINT32 OTP_RN_CUSTOMER_ADDR;
	UINT32 OTP_RN_CUSTOMER_RDATA;
	UINT32 OTP_RN_CUSTOMER_WDATA;
	UINT32 OTP_RN_OTP_RR_SR_3;
	UINT32 OTP_RN_OTP_INIT_DATA_0;
	UINT32 OTP_RN_OTP_INIT_DATA_1;
	UINT32 OTP_RN_OTP_INIT_DATA_2;
	UINT32 OTP_RN_OTP_INIT_DATA_3;
	UINT32 OTP_RN_OTP_INIT_DATA_4;
	UINT32 OTP_RN_OTP_INIT_DATA_5;
	UINT32 OTP_RN_OTP_INIT_DATA_6;
	UINT32 OTP_RN_OTP_INIT_DATA_7;


    // Group 125 : CARD_CTL1
    UINT32  G125_CARD_CTL1[32]                    ;

    // Group 126 : CARD_CTL1
    UINT32  G126_CARD_CTL1[32]                    ;

    // Group 127 : CARD_CTL1
    UINT32  G127_CARD_CTL1[32]                    ;

    // Group 128 : CARD_CTL1
    UINT32  G128_CARD_CTL1[32]                    ;

    // Group 129 : CARD_CTL1
    UINT32  G129_CARD_CTL1[32]                    ;

    // Group 130 : CARD_CTL2
    UINT32  G130_CARD_CTL2[32]                    ;

    // Group 131 : CARD_CTL2
    UINT32  G131_CARD_CTL2[32]                    ;

    // Group 132 : CARD_CTL2
    UINT32  G132_CARD_CTL2[32]                    ;

    // Group 133 : CARD_CTL2
    UINT32  G133_CARD_CTL2[32]                    ;

    // Group 134 : CARD_CTL2
    UINT32  G134_CARD_CTL2[32]                    ;

    // Group 135 : Reserved
    UINT32  G135_RESERVED[32]                     ;

    // Group 136 : Reserved
    UINT32  G136_RESERVED[32]                     ;

    // Group 137 : IMG_DEC_SND/HUF
    UINT32  jpeg_2_huff_mode                      ; //
    UINT32  jpeg_2_huff_ctrl                      ; //
    UINT32  jpeg_2_huff_stats                     ; //
    UINT32  jpeg_2_huff_scan_ctrl                 ; //
    UINT32  jpeg_2_huff_table                     ; //
    UINT32  jpeg_2_huff_mcuno                     ; //
    UINT32  jpeg_2_huff_jpeghsize                 ; //
    UINT32  jpeg_2_huff_jpegvsize                 ; //
    UINT32  jpeg_2_huff_bitstream                 ; //
    UINT32  jpeg_2_huff_bits_dma_offset           ; //
    UINT32  jpeg_2_huff_wr_huff_info              ; //
    UINT32  jpeg_2_huff_bits_info                 ; //
    UINT32  jpeg_2_huff_rd_huff_info              ; //
    UINT32  jpeg_2_huff_dma_offset_0              ; //
    UINT32  jpeg_2_huff_dma_offset_1              ; //
    UINT32  jpeg_2_huff_acval_offset_0            ; //
    UINT32  jpeg_2_huff_acval_offset_1            ; //
    UINT32  jpeg_2_huff_acval_offset_2            ; //
    UINT32  jpeg_2_huff_acval_offset_3            ; //
    UINT32  jpeg_2_huff_wr_dc_01                  ; //
    UINT32  jpeg_2_huff_wr_dc_23                  ; //
    UINT32  jpeg_2_huff_wr_acval_0                ; //
    UINT32  jpeg_2_huff_wr_acval_1                ; //
    UINT32  jpeg_2_huff_wr_acval_2                ; //
    UINT32  jpeg_2_huff_wr_acval_3                ; //
    UINT32  jpeg_2_huff_rd_addr                   ; //
    UINT32  jpeg_2_huff_rd_val                    ; //
    UINT32  jpeg_2_huff_probe                     ; //
    UINT32  jr_2_control                          ; //
    UINT32  jr_2_status                           ; //
    UINT32  jr_2_reg_num                          ; //
    UINT32  jr_2_reg_data                         ; //

    // Group 138 : IMG_DEC_SND/JDM
    UINT32  jdm_2_mode;     
    UINT32  jdm_2_status;   
    UINT32  jdm_2_dma1_mode;      
    UINT32  jdm_2_dma1_xaddr;     
    UINT32  jdm_2_dma1_yaddr;     
    UINT32  jdm_2_dma1_done;      
    UINT32  jdm_2_dma1_start_addr;
    UINT32  jdm_2_dma1_block_num; 
    UINT32  g138_reserved_08;  
    UINT32  g138_reserved_09;  
    UINT32  g138_reserved_10;  
    UINT32  g138_reserved_11;  
    UINT32  g138_reserved_12;  
    UINT32  g138_reserved_13;  
    UINT32  g138_reserved_14;  
    UINT32  g138_reserved_15;  
    UINT32  g138_reserved_16;  
    UINT32  g138_reserved_17;  
    UINT32  g138_reserved_18;  
    UINT32  g138_reserved_19;  
    UINT32  g138_reserved_20;  
    UINT32  g138_reserved_21;  
    UINT32  jdm_2_dc_luma_base_lsb;  
    UINT32  jdm_2_dc_luma_base_msb;  
    UINT32  jdm_2_dc_chroma_base_lsb;  
    UINT32  jdm_2_dc_chroma_base_msb;  
    UINT32  jdm_2_dc_width;  
    UINT32  g138_reserved_27;  
    UINT32  g138_reserved_28;  
    UINT32  jdm_2_jpeg_offset;    
    UINT32  g138_reserved_30;  
    UINT32  g138_reserved_31;  

    // Group 139 : IMG_DEC_SND/INVQ
    UINT32  jpeg_2_invq_qmx_par                   ; // 
    UINT32  jpeg_2_invq_mode                      ; // 
    UINT32  jpeg_2_invq_chksum                    ; // 
    UINT32  g139_reserved[29]                     ; // 

    // Group 140 : NAND_CTL
    UINT32  G140_NAND_CTL[32]                     ;

    // Group 141 : Reserved
    UINT32  G141_RESERVED[32]                     ;

    // Group 142 : EHCI_USB0
    UINT32  G142_EHCI_USB0[32]                    ;

    // Group 143 : EHCI_USB0
    UINT32  G143_EHCI_USB0[32]                    ;

    // Group 144 : EHCI_USB1
    UINT32  G144_EHCI_USB1[32]                    ;

    // Group 145 : EHCI_USB1
    UINT32  G145_EHCI_USB1[32]                    ;

    // Group 146 : USBH
    UINT32  G146_EHCI_USB2[32]                    ;

    // Group 147 : USBH
    UINT32  G147_EHCI_USB2[32]                    ;

    // Group 148 : USBH
    UINT32  G148_USBH[32]                         ;

    // Group 149 : UPHY0
    UINT32  usb_phy0_config0      ;
    UINT32  usb_phy0_config1      ;
    UINT32  usb_phy0_config2      ;
    UINT32  usb_phy0_config3      ;
    UINT32  usb_phy0_config4      ;
    UINT32  usb_phy0_config5      ;
    UINT32  usb_phy0_config6      ;
    UINT32  usb_phy0_config7      ;
    UINT32  usb_phy0_bist_cmd     ;
    UINT32  usb_phy0_bist_done    ;
    UINT32  usb_phy0_bist_status  ;
    UINT32  g149_reserved1[13]    ;
    UINT32  g149_reserved2[8]     ;

    // Group 150 : UPHY1
    UINT32  usb_phy1_config0      ;
    UINT32  usb_phy1_config1      ;
    UINT32  usb_phy1_config2      ;
    UINT32  usb_phy1_config3      ;
    UINT32  usb_phy1_config4      ;
    UINT32  usb_phy1_config5      ;
    UINT32  usb_phy1_config6      ;
    UINT32  usb_phy1_config7      ;
    UINT32  usb_phy1_bist_cmd     ;
    UINT32  usb_phy1_bist_done    ;
    UINT32  usb_phy1_bist_status  ;
    UINT32  g150_reserved1[13]    ;
    UINT32  g150_reserved2[8]     ;

    // Group 151 : UPHY2
    UINT32  usb_phy2_config0      ;
    UINT32  usb_phy2_config1      ;
    UINT32  usb_phy2_config2      ;
    UINT32  usb_phy2_config3      ;
    UINT32  usb_phy2_config4      ;
    UINT32  usb_phy2_config5      ;
    UINT32  usb_phy2_config6      ;
    UINT32  usb_phy2_config7      ;
    UINT32  usb_phy2_bist_cmd     ;
    UINT32  usb_phy2_bist_done    ;
    UINT32  usb_phy2_bist_status  ;
    UINT32  g151_reserved1[13]    ;
    UINT32  g151_reserved2[8]     ;

   // Group 152 : Reserved
    UINT32  G152_RESERVED[32]                     ;

    // Group 153 : Reserved
    UINT32  G153_RESERVED[32]                     ;

    // Group 154 : GMAC
    UINT32  mac_glb_int_status                    ; // 00
    UINT32  mac_glb_int_mask                      ; // 01
    UINT32  mac_glb_sys_cfgcmd                    ; // 02
    UINT32  mac_glb_dma_cfg                       ; // 03
    UINT32  mac_glb_port_cfg                      ; // 04
    UINT32  mac_glb_port_power                    ; // 05
    UINT32  mac_glb_port_sta                      ; // 06
    UINT32  mac_glb_pause_cfg                     ; // 07
    UINT32  mac_glb_pause_sta                     ; // 08
    UINT32  mac_glb_reserved1[3]                  ; // 09~11
    UINT32  mac_glb_sip_hw                        ; // 12
    UINT32  mac_glb_dip_hw                        ; // 13
    UINT32  mac_glb_phy_cmd                       ; // 14
    UINT32  mac_glb_phy_sta                       ; // 15
    UINT32  mac_glb_reserved2[8]                  ; // 16~23
    UINT32  mac_eee_on_timer                      ; // 24
    UINT32  mac_eee_wake_timer                    ; // 25
    UINT32  mac_gclk_dis                          ; // 26
    UINT32  mac_glb_reserved3[5]                  ; // 27~31

    // Group 155 : GMAC
    UINT32  mac_tx_cfg                            ; // 00
    UINT32  mac_tx_reserved1[2]                   ; // 01~02
    UINT32  mac_tx_desc_base                      ; // 03
    UINT32  mac_tx_cdatabuffbaseaddr              ; // 04
    UINT32  mac_tx_cdatabuffaddr                  ; // 05
    UINT32  mac_tx_fifo_ptr                       ; // 06
    UINT32  mac_tx_desc_addr                      ; // 07
    UINT32  mac_tx_reserved2                      ; // 08
    UINT32  mac_tx_watchdogtimer                  ; // 09
    UINT32  mac_tx_desc_data_lo                   ; // 10 
    UINT32  mac_tx_desc_data_hi                   ; // 11
    UINT32  mac_tx_desc_csr                       ; // 12
    UINT32  mac_tx_debugcfg                       ; // 13
    UINT32  mac_tx_epg_burst                      ; // 14
    UINT32  mac_tx_epg_pkt                        ; // 15
    UINT32  mac_tx_pre_buf_ptr                    ; // 16
    UINT32  mac_tx_reserved3[9]                   ; // 17~25
    UINT32  mac_tx_desc_info                      ; // 26
    UINT32  mac_tx_dbg_ctrl                       ; // 27
    UINT32  mac_tx_epg_pkt_cnt                    ; // 28
    UINT32  mac_tx_reserved4[3]                   ; // 29~31

    // Group 156 : GMAC
    UINT32  mac_rx_cfg                            ; // 00
    UINT32  mac_rx_rcv_rule_l2                    ; // 01
    UINT32  mac_rx_rcv_rule_l3                    ; // 02
    UINT32  mac_rx_reserved1                      ; // 03
    UINT32  mac_rx_desc_base_q0                   ; // 04
    UINT32  mac_rx_desc_base_q1                   ; // 05
    UINT32  mac_rx_mchash0                        ; // 06
    UINT32  mac_rx_mchash1                        ; // 07
    UINT32  mac_rx_uchash0                        ; // 08
    UINT32  mac_rx_uchash1                        ; // 09
    UINT32  mac_rx_vlan0                          ; // 10
    UINT32  mac_rx_vlan1                          ; // 11
    UINT32  mac_rx_vlan2                          ; // 12
    UINT32  mac_rx_vlan3                          ; // 13
    UINT32  mac_rx_pri                            ; // 14
    UINT32  mac_rx_desc0_addr                     ; // 15
    UINT32  mac_rx_desc1_addr                     ; // 16
    UINT32  mac_rx_reserved2[3]                   ; // 17~19
    UINT32  mac_rx_desc_data_ptr                  ; // 20
    UINT32  mac_rx_sram_data_lo                   ; // 21
    UINT32  mac_rx_sram_data_hi                   ; // 22
    UINT32  mac_rx_sram_csr                       ; // 23
    UINT32  mac_rx_pre_buf_ptr                    ; // 24
    UINT32  mac_rx_fifo_cur_ptr                   ; // 25
    UINT32  mac_rx_fifo_pre_ptr                   ; // 26
    UINT32  mac_rx_desc_info                      ; // 27
    UINT32  mac_rx_sts_desc_ptr_q0                ; // 28
    UINT32  mac_rx_sts_desc_ptr_q1                ; // 29
    UINT32  mac_rx_datbuf_maxentry                ; // 30
    UINT32  mac_rx_watchdogtimer                  ; // 31

    // Group 157 : GMAC
    UINT32  mac_glb_macaddr0                      ; // 00
    UINT32  mac_glb_macaddr1                      ; // 01
    UINT32  mac_glb_phy_addr                      ; // 02
    UINT32  mac_glb_sip_sw                        ; // 03
    UINT32  mac_adr_reserved1[28]                 ; // 04~31

    // Group 158 : GMAC
    UINT32  mac_mib_tx_pause                      ; // 00
    UINT32  mac_mib_tx_fifo_udr                   ; // 01
    UINT32  mac_mib_tx_reserved0[1]               ; // 02 
    UINT32  mac_mib_tx_col                        ; // 03
    UINT32  mac_mib_tx_col_abort                  ; // 04
    UINT32  mac_mib_tx_late_col                   ; // 05
    UINT32  mac_mib_tx_abt_watchdog               ; // 06
    UINT32  mac_mib_tx_totalpkt                   ; // 07
    UINT32  mac_mib_tx_totaldes_cnt               ; // 08
    UINT32  mac_mib_tx_reserved[7]                ; // 09~15
    UINT32  mac_mib_rx_pause                      ; // 16
    UINT32  mac_mib_rx_fcserr                     ; // 17
    UINT32  mac_mib_rx_alignerr                   ; // 18
    UINT32  mac_mib_rx_frag                       ; // 19
    UINT32  mac_mib_rx_runt                       ; // 20
    UINT32  mac_mib_rx_long                       ; // 21
    UINT32  mac_mib_rx_reserved0[1]               ; // 22
    UINT32  mac_mib_rx_abort                      ; // 23
    UINT32  mac_mib_rx_totalpkt                   ; // 24
    UINT32  mac_mib_rx_jambo                      ; // 25
    UINT32  mac_mib_rx_burst_too_long             ; // 26
    UINT32  mac_mib_rx_totaldes_cnt               ; // 27
    UINT32  mac_mib_rx_reserved[3]                ; // 28~30
    UINT32  mac_rxnum_after_pause                 ; // 31

    // Group 159 : EPHY
    UINT32  G159_EPHY[32]                         ;

    // Group 160 : 
    UINT32  SAC1_SRST                             ; // 00
    UINT32  SAC1_DMA_WA_OFFSET                    ; // 01
    UINT32  SAC1_DMA_W_BUFSIZE                    ; // 02
    UINT32  SAC1_DMA_WA_POINTER                   ; // 03
    UINT32  SAC1_DMA_WA_BARRIER                   ; // 04
    UINT32  SAC1_DMA_RA_OFFSET                    ; // 05
    UINT32  SAC1_DMA_R_BUFSIZE                    ; // 06
    UINT32  SAC1_DMA_RA_POINTER                   ; // 07
    UINT32  SAC1_DMA_CTRL                         ; // 08
    UINT32  SAC1_DMA_EN                           ; // 09
    UINT32  SAC1_SECTOR_LENGTH                    ; // 10
    UINT32  SAC1_SECTOR_NUM                       ; // 11
    UINT32  SAC1_XCBC_HEADER_LENGTH               ; // 12
    UINT32  SAC1_XCBC_MAC                         ; // 13
    UINT32  G160_reserved1                        ; // 14
    UINT32  SAC1_FILL_ADDR                        ; // 15
    UINT32  SAC1_CTRL                             ; // 16
    UINT32  SAC1_IN                               ; // 17
    UINT32  SAC1_IV                               ; // 18
    UINT32  SAC1_CLEAR_KEY                        ; // 19
    UINT32  SAC1_SECU_INFO_VBIT                   ; // 20
    UINT32  SAC1_SECU_INFO_RK_STU                 ; // 21
    UINT32  G160_reserved2[10]                    ; // 22~31

    // Group 161 : SAC
    UINT32  SAC0_SRST                             ; // 00
    UINT32  SAC0_DMA_WA_OFFSET                    ; // 01
    UINT32  SAC0_DMA_W_BUFSIZE                    ; // 02
    UINT32  SAC0_DMA_WA_POINTER                   ; // 03
    UINT32  SAC0_DMA_WA_BARRIER                   ; // 04
    UINT32  SAC0_DMA_RA_OFFSET                    ; // 05
    UINT32  SAC0_DMA_R_BUFSIZE                    ; // 06
    UINT32  SAC0_DMA_RA_POINTER                   ; // 07
    UINT32  SAC0_DMA_CTRL                         ; // 08
    UINT32  SAC0_DMA_EN                           ; // 09
    UINT32  SAC0_SECTOR_LENGTH                    ; // 10
    UINT32  SAC0_SECTOR_NUM                       ; // 11
    UINT32  SAC0_XCBC_HEADER_LENGTH               ; // 12
    UINT32  SAC0_XCBC_MAC                         ; // 13
    UINT32  G161_reserved1                        ; // 14
    UINT32  SAC0_FILL_ADDR                        ; // 15
    UINT32  SAC0_CTRL                             ; // 16
    UINT32  SAC0_IN                               ; // 17
    UINT32  SAC0_IV                               ; // 18
    UINT32  SAC0_CLEAR_KEY                        ; // 19
    UINT32  SAC0_SECU_INFO_VBIT                   ; // 20
    UINT32  SAC0_SECU_INFO_RK_STU                 ; // 21
    UINT32  G161_reserved2[10]                    ; // 22-31

    // Group 162 : PCMCIA
    UINT32  G162_PCMCIA[32]                       ;

    // Group 163 : DEMUX0
    UINT32  G163_DEMUX0[32]                       ;

    // Group 164 : DEMUX0
    UINT32  G164_DEMUX0[32]                       ;

    // Group 165 : TPI
    UINT32  G165_TPI_G272[32]                     ;

    // Group 166 : TPI
    UINT32  G166_TPI_G273[32]                     ;

    // Group 167 : TPI
    UINT32  G167_TPI_G274[32]                       ;

    // Group 168 : TPI
    UINT32  G168_TPI_G275[32]                       ;

    // Group 169 : TPI
    UINT32  G169_TPI_G276[32]                       ;

    // Group 170 : TPI
    UINT32  G170_TPI_G277[32]                       ;

    // Group 171 : TPI
    UINT32  G171_TPI_G278[32]                       ;

    // Group 172 : TPI
    UINT32  G172_TPI_G279[32]                       ;

    // Group 173 : TPISUB
    UINT32  G173_TPISUB_G260[32]                    ;

    // Group 174 : TPISUB
    UINT32  G174_TPISUB_G261[32]                    ;

    // Group 175 : TPISUB
    UINT32  G175_TPISUB_G262[32]                    ;

    // Group 176 : TPISUB
    UINT32  G176_TPISUB_G263[32]                    ;

    // Group 177 : TPISUB
    UINT32  G177_TPISUB_G264[32]                    ;

    // Group 178 : TPISUB
    UINT32  G178_TPISUB_G265[32]                    ;

    // Group 179 : TPISUB
    UINT32  G179_TPISUB_G266[32]                    ;

    // Group 180 : TPISUB
    UINT32  G180_TPISUB_G267[32]                    ;

    // Group 181 : Reserved
    UINT32  G181_RESERVED[32]                     ;

    // Group 182 : Reserved
    UINT32  G182_RESERVED[32]                     ;

    // Group 183 : Reserved
    UINT32  G183_RESERVED[32]                     ;

    // Group 184 : Reserved
    UINT32  G184_RESERVED[32]                     ;

    // Group 185 : DDFCH0
    UINT32  ddfch0_latch_en                       ; // 00
    UINT32  ddfch0_mode_option                    ; // 01
    UINT32  ddfch0_enable                         ; // 02
    UINT32  ddfch0_urgent_thd                     ; // 03
    UINT32  ddfch0_cmdq_thd                       ; // 04
    UINT32  ddfch0_mr_base_addr                   ; // 05
    UINT32  ddfch0_luma_base_addr_0               ; // 06
    UINT32  ddfch0_luma_base_addr_1               ; // 07
    UINT32  ddfch0_luma_base_addr_2               ; // 08
    UINT32  ddfch0_crma_base_addr_0               ; // 09
    UINT32  ddfch0_crma_base_addr_1               ; // 10
    UINT32  ddfch0_crma_base_addr_2               ; // 11
    UINT32  ddfch0_indx_base_addr_0               ; // 12
    UINT32  ddfch0_indx_base_addr_1               ; // 13
    UINT32  ddfch0_indx_base_addr_2               ; // 14
    UINT32  ddfch0_pip_mask_size                  ; // 15
    UINT32  ddfch0_pip_mask_offset                ; // 16
    UINT32  ddfch0_mr_frame_size                  ; // 17
    UINT32  ddfch0_mr_crop_size                   ; // 18
    UINT32  ddfch0_mr_crop_offset                 ; // 19
    UINT32  ddfch0_vdo_frame_size                 ; // 20
    UINT32  ddfch0_vdo_crop_size                  ; // 21
    UINT32  ddfch0_vdo_crop_offset                ; // 22
    UINT32  ddfch0_config_0                       ; // 23
    UINT32  ddfch0_config_1                       ; // 24
    UINT32  ddfch0_checksum_sel                   ; // 25
    UINT32  ddfch0_chksum_info                    ; // 26
    UINT32  ddfch0_error_flag_info                ; // 27
    UINT32  ddfch0_bist                           ; // 28
    UINT32  g185_reserved0[3]                     ; // 29~31
    
    // Group 186 : DDFCH1
    UINT32  ddfch1_latch_en                       ; // 00
    UINT32  ddfch1_mode_option                    ; // 01
    UINT32  ddfch1_enable                         ; // 02
    UINT32  ddfch1_urgent_thd                     ; // 03
    UINT32  ddfch1_cmdq_thd                       ; // 04
    UINT32  ddfch1_mr_base_addr                   ; // 05
    UINT32  ddfch1_luma_base_addr_0               ; // 06
    UINT32  ddfch1_luma_base_addr_1               ; // 07
    UINT32  ddfch1_luma_base_addr_2               ; // 08
    UINT32  ddfch1_crma_base_addr_0               ; // 09
    UINT32  ddfch1_crma_base_addr_1               ; // 10
    UINT32  ddfch1_crma_base_addr_2               ; // 11
    UINT32  ddfch1_indx_base_addr_0               ; // 12
    UINT32  ddfch1_indx_base_addr_1               ; // 13
    UINT32  ddfch1_indx_base_addr_2               ; // 14
    UINT32  ddfch1_pip_mask_size                  ; // 15
    UINT32  ddfch1_pip_mask_offset                ; // 16
    UINT32  ddfch1_mr_frame_size                  ; // 17
    UINT32  ddfch1_mr_crop_size                   ; // 18
    UINT32  ddfch1_mr_crop_offset                 ; // 19
    UINT32  ddfch1_vdo_frame_size                 ; // 20
    UINT32  ddfch1_vdo_crop_size                  ; // 21
    UINT32  ddfch1_vdo_crop_offset                ; // 22
    UINT32  ddfch1_config_0                       ; // 23
    UINT32  ddfch1_config_1                       ; // 24
    UINT32  ddfch1_checksum_sel                   ; // 25
    UINT32  ddfch1_chksum_info                    ; // 26
    UINT32  ddfch1_error_flag_info                ; // 27
    UINT32  ddfch1_bist                           ; // 28
    UINT32  g186_reserved0[3]                     ; // 29~31    

    // Group 187 : DEINT0
    UINT32  deint0_param_1                        ; // 00
    UINT32  deint0_cnt_y_his_r                    ; // 01
    UINT32  deint0_gclk_param_1                   ; // 02
    UINT32  deint0_gclk_param_2                   ; // 03
    UINT32  deint0_checksum                       ; // 04
    UINT32  deint0_cnt_y_pre                      ; // 05
    UINT32  deint0_cnt_y_cur                      ; // 06
    UINT32  deint0_cnt_y_nxt                      ; // 07
    UINT32  deint0_scene_change_param_1           ; // 08
    UINT32  deint0_scene_change_param_2           ; // 09
    UINT32  deint0_cnt_y_his_w                    ; // 10
    UINT32  deint0_pulldown22_param_1             ; // 11
    UINT32  deint0_pulldown22_param_2             ; // 12
    UINT32  deint0_pulldown22_param_3             ; // 13
    UINT32  deint0_pulldown22_param_4             ; // 14
    UINT32  deint0_pulldown22_param_5             ; // 15
    UINT32  deint0_pulldown22_param_6             ; // 16
    UINT32  deint0_pulldown22_param_7             ; // 17
    UINT32  deint0_pulldown22_param_8             ; // 18
    UINT32  deint0_x_size                         ; // 19
    UINT32  deint0_pulldown32_param_1             ; // 20
    UINT32  deint0_pulldown32_param_2             ; // 21
    UINT32  deint0_pulldown32_param_3             ; // 22
    UINT32  deint0_pulldown32_param_4             ; // 23
    UINT32  deint0_pulldown32_param_5             ; // 24
    UINT32  deint0_pulldown32_param_6             ; // 25
    UINT32  deint0_pulldown32_param_7             ; // 26
    UINT32  deint0_pulldown32_param_8             ; // 27
    UINT32  deint0_y_size                         ; // 28
    UINT32  deint0_bad_edit_param_1               ; // 29
    UINT32  deint0_bad_edit_param_2               ; // 30
    UINT32  deint0_bad_edit_param_3               ; // 31    

    // Group 188 : DEINT0
    UINT32  deint0_decision_param_1               ; // 00
    UINT32  deint0_decision_param_2               ; // 01
    UINT32  deint0_decision_param_3               ; // 02
    UINT32  deint0_decision_param_4               ; // 03
    UINT32  deint0_decision_param_5               ; // 04
    UINT32  deint0_decision_param_6               ; // 05
    UINT32  deint0_decision_param_7               ; // 06
    UINT32  deint0_decision_param_8               ; // 07
    UINT32  deint0_decision_param_9               ; // 08
    UINT32  deint0_decision_param_a               ; // 09
    UINT32  deint0_decision_param_b               ; // 10
    UINT32  deint0_val_field_luma_l               ; // 11
    UINT32  deint0_val_field_luma_h               ; // 12
    UINT32  deint0_intra_param_1                  ; // 13
    UINT32  deint0_intra_param_2                  ; // 14
    UINT32  deint0_intra_param_3                  ; // 15
    UINT32  deint0_intra_param_4                  ; // 16
    UINT32  deint0_intra_param_5                  ; // 17
    UINT32  deint0_intra_param_6                  ; // 18
    UINT32  deint0_intra_param_7                  ; // 19
    UINT32  deint0_intra_param_8                  ; // 20
    UINT32  deint0_read_cnt_y                     ; // 21
    UINT32  deint0_inter_param_1                  ; // 22
    UINT32  deint0_mixing_param_1                 ; // 23
    UINT32  deint0_val_22_sawtooth                ; // 24
    UINT32  deint0_val_32_motion                  ; // 25
    UINT32  deint0_val_be_tmp                     ; // 26
    UINT32  deint0_val_be_spt                     ; // 27
    UINT32  deint0_val_be_mix                     ; // 28
    UINT32  deint0_val_be_info1                   ; // 29
    UINT32  deint0_val_be_info2                   ; // 30
    UINT32  deint0_val_scene_change               ; // 31

    // Group 189 : DEINT1
    UINT32  deint1_param_1                        ; // 00
    UINT32  deint1_cnt_y_his_r                    ; // 01
    UINT32  deint1_gclk_param_1                   ; // 02
    UINT32  deint1_gclk_param_2                   ; // 03
    UINT32  deint1_checksum                       ; // 04
    UINT32  deint1_cnt_y_pre                      ; // 05
    UINT32  deint1_cnt_y_cur                      ; // 06
    UINT32  deint1_cnt_y_nxt                      ; // 07
    UINT32  deint1_scene_change_param_1           ; // 08
    UINT32  deint1_scene_change_param_2           ; // 09
    UINT32  deint1_cnt_y_his_w                    ; // 10
    UINT32  deint1_pulldown22_param_1             ; // 11
    UINT32  deint1_pulldown22_param_2             ; // 12
    UINT32  deint1_pulldown22_param_3             ; // 13
    UINT32  deint1_pulldown22_param_4             ; // 14
    UINT32  deint1_pulldown22_param_5             ; // 15
    UINT32  deint1_pulldown22_param_6             ; // 16
    UINT32  deint1_pulldown22_param_7             ; // 17
    UINT32  deint1_pulldown22_param_8             ; // 18
    UINT32  deint1_x_size                         ; // 19
    UINT32  deint1_pulldown32_param_1             ; // 20
    UINT32  deint1_pulldown32_param_2             ; // 21
    UINT32  deint1_pulldown32_param_3             ; // 22
    UINT32  deint1_pulldown32_param_4             ; // 23
    UINT32  deint1_pulldown32_param_5             ; // 24
    UINT32  deint1_pulldown32_param_6             ; // 25
    UINT32  deint1_pulldown32_param_7             ; // 26
    UINT32  deint1_pulldown32_param_8             ; // 27
    UINT32  deint1_y_size                         ; // 28
    UINT32  deint1_bad_edit_param_1               ; // 29
    UINT32  deint1_bad_edit_param_2               ; // 30
    UINT32  deint1_bad_edit_param_3               ; // 31 

    // Group 190 : DEINT1
    UINT32  deint1_decision_param_1               ; // 00
    UINT32  deint1_decision_param_2               ; // 01
    UINT32  deint1_decision_param_3               ; // 02
    UINT32  deint1_decision_param_4               ; // 03
    UINT32  deint1_decision_param_5               ; // 04
    UINT32  deint1_decision_param_6               ; // 05
    UINT32  deint1_decision_param_7               ; // 06
    UINT32  deint1_decision_param_8               ; // 07
    UINT32  deint1_decision_param_9               ; // 08
    UINT32  deint1_decision_param_a               ; // 09
    UINT32  deint1_decision_param_b               ; // 10
    UINT32  deint1_val_field_luma_l               ; // 11
    UINT32  deint1_val_field_luma_h               ; // 12
    UINT32  deint1_intra_param_1                  ; // 13
    UINT32  deint1_intra_param_2                  ; // 14
    UINT32  deint1_intra_param_3                  ; // 15
    UINT32  deint1_intra_param_4                  ; // 16
    UINT32  deint1_intra_param_5                  ; // 17
    UINT32  deint1_intra_param_6                  ; // 18
    UINT32  deint1_intra_param_7                  ; // 19
    UINT32  deint1_intra_param_8                  ; // 20
    UINT32  deint1_read_cnt_y                     ; // 21
    UINT32  deint1_inter_param_1                  ; // 22
    UINT32  deint1_mixing_param_1                 ; // 23
    UINT32  deint1_val_22_sawtooth                ; // 24
    UINT32  deint1_val_32_motion                  ; // 25
    UINT32  deint1_val_be_tmp                     ; // 26
    UINT32  deint1_val_be_spt                     ; // 27
    UINT32  deint1_val_be_mix                     ; // 28
    UINT32  deint1_val_be_info1                   ; // 29
    UINT32  deint1_val_be_info2                   ; // 30
    UINT32  deint1_val_scene_change               ; // 31    

    // Group 191 : VSCL0
    UINT32  vscl0_config1                         ; // 00
    UINT32  vscl0_config2                         ; // 01
    UINT32  g191_reserved0                        ; // 02
    UINT32  vscl0_actrl_i_xlen                    ; // 03
    UINT32  vscl0_actrl_i_ylen                    ; // 04
    UINT32  vscl0_actrl_s_xstart                  ; // 05
    UINT32  vscl0_actrl_s_ystart                  ; // 06
    UINT32  vscl0_actrl_s_xlen                    ; // 07
    UINT32  vscl0_actrl_s_ylen                    ; // 08
    UINT32  vscl0_dctrl_o_xlen                    ; // 09
    UINT32  vscl0_dctrl_o_ylen                    ; // 10
    UINT32  vscl0_dctrl_d_xstart                  ; // 11
    UINT32  vscl0_dctrl_d_ystart                  ; // 12
    UINT32  vscl0_dctrl_d_xlen                    ; // 13
    UINT32  vscl0_dctrl_d_ylen                    ; // 14
    UINT32  vscl0_dctrl_bgc_c                     ; // 15
    UINT32  vscl0_dctrl_bgc_y                     ; // 16
    UINT32  g191_reserved1                        ; // 17
    UINT32  vscl0_hint_ctrl                       ; // 18
    UINT32  vscl0_hint_hfactor_low                ; // 19
    UINT32  vscl0_hint_hfactor_high               ; // 20
    UINT32  vscl0_hint_y_initf_low                ; // 21
    UINT32  vscl0_hint_y_initf_high               ; // 22
    UINT32  vscl0_hint_c_initf_low                ; // 23
    UINT32  vscl0_hint_c_initf_high               ; // 24
    UINT32  vscl0_hint_overshoot                  ; // 25
    UINT32  g191_reserved2[2]                     ; // 26,27
    UINT32  vscl0_sram_ctrl                       ; // 28
    UINT32  vscl0_sram_addr                       ; // 29
    UINT32  vscl0_sram_write_data                 ; // 30
    UINT32  vscl0_sram_read_data                  ; // 31

    // Group 192 : VSCL0
    UINT32  vscl0_vint_ctrl                       ; // 00
    UINT32  vscl0_vint_vfactor_low                ; // 01
    UINT32  vscl0_vint_vfactor_high               ; // 02
    UINT32  vscl0_vint_initf_low                  ; // 03
    UINT32  vscl0_vint_initf_high                 ; // 04
    UINT32  vscl0_dr_ctrl                         ; // 05
    UINT32  vscl0_dr_dege_detect1                 ; // 06
    UINT32  vscl0_dr_dege_detect2                 ; // 07
    UINT32  vscl0_dr_clamp_detect                 ; // 08
    UINT32  vscl0_vimg_ctrl                       ; // 09
    UINT32  vscl0_vimg_vpeak_lut_1                ; // 10
    UINT32  vscl0_vimg_vpeak_lut_2                ; // 11
    UINT32  vscl0_vimg_vpeak_lut_3                ; // 12
    UINT32  vscl0_vimg_vpeak_lut_4                ; // 13
    UINT32  vscl0_vimg_vpeak_lut_5                ; // 14
    UINT32  vscl0_vimg_vpeak_lut_6                ; // 15
    UINT32  vscl0_vimg_vpeak_config               ; // 16
    UINT32  vscl0_vimg_diag_config_1              ; // 17
    UINT32  vscl0_vimg_diag_config_2              ; // 18
    UINT32  g192_reserved1[2]                     ; // 19,20
    UINT32  vscl0_checksum_select                 ; // 21
    UINT32  vscl0_checksum_result                 ; // 22
    UINT32  g192_reserved2[9]                     ; // 23~31

    // Group 193 : VSCL1
    UINT32  vscl1_config1                         ; // 00
    UINT32  vscl1_config2                         ; // 01
    UINT32  g193_reserved0                        ; // 02
    UINT32  vscl1_actrl_i_xlen                    ; // 03
    UINT32  vscl1_actrl_i_ylen                    ; // 04
    UINT32  vscl1_actrl_s_xstart                  ; // 05
    UINT32  vscl1_actrl_s_ystart                  ; // 06
    UINT32  vscl1_actrl_s_xlen                    ; // 07
    UINT32  vscl1_actrl_s_ylen                    ; // 08
    UINT32  vscl1_dctrl_o_xlen                    ; // 09
    UINT32  vscl1_dctrl_o_ylen                    ; // 10
    UINT32  vscl1_dctrl_d_xstart                  ; // 11
    UINT32  vscl1_dctrl_d_ystart                  ; // 12
    UINT32  vscl1_dctrl_d_xlen                    ; // 13
    UINT32  vscl1_dctrl_d_ylen                    ; // 14
    UINT32  vscl1_dctrl_bgc_c                     ; // 15
    UINT32  vscl1_dctrl_bgc_y                     ; // 16
    UINT32  g193_reserved1                        ; // 17
    UINT32  vscl1_hint_ctrl                       ; // 18
    UINT32  vscl1_hint_hfactor_low                ; // 19
    UINT32  vscl1_hint_hfactor_high               ; // 20
    UINT32  vscl1_hint_y_initf_low                ; // 21
    UINT32  vscl1_hint_y_initf_high               ; // 22
    UINT32  vscl1_hint_c_initf_low                ; // 23
    UINT32  vscl1_hint_c_initf_high               ; // 24
    UINT32  vscl1_hint_overshoot                  ; // 25
    UINT32  g193_reserved2[2]                     ; // 26,27
    UINT32  vscl1_sram_ctrl                       ; // 28
    UINT32  vscl1_sram_addr                       ; // 29
    UINT32  vscl1_sram_write_data                 ; // 30
    UINT32  vscl1_sram_read_data                  ; // 31    

    // Group 194 : VSCL1
    UINT32  vscl1_vint_ctrl                       ; // 00
    UINT32  vscl1_vint_vfactor_low                ; // 01
    UINT32  vscl1_vint_vfactor_high               ; // 02
    UINT32  vscl1_vint_initf_low                  ; // 03
    UINT32  vscl1_vint_initf_high                 ; // 04
    UINT32  vscl1_dr_ctrl                         ; // 05
    UINT32  vscl1_dr_dege_detect1                 ; // 06
    UINT32  vscl1_dr_dege_detect2                 ; // 07
    UINT32  vscl1_dr_clamp_detect                 ; // 08
    UINT32  vscl1_vimg_ctrl                       ; // 09
    UINT32  vscl1_vimg_vpeak_lut_1                ; // 10
    UINT32  vscl1_vimg_vpeak_lut_2                ; // 11
    UINT32  vscl1_vimg_vpeak_lut_3                ; // 12
    UINT32  vscl1_vimg_vpeak_lut_4                ; // 13
    UINT32  vscl1_vimg_vpeak_lut_5                ; // 14
    UINT32  vscl1_vimg_vpeak_lut_6                ; // 15
    UINT32  vscl1_vimg_vpeak_config               ; // 16
    UINT32  vscl1_vimg_diag_config_1              ; // 17
    UINT32  vscl1_vimg_diag_config_2              ; // 18
    UINT32  g194_reserved1[2]                     ; // 19,20
    UINT32  vscl1_checksum_select                 ; // 21
    UINT32  vscl1_checksum_result                 ; // 22
    UINT32  g194_reserved2[9]                     ; // 23~31

    // Group 195 : NR0
    UINT32  nr0_en                                ; // 00
    UINT32  nr0_deovs_win                         ; // 01
    UINT32  nr0_deovs_cor_th                      ; // 02
    UINT32  nr0_deovs_ring_edge_th                ; // 03
    UINT32  nr0_deovs_ring_l01                    ; // 04
    UINT32  nr0_deovs_ring_l23                    ; // 05
    UINT32  nr0_deovs_fn_l0123                    ; // 06
    UINT32  nr0_dr_ctrl                           ; // 07
    UINT32  nr0_dr_edge_det1                      ; // 08
    UINT32  nr0_dr_edge_det2                      ; // 09
    UINT32  nr0_dr_clamp_det                      ; // 10
    UINT32  nr0_dm_edge_det1                      ; // 11
    UINT32  nr0_dm_edge_det2                      ; // 12
    UINT32  nr0_dm_clamp_det1                     ; // 13
    UINT32  nr0_dm_clamp_det2                     ; // 14
    UINT32  nr0_snr_ctrl                          ; // 15
    UINT32  nr0_snr_edge_det1                     ; // 16
    UINT32  nr0_snr_edge_det2                     ; // 17
    UINT32  nr0_snr_edge_det3                     ; // 18
    UINT32  nr0_snr_clamp_value                   ; // 19
    UINT32  nr0_snr_masnr_factor1                 ; // 20
    UINT32  nr0_snr_masnr_factor2                 ; // 21
    UINT32  nr0_pix_no                            ; // 22
    UINT32  nr0_line_no                           ; // 23
    UINT32  nr0_gated_ctrl                        ; // 24
    UINT32  nr0_chksum_en                         ; // 25
    UINT32  nr0_chksum_ans                        ; // 26
    UINT32  g195_reserved0[5]                     ; // 27~31

    // Group 196 : NR1
    UINT32  nr1_en                                ; // 00
    UINT32  nr1_deovs_win                         ; // 01
    UINT32  nr1_deovs_cor_th                      ; // 02
    UINT32  nr1_deovs_ring_edge_th                ; // 03
    UINT32  nr1_deovs_ring_l01                    ; // 04
    UINT32  nr1_deovs_ring_l23                    ; // 05
    UINT32  nr1_deovs_fn_l0123                    ; // 06
    UINT32  nr1_dr_ctrl                           ; // 07
    UINT32  nr1_dr_edge_det1                      ; // 08
    UINT32  nr1_dr_edge_det2                      ; // 09
    UINT32  nr1_dr_clamp_det                      ; // 10
    UINT32  nr1_dm_edge_det1                      ; // 11
    UINT32  nr1_dm_edge_det2                      ; // 12
    UINT32  nr1_dm_clamp_det1                     ; // 13
    UINT32  nr1_dm_clamp_det2                     ; // 14
    UINT32  nr1_snr_ctrl                          ; // 15
    UINT32  nr1_snr_edge_det1                     ; // 16
    UINT32  nr1_snr_edge_det2                     ; // 17
    UINT32  nr1_snr_edge_det3                     ; // 18
    UINT32  nr1_snr_clamp_value                   ; // 19
    UINT32  nr1_snr_masnr_factor1                 ; // 20
    UINT32  nr1_snr_masnr_factor2                 ; // 21
    UINT32  nr1_pix_no                            ; // 22
    UINT32  nr1_line_no                           ; // 23
    UINT32  nr1_gated_ctrl                        ; // 24
    UINT32  nr1_chksum_en                         ; // 25
    UINT32  nr1_chksum_ans                        ; // 26
    UINT32  g196_reserved0[5]                     ; // 27~31

    // Group 197 : IMG0
    UINT32  img0_config                           ; // 00
    UINT32  img0_pkti_ctrl                        ; // 01
    UINT32  img0_pkti_bp1_coef_1                  ; // 02
    UINT32  img0_pkti_bp1_coef_2                  ; // 03
    UINT32  img0_pkti_bp1_coef_3                  ; // 04
    UINT32  img0_pkti_lpk_config                  ; // 05
    UINT32  img0_pkti_lpk_gain                    ; // 06
    UINT32  img0_pkti_lpk_lut_1                   ; // 07
    UINT32  img0_pkti_lpk_lut_2                   ; // 08
    UINT32  img0_pkti_lpk_lut_3                   ; // 09
    UINT32  img0_pkti_lpk_lut_4                   ; // 10
    UINT32  img0_pkti_lpk_lut_5                   ; // 11
    UINT32  img0_pkti_lpk_lut_6                   ; // 12
    UINT32  img0_pkti_lpk_ovsht_1                 ; // 13
    UINT32  img0_pkti_lpk_ovsht_2                 ; // 14
    UINT32  img0_pkti_lti_gain                    ; // 15
    UINT32  img0_pkti_lti_lut_1                   ; // 16
    UINT32  img0_pkti_lti_lut_2                   ; // 17
    UINT32  img0_pkti_lti_lut_3                   ; // 18
    UINT32  img0_pkti_lti_lut_4                   ; // 19
    UINT32  img0_pkti_lti_lut_5                   ; // 20
    UINT32  img0_pkti_lti_lut_6                   ; // 21
    UINT32  img0_pkti_lti_ovsht_1                 ; // 22
    UINT32  img0_pkti_lti_ovsht_2                 ; // 23
    UINT32  img0_sram_ctrl                        ; // 24
    UINT32  img0_sram_addr                        ; // 25
    UINT32  img0_sram_write_data                  ; // 26
    UINT32  img0_sram_read_data                   ; // 27
    UINT32  img0_pix_no                           ; // 28
    UINT32  img0_line_no                          ; // 29
    UINT32  img0_chksum_ans                       ; // 30
    UINT32  g197_reserved0                        ; // 31

    // Group 198 : IMG1
    UINT32  img1_config                           ; // 00
    UINT32  img1_pkti_ctrl                        ; // 01
    UINT32  img1_pkti_bp1_coef_1                  ; // 02
    UINT32  img1_pkti_bp1_coef_2                  ; // 03
    UINT32  img1_pkti_bp1_coef_3                  ; // 04
    UINT32  img1_pkti_lpk_config                  ; // 05
    UINT32  img1_pkti_lpk_gain                    ; // 06
    UINT32  img1_pkti_lpk_lut_1                   ; // 07
    UINT32  img1_pkti_lpk_lut_2                   ; // 08
    UINT32  img1_pkti_lpk_lut_3                   ; // 09
    UINT32  img1_pkti_lpk_lut_4                   ; // 10
    UINT32  img1_pkti_lpk_lut_5                   ; // 11
    UINT32  img1_pkti_lpk_lut_6                   ; // 12
    UINT32  img1_pkti_lpk_ovsht_1                 ; // 13
    UINT32  img1_pkti_lpk_ovsht_2                 ; // 14
    UINT32  img1_pkti_lti_gain                    ; // 15
    UINT32  img1_pkti_lti_lut_1                   ; // 16
    UINT32  img1_pkti_lti_lut_2                   ; // 17
    UINT32  img1_pkti_lti_lut_3                   ; // 18
    UINT32  img1_pkti_lti_lut_4                   ; // 19
    UINT32  img1_pkti_lti_lut_5                   ; // 20
    UINT32  img1_pkti_lti_lut_6                   ; // 21
    UINT32  img1_pkti_lti_ovsht_1                 ; // 22
    UINT32  img1_pkti_lti_ovsht_2                 ; // 23
    UINT32  img1_sram_ctrl                        ; // 24
    UINT32  img1_sram_addr                        ; // 25
    UINT32  img1_sram_write_data                  ; // 26
    UINT32  img1_sram_read_data                   ; // 27
    UINT32  img1_pix_no                           ; // 28
    UINT32  img1_line_no                          ; // 29
    UINT32  img1_chksum_ans                       ; // 30
    UINT32  g198_reserved0                        ; // 31    

    // Group 199 : VPOST0
    UINT32  vpost0_config                         ; // 00
    UINT32  vpost0_adj_config                     ; // 01
    UINT32  vpost0_adj_src                        ; // 02
    UINT32  vpost0_adj_des                        ; // 03
    UINT32  vpost0_adj_slope0                     ; // 04
    UINT32  vpost0_adj_slope1                     ; // 05
    UINT32  vpost0_adj_slope2                     ; // 06
    UINT32  vpost0_adj_bound                      ; // 07
    UINT32  vpost0_cspace_config                  ; // 08
    UINT32  vpost0_opif_config                    ; // 09
    UINT32  vpost0_opif_bgy                       ; // 10
    UINT32  vpost0_opif_bguv                      ; // 11
    UINT32  vpost0_opif_alpha                     ; // 12
    UINT32  vpost0_opif_msktop                    ; // 13
    UINT32  vpost0_opif_mskbot                    ; // 14
    UINT32  vpost0_xlen                           ; // 15
    UINT32  vpost0_ylen                           ; // 16
    UINT32  vpost0_chksum_ans                     ; // 17
    UINT32  g199_reserved0[14]                    ; // 18~31

    // Group 200 : VPOST1
    UINT32  vpost1_config                         ; // 00
    UINT32  vpost1_adj_config                     ; // 01
    UINT32  vpost1_adj_src                        ; // 02
    UINT32  vpost1_adj_des                        ; // 03
    UINT32  vpost1_adj_slope0                     ; // 04
    UINT32  vpost1_adj_slope1                     ; // 05
    UINT32  vpost1_adj_slope2                     ; // 06
    UINT32  vpost1_adj_bound                      ; // 07
    UINT32  vpost1_cspace_config                  ; // 08
    UINT32  vpost1_opif_config                    ; // 09
    UINT32  vpost1_opif_bgy                       ; // 10
    UINT32  vpost1_opif_bguv                      ; // 11
    UINT32  vpost1_opif_alpha                     ; // 12
    UINT32  vpost1_opif_msktop                    ; // 13
    UINT32  vpost1_opif_mskbot                    ; // 14
    UINT32  vpost1_xlen                           ; // 15
    UINT32  vpost1_ylen                           ; // 16
    UINT32  vpost1_chksum_ans                     ; // 17
    UINT32  g200_reserved0[14]                    ; // 18~31

    // Group 201 : HD2SD
    UINT32 hd2sd_config;                      ; 	//0  
    UINT32 hd2sd_user_hexp0;                  ; 	//1 
    UINT32 hd2sd_user_hexp1;                  ; 	//2
    UINT32 hd2sd_user_vexp0;                  ; 	//3
    UINT32 hd2sd_user_vexp1;                  ; 	//4
    UINT32 hd2sd_user_vexp2;                  ; 	//5
    UINT32 hd2sd_user_sd_reset0;              ; 	//6
    UINT32 hd2sd_user_sd_reset1;              ; 	//7 
    UINT32 hd2sd_status;                      ; 	//8 
    UINT32 hd2sd_peaking_config;              ; 	//9 
    UINT32 hd2sd_peaking_lut0;                ; 	//10
    UINT32 hd2sd_peaking_lut1;                ; 	//11
    UINT32 hd2sd_peaking_limit;               ; 	//12
    UINT32 hd2sd_hd_checksum;                 ; 	//13
    UINT32 hd2sd_sd_checksum;                 ; 	//14
    UINT32 hd2sd_user_sdtve_vrst0;            ; 	//15
    UINT32 hd2sd_user_sdtve_vrst1;            ; 	//16
    UINT32 hd2sd_user_sdtve_hrst;             ; 	//17
    UINT32 hd2sd_bgc_y;                       ; 	//18
    UINT32 hd2sd_bgc_c;                       ; 	//19
    UINT32 hd2sd_config2;                     ; 	//20
    UINT32 hd2sd_user_hact;                   ; 	//21
    UINT32 hd2sd_user_vact;                   ; 	//22
    UINT32 hd2sd_tve_user_mode;               ; 	//23
    UINT32 g201_reserved_0[8];

    // Group 202 : AFRC
    UINT32 afrc_mode0        		      ; 	//0 
    UINT32 afrc_fb_ctrl0     		      ; 	//1 
    UINT32 afrc_fb_ctrl1     		      ; 	//2
    UINT32 afrc_bist_mode0   		      ; 	//3
    UINT32 afrc_bist_mode1   		      ; 	//4
    UINT32 afrc_urgent_thd   		      ; 	//5
    UINT32 afrc_iw_req_clkcnt		      ; 	//6
    UINT32 afrc_faddr0_lw    		      ; 	//7 
    UINT32 afrc_faddr0_hw    		      ; 	//8 
    UINT32 afrc_fb_step      		      ; 	//9 
    UINT32 afrc_tgr_hact     		      ; 	//10
    UINT32 afrc_tgr_htot     		      ; 	//11 
    UINT32 afrc_tgr_vact_st_t		      ; 	//12 
    UINT32 afrc_tgr_vact_ed_t		      ; 	//13 
    UINT32 afrc_tgr_vact_st_b		      ; 	//14  
    UINT32 afrc_tgr_vact_ed_b		      ; 	//15 
    UINT32 afrc_tgr_vtot     		      ; 	//16
    UINT32 afrc_sync_vcnt    		      ; 	//17
    UINT32 afrc_sync_hcnt    		      ; 	//18
    UINT32 afrc_out_vact_st_t		      ; 	//19
    UINT32 afrc_out_vact_st_b		      ; 	//20
    UINT32 afrc_irq_line     		      ; 	//21
    UINT32 afrc_debug        		      ; 	//22
    UINT32 afrc_chkout_a     		      ; 	//23
    UINT32 afrc_chkout_b     		      ; 	//24
    UINT32 afrc_reserved_0   		      ; 	//25
    UINT32 afrc_reserved_1   		      ; 	//26
    UINT32 afrc_reserved_2   		      ; 	//27
    UINT32 afrc_rw_sync2   		      ; 	//28
    UINT32 afrc_mode1        		      ; 	//29 
    UINT32 afrc_mode2        		      ; 	//30 
    UINT32 afrc_rw_sync        		      ; 	//31 

    // Group 203 : TGEN
    UINT32  tgen_0_config                     ; // 00
    UINT32  tgen_0_reset                      ; // 01
    UINT32  tgen_0_user_int1_config           ; // 02
    UINT32  g203_reserved_0                   ; // 03
    UINT32  tgen_dtg_0_config                 ; // 04
    UINT32  g203_reserved_1                   ; // 05
    UINT32  tgen_dtg_0_adjust2                ; // 06
    UINT32  g203_reserved_2                   ; // 07
    UINT32  tgen_dtg_0_total_pixel            ; // 08
    UINT32  tgen_dtg_0_ds_line_start_cd_point ; // 09
    UINT32  tgen_dtg_0_total_line             ; // 10
    UINT32  tgen_dtg_0_field_end_line         ; // 11
    UINT32  tgen_dtg_0_tve_line_rst_cnt       ; // 12
    UINT32  tgen_dtg_0_status1                ; // 13
    UINT32  tgen_dtg_0_status2                ; // 14
    UINT32  tgen_dtg_0_start_line             ; // 15
    UINT32  tgen_atg_0_config                 ; // 16
    UINT32  tgen_atg_0_clk_ratio_low          ; // 17
    UINT32  tgen_atg_0_clk_ratio_high         ; // 18
    UINT32  tgen_atg_0_total_pixel            ; // 19
    UINT32  tgen_atg_0_first_line_total_pixel ; // 20
    UINT32  tgen_atg_0_field_end_line         ; // 21
    UINT32  tgen_atg_0_ds_line_start_cd_point ; // 22
    UINT32  tgen_atg_0_adjust1                ; // 23
    UINT32  tgen_atg_0_adjust2                ; // 24
    UINT32  tgen_atg_0_adjust3                ; // 25
    UINT32  tgen_atg_0_adjust4                ; // 26
    UINT32  tgen_atg_0_status1                ; // 27
    UINT32  tgen_atg_0_status2                ; // 28
    UINT32  tgen_atg_0_source_sel             ; // 29
    UINT32  g203_reserved3[2]                 ; // 30~31

    // Group 204 : TGEN
    UINT32  tgen_1_config                     ; // 00
    UINT32  tgen_1_reset                      ; // 01
    UINT32  tgen_1_user_int1_config           ; // 02
    UINT32  g204_reserved_0                   ; // 03
    UINT32  tgen_dtg_1_config                 ; // 04
    UINT32  g204_reserved_1                   ; // 05
    UINT32  tgen_dtg_1_adjust2                ; // 06
    UINT32  g204_reserved_2                   ; // 07
    UINT32  tgen_dtg_1_total_pixel            ; // 08
    UINT32  tgen_dtg_1_ds_line_start_cd_point ; // 09
    UINT32  tgen_dtg_1_total_line             ; // 10
    UINT32  tgen_dtg_1_field_end_line         ; // 11
    UINT32  tgen_dtg_1_tve_line_rst_cnt       ; // 12
    UINT32  tgen_dtg_1_status1                ; // 13
    UINT32  tgen_dtg_1_status2                ; // 14
    UINT32  tgen_dtg_1_start_line             ; // 15
    UINT32  tgen_atg_1_config                 ; // 16
    UINT32  tgen_atg_1_clk_ratio_low          ; // 17
    UINT32  tgen_atg_1_clk_ratio_high         ; // 18
    UINT32  tgen_atg_1_total_pixel            ; // 19
    UINT32  tgen_atg_1_first_line_total_pixel ; // 20
    UINT32  tgen_atg_1_field_end_line         ; // 21
    UINT32  tgen_atg_1_ds_line_start_cd_point ; // 22
    UINT32  tgen_atg_1_adjust1                ; // 23
    UINT32  tgen_atg_1_adjust2                ; // 24
    UINT32  tgen_atg_1_adjust3                ; // 25
    UINT32  tgen_atg_1_adjust4                ; // 26
    UINT32  tgen_atg_1_status1                ; // 27
    UINT32  tgen_atg_1_status2                ; // 28
    UINT32  tgen_atg_1_source_sel             ; // 29
    UINT32  g204_reserved3[2]                 ; // 30~31

    // Group 205 : AMIX
    UINT32  amix_0_config0                    ; // 00
    UINT32  amix_0_config1                    ; // 01
    UINT32  amix_0_config2                    ; // 02
    UINT32  amix_0_plane_alpha                ; // 03
    UINT32  amix_0_plane_alpha2               ; // 04
    UINT32  amix_0_plane_alpha3               ; // 05
    UINT32  g205_reserved0[8]                 ; // 06~13
    UINT32  amix_0_bgc_y                      ; // 14
    UINT32  amix_0_bgc_c                      ; // 15
    UINT32  g205_reserved1                    ; // 16
    UINT32  amix_0_ptg_config                 ; // 17
    UINT32  amix_0_ptg_config_2               ; // 18 
    UINT32  amix_0_ptg_config_3               ; // 19
    UINT32  amix_0_ptg_config_4               ; // 20 
    UINT32  amix_0_ptg_config_5               ; // 21
    UINT32  amix_0_ptg_config_6               ; // 22
    UINT32  g205_reserved2[9]                 ; // 23~31

    // Group 206 : AMIX
    UINT32  amix_1_config0                    ; // 00
    UINT32  amix_1_config1                    ; // 01
    UINT32  amix_1_config2                    ; // 02
    UINT32  amix_1_plane_alpha                ; // 03
    UINT32  amix_1_plane_alpha2               ; // 04
    UINT32  amix_1_plane_alpha3               ; // 05
    UINT32  g206_reserved0[8]                 ; // 06~13
    UINT32  amix_1_bgc_y                      ; // 14
    UINT32  amix_1_bgc_c                      ; // 15
    UINT32  g206_reserved1                    ; // 16
    UINT32  amix_1_ptg_config                 ; // 17
    UINT32  amix_1_ptg_config_2               ; // 18 
    UINT32  amix_1_ptg_config_3               ; // 19
    UINT32  amix_1_ptg_config_4               ; // 20 
    UINT32  amix_1_ptg_config_5               ; // 21
    UINT32  amix_1_ptg_config_6               ; // 22
    UINT32  g206_reserved2[9]                 ; // 23~31

    // Group 207 : DMIX
    UINT32  dmix_0_config                     ; // 00
    UINT32  g207_reserved0[3]                 ; // 01~3
    UINT32  dmix_0_yc_adjust                  ; // 04
    UINT32  dmix_0_luma_cp1                   ; // 05
    UINT32  dmix_0_luma_cp2                   ; // 06
    UINT32  dmix_0_luma_cp3                   ; // 07
    UINT32  dmix_0_luma_slope0                ; // 08
    UINT32  dmix_0_luma_slope1                ; // 09
    UINT32  dmix_0_luma_slope2                ; // 10
    UINT32  dmix_0_luma_slope3                ; // 11
    UINT32  dmix_0_chroma_satcos              ; // 12
    UINT32  dmix_0_chroma_satsin              ; // 13
    UINT32  dmix_0_checksum_setting           ; // 14
    UINT32  dmix_0_chksum_usermode_V          ; // 15
    UINT32  dmix_0_chksum_usermode_H          ; // 16
    UINT32  dmix_0_chksum_usermode_start_line ; // 17
    UINT32  dmix_0_to_venc_chksum             ; // 18
    UINT32  dmix_0_to_hd2sd_chksum            ; // 19
    UINT32  dmix_0_fgc_y_alpha                ; // 20
    UINT32  dmix_0_fgc_c                      ; // 21
    UINT32  dmix_0_pix_en_sel                 ; // 22
    UINT32  dmix_0_snr_set                    ; // 23
    UINT32  dmix_0_snr_start_set              ; // 24
    UINT32  g207_reserved1[7]                 ; // 25~31

    // Group 208 : DMIX
    UINT32  dmix_1_config                     ; // 00
    UINT32  g208_reserved0[3]                 ; // 01~3
    UINT32  dmix_1_yc_adjust                  ; // 04
    UINT32  dmix_1_luma_cp1                   ; // 05
    UINT32  dmix_1_luma_cp2                   ; // 06
    UINT32  dmix_1_luma_cp3                   ; // 07
    UINT32  dmix_1_luma_slope0                ; // 08
    UINT32  dmix_1_luma_slope1                ; // 09
    UINT32  dmix_1_luma_slope2                ; // 10
    UINT32  dmix_1_luma_slope3                ; // 11
    UINT32  dmix_1_chroma_satcos              ; // 12
    UINT32  dmix_1_chroma_satsin              ; // 13
    UINT32  dmix_1_checksum_setting           ; // 14
    UINT32  dmix_1_chksum_usermode_V          ; // 15
    UINT32  dmix_1_chksum_usermode_H          ; // 16
    UINT32  dmix_1_chksum_usermode_start_line ; // 17
    UINT32  dmix_1_to_venc_chksum             ; // 18
    UINT32  dmix_1_to_hd2sd_chksum            ; // 19
    UINT32  dmix_1_fgc_y_alpha                ; // 20
    UINT32  dmix_1_fgc_c                      ; // 21
    UINT32  dmix_1_pix_en_sel                 ; // 22
    UINT32  dmix_1_snr_set                    ; // 23
    UINT32  dmix_1_snr_start_set              ; // 24
    UINT32  g208_reserved1[7]                 ; // 25~31

    // Group 209 : VENC
    UINT32  tv_mode_0                             ; // 00
    UINT32  tv_mode_1                             ; // 01
    UINT32  tv_mode_2                             ; // 02
    UINT32  tv_mode_3                             ; // 03
    UINT32  tv_mode_4                             ; // 04
    UINT32  tv_mode_5                             ; // 05
    UINT32  tv_subc_f_0                           ; // 06
    UINT32  tv_subc_f_1                           ; // 07
    UINT32  tv_subc_p                             ; // 08
    UINT32  tv_line_t_0                           ; // 09
    UINT32  tv_line_t_1                           ; // 10
    UINT32  tv_line_b_0                           ; // 11
    UINT32  tv_line_b_1                           ; // 12
    UINT32  tv_cc_t                               ; // 13
    UINT32  tv_cc_b                               ; // 14
    UINT32  tv_cgms_0                             ; // 15
    UINT32  tv_cgms_1                             ; // 16
    UINT32  tv_id_status                          ; // 17
    UINT32  tv_dac_0                              ; // 18
    UINT32  tv_reserved0_gxx                      ; // 19
    UINT32  g209_reserved0[9]                     ; // 20~28
    UINT32  tv_y_scf                              ; // 29
    UINT32  tv_y_scf_pc                           ; // 30
    UINT32  tv_temp0_g0                           ; // 31

    // Group 210 : VENC
    UINT32  tv_gamma_0                            ; // 00
    UINT32  tv_gamma_1                            ; // 01
    UINT32  tv_gamma_2                            ; // 02
    UINT32  tv_gamma_3                            ; // 03
    UINT32  tv_gamma_4                            ; // 04
    UINT32  tv_pccon_0                            ; // 05
    UINT32  tv_pccon_1                            ; // 06
    UINT32  tv_pccon_2                            ; // 07
    UINT32  tv_pccon_3                            ; // 08
    UINT32  tv_pccon_4                            ; // 09
    UINT32  tv_pccon_5                            ; // 10
    UINT32  tv_pccon_6                            ; // 11
    UINT32  tv_pccon_7                            ; // 12
    UINT32  tv_pccon_8                            ; // 13
    UINT32  tv_pccon_9                            ; // 14
    UINT32  tv_pccon_10                           ; // 15
    UINT32  tv_pccon_11                           ; // 16
    UINT32  tv_pccon_12                           ; // 17
    UINT32  tv_pccon_13                           ; // 18
    UINT32  tv_pccon_14                           ; // 19
    UINT32  tv_pccon_15                           ; // 20
    UINT32  tv_pccon_16                           ; // 21
    UINT32  tv_pccon_17                           ; // 22
    UINT32  tv_pccon_18                           ; // 23
    UINT32  tv_temp0_g1                           ; // 24
    UINT32  tv_temp1_g1                           ; // 25
    UINT32  tv_dac_checksum                       ; // 26
    UINT32  tv_mode5                              ; // 27
    UINT32  tv_mode6                              ; // 28
    UINT32  tv_mode7                              ; // 29
    UINT32  tv_clk_setting                        ; // 30
    UINT32  tv_pccon_19                           ; // 31

    // Group 211 : VENC
    UINT32  tv2_mode0                             ; // 00
    UINT32  rg_scm_adj                            ; // 01
    UINT32  g211_reserved0[2]                     ; // 02~03
    UINT32  tv2_dac_cor0                          ; // 04
    UINT32  tv2_dac_cor1                          ; // 05
    UINT32  tv2_dac_cor2                          ; // 06
    UINT32  tv2_wc_tline                          ; // 07
    UINT32  tv2_wc_bline                          ; // 08
    UINT32  tv2_wc_psline                         ; // 09
    UINT32  tv2_mode1                             ; // 10
    UINT32  tv2_mode2                             ; // 11
    UINT32  tv2_mode3                             ; // 12
    UINT32  tv2_y_range                           ; // 13
    UINT32  tv2_c_range                           ; // 14
    UINT32  tv2_cgmsb_0                           ; // 15
    UINT32  tv2_cgmsb_1                           ; // 16
    UINT32  tv2_cgmsb_2                           ; // 17
    UINT32  tv2_cgmsb_3                           ; // 18
    UINT32  tv2_vpd_mode0                         ; // 19
    UINT32  tv2_vpd_mode1                         ; // 20
    UINT32  tv2_vpd_thd                           ; // 21
    UINT32  tv2_vpd_stline                        ; // 22
    UINT32  tv2_vpd_edline                        ; // 23
    UINT32  tv2_vpd_vldcnt                        ; // 24
    UINT32  tv2_vpd_mode2                         ; // 25
    UINT32  g211_reserved1                        ; // 26
    UINT32  tv_hd2sd_pnt                          ; // 27
    UINT32  tv_pccon_20                           ; // 28
    UINT32  tv_pccon_21                           ; // 29
    UINT32  tv_pccon_22                           ; // 30
    UINT32  tv_pccon_23                           ; // 31

    // Group 212 : VENC
    UINT32  hdtv_mode0                            ; // 00
    UINT32  hdtv_mode1                            ; // 01
    UINT32  hdtv_usr_intl_pix                     ; // 02
    UINT32  hdtv_usr_intl_line                    ; // 03
    UINT32  hdtv_cgms_lword                       ; // 04
    UINT32  hdtv_cgms_hword                       ; // 05
    UINT32  hdtv_cgms_a_ps_line                   ; // 06
    UINT32  hdtv_cgms_a_vt_line                   ; // 07
    UINT32  hdtv_cgms_a_vb_line                   ; // 08
    UINT32  hdtv_y_range                          ; // 09
    UINT32  hdtv_c_range                          ; // 10
    UINT32  hdtv_mode2                            ; // 11
    UINT32  hdtv_cgms_b_ps_line                   ; // 12
    UINT32  g212_reserved0                        ; // 13
    UINT32  use_free_hdgated                      ; // 14
    UINT32  hd_latch_mode                         ; // 15
    UINT32  g212_reserved1[16]                    ; // 16~31

    // Group 213 : G2D
    UINT32  g2d_ctrl                              ; // 00
    UINT32  g2d_en                                ; // 01
    UINT32  g2d_tlink_addr_l                      ; // 02
    UINT32  g2d_tlink_addr_h                      ; // 03
    UINT32  g213_reserved0[4]                     ; // 04~07
    UINT32  g2d_req_ctrl                          ; // 08
    UINT32  g2d_deflicker_ctrl                    ; // 09
    UINT32  g2d_vexp_step                         ; // 10
    UINT32  g2d_hexp_step                         ; // 11
    UINT32  g213_reserved1[2]                     ; // 12~13
    UINT32  g2d_crc_chksum                        ; // 14
    UINT32  g2d_status                            ; // 15
    UINT32  g2d_hvld_offset                       ; // 16
    UINT32  g2d_hvld_width                        ; // 17
    UINT32  g2d_vvld_offset                       ; // 18
    UINT32  g2d_vvld_height                       ; // 19
    UINT32  g2d_data_fetch_ctrl                   ; // 20
    UINT32  g2d_bist_ctrl                         ; // 21
    UINT32  g2d_vexp_init                         ; // 22
    UINT32  g2d_hexp_init                         ; // 23
    UINT32  g2d_vexp_step_ext                     ; // 24
    UINT32  g2d_hexp_step_ext                     ; // 25
    UINT32  g2d_hexp_flt_sel                      ; // 26
    UINT32  g2d_3d_h_offset                       ; // 27
    UINT32  g2d_vexp_flt_sel                      ; // 28
    UINT32  g2d_src_decimation_sel                ; // 29
    UINT32  g2d_lb_info                           ; // 30
    UINT32  g2d_mbus_Info                         ; // 31

    // Group 214 : OSD0
    UINT32  osd0_ctrl                             ; // 00
    UINT32  osd0_en                               ; // 01
    UINT32  osd0_tlink_addr_l                     ; // 02
    UINT32  osd0_tlink_addr_h                     ; // 03
    UINT32  g214_reserved0[4]                     ; // 04~07
    UINT32  osd0_req_ctrl                         ; // 08
    UINT32  osd0_deflicker_ctrl                   ; // 09
    UINT32  osd0_vexp_step                        ; // 10
    UINT32  osd0_hexp_step                        ; // 11
    UINT32  g214_reserved1[2]                     ; // 12~13
    UINT32  osd0_crc_chksum                       ; // 14
    UINT32  osd0_status                           ; // 15
    UINT32  osd0_hvld_offset                      ; // 16
    UINT32  osd0_hvld_width                       ; // 17
    UINT32  osd0_vvld_offset                      ; // 18
    UINT32  osd0_vvld_height                      ; // 19
    UINT32  osd0_data_fetch_ctrl                  ; // 20
    UINT32  osd0_bist_ctrl                        ; // 21
    UINT32  osd0_vexp_init                        ; // 22
    UINT32  osd0_hexp_init                        ; // 23
    UINT32  osd0_vexp_step_ext                    ; // 24
    UINT32  osd0_hexp_step_ext                    ; // 25
    UINT32  osd0_hexp_flt_sel                     ; // 26
    UINT32  osd0_3d_h_offset                      ; // 27
    UINT32  osd0_vexp_flt_sel                     ; // 28
    UINT32  osd0_src_decimation_sel               ; // 29
    UINT32  osd0_lb_info                          ; // 30
    UINT32  osd0_mbus_Info                        ; // 31

    // Group 215 : OSD1
    UINT32  osd1_ctrl                             ; // 00
    UINT32  osd1_en                               ; // 01
    UINT32  osd1_tlink_addr_l                     ; // 02
    UINT32  osd1_tlink_addr_h                     ; // 03
    UINT32  g215_reserved0[4]                     ; // 04~07
    UINT32  osd1_req_ctrl                         ; // 08
    UINT32  osd1_deflicker_ctrl                   ; // 09
    UINT32  osd1_vexp_step                        ; // 10
    UINT32  osd1_hexp_step                        ; // 11
    UINT32  g215_reserved1[2]                     ; // 12~13
    UINT32  osd1_crc_chksum                       ; // 14
    UINT32  osd1_status                           ; // 15
    UINT32  osd1_hvld_offset                      ; // 16
    UINT32  osd1_hvld_width                       ; // 17
    UINT32  osd1_vvld_offset                      ; // 18
    UINT32  osd1_vvld_height                      ; // 19
    UINT32  osd1_data_fetch_ctrl                  ; // 20
    UINT32  osd1_bist_ctrl                        ; // 21
    UINT32  osd1_vexp_init                        ; // 22
    UINT32  osd1_hexp_init                        ; // 23
    UINT32  osd1_vexp_step_ext                    ; // 24
    UINT32  osd1_hexp_step_ext                    ; // 25
    UINT32  osd1_hexp_flt_sel                     ; // 26
    UINT32  osd1_3d_h_offset                      ; // 27
    UINT32  osd1_vexp_flt_sel                     ; // 28
    UINT32  osd1_src_decimation_sel               ; // 29
    UINT32  osd1_lb_info                          ; // 30
    UINT32  osd1_mbus_Info                        ; // 31

    // Group 216 : GSCL0
    UINT32  gscl0_config1                         ; // 00
    UINT32  gscl0_config2                         ; // 01
    UINT32  g216_reserved0[2]                     ; // 02~03
    UINT32  gscl0_actrl_i_xlen                    ; // 04
    UINT32  gscl0_actrl_i_ylen                    ; // 05
    UINT32  gscl0_actrl_s_xstart                  ; // 06
    UINT32  gscl0_actrl_s_ystart                  ; // 07
    UINT32  gscl0_actrl_s_xlen                    ; // 08
    UINT32  gscl0_actrl_s_ylen                    ; // 09
    UINT32  gscl0_dctrl_o_xlen                    ; // 10
    UINT32  gscl0_dctrl_o_ylen                    ; // 11
    UINT32  gscl0_dctrl_d_xstart                  ; // 12
    UINT32  gscl0_dctrl_d_ystart                  ; // 13
    UINT32  gscl0_dctrl_d_xlen                    ; // 14
    UINT32  gscl0_dctrl_d_ylen                    ; // 15
    UINT32  gscl0_dctrl_bgc_c                     ; // 16
    UINT32  gscl0_dctrl_bgc_y                     ; // 17
    UINT32  g216_reserved1                        ; // 18
    UINT32  gscl0_hint_ctrl                       ; // 19
    UINT32  gscl0_hint_hfactor_low                ; // 20
    UINT32  gscl0_hint_hfactor_high               ; // 21
    UINT32  gscl0_hint_initf_low                  ; // 22
    UINT32  gscl0_hint_initf_high                 ; // 23
    UINT32  gscl0_hint_overshoot                  ; // 24
    UINT32  g216_reserved2                        ; // 25
    UINT32  gscl0_vint_ctrl                       ; // 26
    UINT32  gscl0_vint_vfactor_low                ; // 27
    UINT32  gscl0_vint_vfactor_high               ; // 28
    UINT32  gscl0_vint_initf_low                  ; // 29
    UINT32  gscl0_vint_initf_high                 ; // 30
    UINT32  g216_reserved3                        ; // 31
    
    // Group 217 : GSCL0
    UINT32  gscl0_vimg_ctrl                       ; // 00
    UINT32  gscl0_vimg_vpeak_lut_1                ; // 01
    UINT32  gscl0_vimg_vpeak_lut_2                ; // 02
    UINT32  gscl0_vimg_vpeak_lut_3                ; // 03
    UINT32  gscl0_vimg_vpeak_lut_4                ; // 04
    UINT32  gscl0_vimg_vpeak_lut_5                ; // 05
    UINT32  gscl0_vimg_vpeak_lut_6                ; // 06
    UINT32  gscl0_vimg_vpeak_config               ; // 07
    UINT32  gscl0_vimg_diag_config_1              ; // 08
    UINT32  gscl0_vimg_diag_config_2              ; // 09
    UINT32  g217_reserved0                        ; // 10
    UINT32  gscl0_checksum_select                 ; // 11
    UINT32  gscl0_checksum_result                 ; // 12
    UINT32  g217_reserved1[3]                     ; // 13~15
    UINT32  gscl0_dr_ctrl                         ; // 16
    UINT32  gscl0_dr_dege_detect1                 ; // 17
    UINT32  gscl0_dr_dege_detect2                 ; // 18
    UINT32  gscl0_dr_clamp_detect                 ; // 19
    UINT32  g217_reserved2[12]                    ; // 20~31

    // Group 218 : GSCL1
    UINT32  gscl1_config1                         ; // 00
    UINT32  gscl1_config2                         ; // 01
    UINT32  g218_reserved0[2]                     ; // 02~03
    UINT32  gscl1_actrl_i_xlen                    ; // 04
    UINT32  gscl1_actrl_i_ylen                    ; // 05
    UINT32  gscl1_actrl_s_xstart                  ; // 06
    UINT32  gscl1_actrl_s_ystart                  ; // 07
    UINT32  gscl1_actrl_s_xlen                    ; // 08
    UINT32  gscl1_actrl_s_ylen                    ; // 09
    UINT32  gscl1_dctrl_o_xlen                    ; // 10
    UINT32  gscl1_dctrl_o_ylen                    ; // 11
    UINT32  gscl1_dctrl_d_xstart                  ; // 12
    UINT32  gscl1_dctrl_d_ystart                  ; // 13
    UINT32  gscl1_dctrl_d_xlen                    ; // 14
    UINT32  gscl1_dctrl_d_ylen                    ; // 15
    UINT32  gscl1_dctrl_bgc_c                     ; // 16
    UINT32  gscl1_dctrl_bgc_y                     ; // 17
    UINT32  g218_reserved1                        ; // 18
    UINT32  gscl1_hint_ctrl                       ; // 19
    UINT32  gscl1_hint_hfactor_low                ; // 20
    UINT32  gscl1_hint_hfactor_high               ; // 21
    UINT32  gscl1_hint_initf_low                  ; // 22
    UINT32  gscl1_hint_initf_high                 ; // 23
    UINT32  gscl1_hint_overshoot                  ; // 24
    UINT32  g218_reserved2                        ; // 25
    UINT32  gscl1_vint_ctrl                       ; // 26
    UINT32  gscl1_vint_vfactor_low                ; // 27
    UINT32  gscl1_vint_vfactor_high               ; // 28
    UINT32  gscl1_vint_initf_low                  ; // 29
    UINT32  gscl1_vint_initf_high                 ; // 30
    UINT32  g218_reserved3                        ; // 31

    // Group 219 : GSCL1
    UINT32  gscl1_vimg_ctrl                       ; // 00
    UINT32  gscl1_vimg_vpeak_lut_1                ; // 01
    UINT32  gscl1_vimg_vpeak_lut_2                ; // 02
    UINT32  gscl1_vimg_vpeak_lut_3                ; // 03
    UINT32  gscl1_vimg_vpeak_lut_4                ; // 04
    UINT32  gscl1_vimg_vpeak_lut_5                ; // 05
    UINT32  gscl1_vimg_vpeak_lut_6                ; // 06
    UINT32  gscl1_vimg_vpeak_config               ; // 07
    UINT32  gscl1_vimg_diag_config_1              ; // 08
    UINT32  gscl1_vimg_diag_config_2              ; // 09
    UINT32  g219_reserved0                        ; // 10
    UINT32  gscl1_checksum_select                 ; // 11
    UINT32  gscl1_checksum_result                 ; // 12
    UINT32  g219_reserved1[3]                     ; // 13~15
    UINT32  gscl1_dr_ctrl                         ; // 16
    UINT32  gscl1_dr_dege_detect1                 ; // 17
    UINT32  gscl1_dr_dege_detect2                 ; // 18
    UINT32  gscl1_dr_clamp_detect                 ; // 19
    UINT32  g219_reserved2[12]                    ; // 20~31

    // Group 220 : GSCL2
    UINT32  gscl2_config1                         ; // 00
    UINT32  gscl2_config2                         ; // 01
    UINT32  g220_reserved0[2]                     ; // 02~03
    UINT32  gscl2_actrl_i_xlen                    ; // 04
    UINT32  gscl2_actrl_i_ylen                    ; // 05
    UINT32  gscl2_actrl_s_xstart                  ; // 06
    UINT32  gscl2_actrl_s_ystart                  ; // 07
    UINT32  gscl2_actrl_s_xlen                    ; // 08
    UINT32  gscl2_actrl_s_ylen                    ; // 09
    UINT32  gscl2_dctrl_o_xlen                    ; // 10
    UINT32  gscl2_dctrl_o_ylen                    ; // 11
    UINT32  gscl2_dctrl_d_xstart                  ; // 12
    UINT32  gscl2_dctrl_d_ystart                  ; // 13
    UINT32  gscl2_dctrl_d_xlen                    ; // 14
    UINT32  gscl2_dctrl_d_ylen                    ; // 15
    UINT32  gscl2_dctrl_bgc_c                     ; // 16
    UINT32  gscl2_dctrl_bgc_y                     ; // 17
    UINT32  g220_reserved1                        ; // 18
    UINT32  gscl2_hint_ctrl                       ; // 19
    UINT32  gscl2_hint_hfactor_low                ; // 20
    UINT32  gscl2_hint_hfactor_high               ; // 21
    UINT32  gscl2_hint_initf_low                  ; // 22
    UINT32  gscl2_hint_initf_high                 ; // 23
    UINT32  gscl2_hint_overshoot                  ; // 24
    UINT32  g220_reserved2                        ; // 25
    UINT32  gscl2_vint_ctrl                       ; // 26
    UINT32  gscl2_vint_vfactor_low                ; // 27
    UINT32  gscl2_vint_vfactor_high               ; // 28
    UINT32  gscl2_vint_initf_low                  ; // 29
    UINT32  gscl2_vint_initf_high                 ; // 30
    UINT32  g220_reserved3                        ; // 31

    // Group 221 : GSCL2
    UINT32  gscl2_vimg_ctrl                       ; // 00
    UINT32  gscl2_vimg_vpeak_lut_1                ; // 01
    UINT32  gscl2_vimg_vpeak_lut_2                ; // 02
    UINT32  gscl2_vimg_vpeak_lut_3                ; // 03
    UINT32  gscl2_vimg_vpeak_lut_4                ; // 04
    UINT32  gscl2_vimg_vpeak_lut_5                ; // 05
    UINT32  gscl2_vimg_vpeak_lut_6                ; // 06
    UINT32  gscl2_vimg_vpeak_config               ; // 07
    UINT32  gscl2_vimg_diag_config_1              ; // 08
    UINT32  gscl2_vimg_diag_config_2              ; // 09
    UINT32  g221_reserved0                        ; // 10
    UINT32  gscl2_checksum_select                 ; // 11
    UINT32  gscl2_checksum_result                 ; // 12
    UINT32  g221_reserved1[3]                     ; // 13~15
    UINT32  gscl2_dr_ctrl                         ; // 16
    UINT32  gscl2_dr_dege_detect1                 ; // 17
    UINT32  gscl2_dr_dege_detect2                 ; // 18
    UINT32  gscl2_dr_clamp_detect                 ; // 19
    UINT32  g221_reserved2[12]                    ; // 20~31

    // Group 222 : HTDS0
    UINT32  htds0_latch_mode                      ; // 00
    UINT32  htds0_config                          ; // 01
    UINT32  htds0_line_width                      ; // 02
    UINT32  htds0_pix_st_r0                       ; // 03
    UINT32  htds0_pix_ed_r0                       ; // 04
    UINT32  htds0_shift_r0                        ; // 05
    UINT32  htds0_pix_st_r1                       ; // 06
    UINT32  htds0_pix_ed_r1                       ; // 07
    UINT32  htds0_shift_r1                        ; // 08
    UINT32  htds0_pix_st_r2                       ; // 09
    UINT32  htds0_pix_ed_r2                       ; // 10
    UINT32  htds0_shift_r2                        ; // 11
    UINT32  htds0_pix_st_r3                       ; // 12
    UINT32  htds0_pix_ed_r3                       ; // 13
    UINT32  htds0_shift_r3                        ; // 14
    UINT32  htds0_checksum                        ; // 15
    UINT32  g222_reserved[16]                     ; // 16~31

    // Group 223 : HTDS1
    UINT32  htds1_latch_mode                      ; //0
    UINT32  htds1_config                          ; //1
    UINT32  htds1_line_width                      ; //2
    UINT32  htds1_pix_st_r0                       ; //3
    UINT32  htds1_pix_ed_r0                       ; //4
    UINT32  htds1_shift_r0                        ; //5
    UINT32  htds1_pix_st_r1                       ; //6
    UINT32  htds1_pix_ed_r1                       ; //7
    UINT32  htds1_shift_r1                        ; //8
    UINT32  htds1_pix_st_r2                       ; //9
    UINT32  htds1_pix_ed_r2                       ; //10
    UINT32  htds1_shift_r2                        ; //11
    UINT32  htds1_pix_st_r3                       ; //12
    UINT32  htds1_pix_ed_r3                       ; //13
    UINT32  htds1_shift_r3                        ; //14
    UINT32  htds1_checksum                        ; //15
    UINT32  g223_reserved[16]                     ; //16~31

    // Group 224 : HTDS2
    UINT32  htds2_latch_mode                      ; // 00
    UINT32  htds2_config                          ; // 01
    UINT32  htds2_line_width                      ; // 02
    UINT32  htds2_pix_st_r0                       ; // 03
    UINT32  htds2_pix_ed_r0                       ; // 04
    UINT32  htds2_shift_r0                        ; // 05
    UINT32  htds2_pix_st_r1                       ; // 06
    UINT32  htds2_pix_ed_r1                       ; // 07
    UINT32  htds2_shift_r1                        ; // 08
    UINT32  htds2_pix_st_r2                       ; // 09
    UINT32  htds2_pix_ed_r2                       ; // 10
    UINT32  htds2_shift_r2                        ; // 11
    UINT32  htds2_pix_st_r3                       ; // 12
    UINT32  htds2_pix_ed_r3                       ; // 13
    UINT32  htds2_shift_r3                        ; // 14
    UINT32  htds2_checksum                        ; // 15
    UINT32  g224_reserved[16]                     ; // 16~31

    // Group 225 : DVE
    UINT32  dve_vsync_start_top                   ; // 00
    UINT32  dve_vsync_start_bot                   ; // 01
    UINT32  dve_vsync_h_point                     ; // 02
    UINT32  dve_vsync_pd_cnt                      ; // 03
    UINT32  dve_hsync_start                       ; // 04
    UINT32  dve_hsync_pd_cnt                      ; // 05
    UINT32  dve_vhsync_polar                      ; // 06
    UINT32  dve_v_vld_top_start                   ; // 07
    UINT32  dve_v_vld_top_end                     ; // 08
    UINT32  dve_v_vld_bot_start                   ; // 09
    UINT32  dve_v_vld_bot_end                     ; // 10
    UINT32  dve_de_h_start                        ; // 11
    UINT32  dve_de_h_end                          ; // 12
    UINT32  dve_mp_tg_line_0_length               ; // 13
    UINT32  dve_mp_tg_frame_0_line                ; // 14
    UINT32  dve_mp_tg_act_0_pix                   ; // 15
    UINT32  dve_hdmi_mode_0                       ; // 16
    UINT32  dve_act_0_pix_656                     ; // 17
    UINT32  dve_line_0_length_656                 ; // 18
    UINT32  dve_frame_0_line_656                  ; // 19
    UINT32  dve_noact_end_tl_656                  ; // 20
    UINT32  dve_act_end_tl_656                    ; // 21
    UINT32  dve_noact_end_bl_656                  ; // 22
    UINT32  dve_act_end_bl_656                    ; // 23
    UINT32  dve_ccir656_ctrl_0                    ; // 24
    UINT32  dve_d656_y_range                      ; // 25
    UINT32  dve_d656_c_range                      ; // 26
    UINT32  dve_hdmi_y_range                      ; // 27
    UINT32  dve_hdmi_c_range                      ; // 28
    UINT32  dve_hdmi_sharp                        ; // 29
    UINT32  dve_config1                           ; // 30
    UINT32  dve_config0                           ; // 31
   
    // Group 226 : TTX_P2S
    UINT32  g226_reserved_0[23]                   ; //
    UINT32  ttx_mode                              ; //
    UINT32  ttx_base_addr                         ; //
    UINT32  ttx_top_addr                          ; //
    UINT32  ttx_bot_addr                          ; //
    UINT32  ttx_line                              ; //
    UINT32  ttx_ab_base_add_h                     ; //
    UINT32  ttx_states                            ; //
    UINT32  g226_reserved_1[2]                    ; //

    // Group 227 : 
    UINT32  g227_reserved[32]                     ; //
    
    // Group 228 : 
    UINT32 rte_mode0        			; 	//0 
    UINT32 rte_fb_ctrl0     			; 	//1 
    UINT32 rte_fb_ctrl1     			; 	//2
    UINT32 rte_bist_mode0   			; 	//3
    UINT32 rte_bist_mode1   			; 	//4
    UINT32 rte_urgent_thd   			; 	//5
    UINT32 rte_iw_req_clkcnt			; 	//6
    UINT32 rte_faddr0_lw    			; 	//7 
    UINT32 rte_faddr0_hw    			; 	//8 
    UINT32 rte_fb_step      			; 	//9 
    UINT32 rte_tgr_hact     			; 	//10
    UINT32 rte_tgr_htot     			; 	//11 
    UINT32 rte_tgr_vact_st_t			; 	//12 
    UINT32 rte_tgr_vact_ed_t			; 	//13 
    UINT32 rte_tgr_vact_st_b			; 	//14  
    UINT32 rte_tgr_vact_ed_b			; 	//15 
    UINT32 rte_tgr_vtot     			; 	//16
    UINT32 rte_sync_vcnt    			; 	//17
    UINT32 rte_sync_hcnt    			; 	//18
    UINT32 rte_out_vact_st_t			; 	//19
    UINT32 rte_out_vact_st_b			; 	//20
    UINT32 rte_irq_line     			; 	//21
    UINT32 rte_debug        			; 	//22
    UINT32 rte_chkout_a     			; 	//23
    UINT32 rte_chkout_b     			; 	//24
    UINT32 rte_iw_req2gnt   			; 	//25
    UINT32 rte_iw_gnt2req   			; 	//26
    UINT32 rte_ir_req2gnt   			; 	//27
    UINT32 rte_ir_gnt2req   			; 	//28
    UINT32 rte_mode1        			; 	//29 
    UINT32 g228_reserved0[2]			;                  //30~31
    
    // Group 229 : TCIW
    UINT32  tciw_latch_en                         ; // 00
    UINT32  tciw_enable_config                    ; // 01
    UINT32  tciw_mode_config                      ; // 02
    UINT32  tciw_luma_base_lsb                    ; // 03
    UINT32  tciw_luma_base_msb                    ; // 04
    UINT32  tciw_crma_base_lsb                    ; // 05
    UINT32  tciw_crma_base_msb                    ; // 06
    UINT32  tciw_mbus_config_0                    ; // 07
    UINT32  tciw_mbus_config_1                    ; // 08
    UINT32  tciw_frame_size                       ; // 09
    UINT32  tciw_region_x_size                    ; // 10
    UINT32  tciw_region_x_start                   ; // 11
    UINT32  tciw_region_y_start                   ; // 12
    UINT32  tciw_v_flip                           ; // 13
    UINT32  tciw_alpha_element                    ; // 14
    UINT32  tciw_yuv_config                       ; // 15
    UINT32  tciw_dither_config                    ; // 16
    UINT32  tciw_sideband_config                  ; // 17
    UINT32  tciw_iw_error_flag                    ; // 18
    UINT32  tciw_ift_error_flag                   ; // 19
    UINT32  tciw_luma_checksum                    ; // 20
    UINT32  tciw_chroma_checksum                  ; // 21
    UINT32  g229_reserved[10]                     ; // 22~31

    // Group 230 : TCON
    UINT32  G230_TCON[32]                         ;

    // Group 231 : TCON
    UINT32  G231_TCON[32]                         ;

    // Group 232 : TCON
    UINT32  G232_TCON[32]                         ;

    // Group 233 : TCON
    UINT32  G233_TCON[32]                         ;

    // Group 234 : LVDSIF
    UINT32  G234_LVDSIF[32]                       ;

    // Group 235 : V656IN
    UINT32  v656in_0_ctrl_1                                         ;
    UINT32  v656in_0_cntl_2                                         ;
    UINT32  v656in_0_int                                            ;
    UINT32  v656in_0_int_mask                                       ;
    UINT32  v656in_0_masked_int                                     ;
    UINT32  v656in_0_timer_out_thr_l                                ;
    UINT32  v656in_0_timer_out_thr_h                                ;
    UINT32  G235_RESERVER_0                                         ;
    UINT32  G235_RESERVER_1                                         ;
    UINT32  G235_RESERVER_2                                         ;
    UINT32  G235_RESERVER_3                                         ;
    UINT32  v656in_0_err_cntl                                       ;
    UINT32  v656in_0_pixel_start                                    ;
    UINT32  v656in_0_pixel_end                                      ;
    UINT32  v656in_0_line_start                                     ;
    UINT32  v656in_0_line_end                                       ;
    UINT32  v656in_0_pix_cnt                                        ;
    UINT32  v656in_0_line_cnt                                       ;
    UINT32  G235_RESERVER_4                                         ;
    UINT32  G235_RESERVER_5                                         ;
    UINT32  G235_RESERVER_6                                         ;
    UINT32  G235_RESERVER_7                                         ;
    UINT32  G235_RESERVER_8                                         ;
    UINT32  v656in_0_status                                         ;
    UINT32  G235_RESERVER_9                                         ;
    UINT32  v656in_0_use_free_clk                                   ;
    UINT32  G235_RESERVER_10                                        ;
    UINT32  G235_RESERVER_11                                        ;
    UINT32  G235_RESERVER_12                                        ;
    UINT32  G235_RESERVER_13                                        ;
    UINT32  v656in_0_vs_delay                                       ;
    UINT32  v656in_0_total_pix_per_line_to_iw                       ;
   

    // Group 236 : V656IN
    UINT32 v656in_1_ctrl_1                                          ;
    UINT32 v656in_1_ctrl_2                                          ;
    UINT32 v656in_1_int                                             ;
    UINT32 v656in_1_int_mask                                        ;
    UINT32 v656in_1_masked_int                                      ;
    UINT32 v656in_1_timer_out_thr_l                                 ;
    UINT32 v656in_1_timer_out_thr_h                                 ;
    UINT32 G236_RESERVER_0                                          ;
    UINT32 G236_RESERVER_1                                          ;
    UINT32 G236_RESERVER_2                                          ;
    UINT32 G236_RESERVER_3                                          ;
    UINT32 v656in_1_err_cntl                                        ;
    UINT32 v656in_1_pixel_start                                     ;
    UINT32 v656in_1_pixel_end                                       ;
    UINT32 v656in_1_line_start                                      ;
    UINT32 v656in_1_line_end                                        ;
    UINT32 v656in_1_pix_cnt                                         ;
    UINT32 v656in_1_line_cnt                                        ;
    UINT32 G236_RESERVER_4                                          ;
    UINT32 G236_RESERVER_5                                          ;
    UINT32 G236_RESERVER_6                                          ;
    UINT32 G236_RESERVER_7                                          ;
    UINT32 G236_RESERVER_8                                          ;
    UINT32 v656in_1_status                                          ;
    UINT32 G236_RESERVER_9                                          ;
    UINT32 v656in_1_use_free_clk                                    ;
    UINT32 G236_RESERVER_10                                         ;
    UINT32 G236_RESERVER_11                                         ;
    UINT32 G236_RESERVER_12                                         ;
    UINT32 G236_RESERVER_13                                         ;
    UINT32 v656in_1_vs_delay                                        ;
    UINT32 v656in_1_total_pix_per_line_to_iw                        ;

    // Group 237 : V656IN
    UINT32 v656in_2_ctrl_1                                          ;
    UINT32 v656in_2_ctrl_2                                          ;
    UINT32 v656in_2_int                                             ;
    UINT32 v656in_2_int_mask                                        ;
    UINT32 v656in_2_masked_int                                      ;
    UINT32 v656in_2_timer_out_thr_l                                 ;
    UINT32 v656in_2_timer_out_thr_h                                 ;
    UINT32 G237_RESERVER_0                                          ;
    UINT32 G237_RESERVER_1                                          ;
    UINT32 G237_RESERVER_2                                          ;
    UINT32 G237_RESERVER_3                                          ;
    UINT32 v656in_2_err_cntl                                        ;
    UINT32 v656in_2_pixel_start                                     ;
    UINT32 v656in_2_pixel_end                                       ;
    UINT32 v656in_2_line_start                                      ;
    UINT32 v656in_2_line_end                                        ;
    UINT32 v656in_2_pix_cnt                                         ;
    UINT32 v656in_2_line_cnt                                        ;
    UINT32 G237_RESERVER_4                                          ;
    UINT32 G237_RESERVER_5                                          ;
    UINT32 G237_RESERVER_6                                          ;
    UINT32 G237_RESERVER_7                                          ;
    UINT32 G237_RESERVER_8                                          ;
    UINT32 v656in_2_status                                          ;
    UINT32 G237_RESERVER_9                                          ;
    UINT32 v656in_2_use_free_clk                                    ;
    UINT32 G237_RESERVER_10                                         ;
    UINT32 G237_RESERVER_11                                         ;
    UINT32 G237_RESERVER_12                                         ;
    UINT32 G237_RESERVER_13                                         ;
    UINT32 v656in_2_vs_delay                                        ;
    UINT32 v656in_2_total_pix_per_line_to_iw                        ;

    // Group 238 : V656IN
    UINT32 v656in_3_ctrl_1                                          ;
    UINT32 v656in_3_ctrl_2                                          ;
    UINT32 v656in_3_int                                             ;
    UINT32 v656in_3_int_mask                                        ;
    UINT32 v656in_3_masked_int                                      ;
    UINT32 v656in_3_timer_out_thr_l                                 ;
    UINT32 v656in_3_timer_out_thr_h                                 ;
    UINT32 G238_RESERVER_0                                          ;
    UINT32 G238_RESERVER_1                                          ;
    UINT32 G238_RESERVER_2                                          ;
    UINT32 G238_RESERVER_3                                          ;
    UINT32 v656in_3_err_cntl                                        ;
    UINT32 v656in_3_pixel_start                                     ;
    UINT32 v656in_3_pixel_end                                       ;
    UINT32 v656in_3_line_start                                      ;
    UINT32 v656in_3_line_end                                        ;
    UINT32 v656in_3_pix_cnt                                         ;
    UINT32 v656in_3_line_cnt                                        ;
    UINT32 G238_RESERVER_4                                          ;
    UINT32 G238_RESERVER_5                                          ;
    UINT32 G238_RESERVER_6                                          ;
    UINT32 G238_RESERVER_7                                          ;
    UINT32 G238_RESERVER_8                                          ;
    UINT32 v656in_3_status                                          ;
    UINT32 G238_RESERVER_9                                          ;
    UINT32 v656in_3_use_free_clk                                    ;
    UINT32 G238_RESERVER_10                                         ;
    UINT32 G238_RESERVER_11                                         ;
    UINT32 G238_RESERVER_12                                         ;
    UINT32 G238_RESERVER_13                                         ;
    UINT32 v656in_3_vs_delay                                        ;
    UINT32 v656in_3_total_pix_per_line_to_iw                        ;    
    // Group 239 : V656IN
    UINT32 v656in_4_ctrl_1                                          ;
    UINT32 v656in_4_ctrl_2                                          ;
    UINT32 v656in_4_int                                             ;
    UINT32 v656in_4_int_mask                                        ;
    UINT32 v656in_4_masked_int                                      ;
    UINT32 v656in_4_timer_out_thr_l                                 ;
    UINT32 v656in_4_timer_out_thr_h                                 ;
    UINT32 G239_RESERVER_0                                          ;
    UINT32 G239_RESERVER_1                                          ;
    UINT32 G239_RESERVER_2                                          ;
    UINT32 G239_RESERVER_3                                          ;
    UINT32 v656in_4_err_cntl                                        ;
    UINT32 v656in_4_pixel_start                                     ;
    UINT32 v656in_4_pixel_end                                       ;
    UINT32 v656in_4_line_start                                      ;
    UINT32 v656in_4_line_end                                        ;
    UINT32 v656in_4_pix_cnt                                         ;
    UINT32 v656in_4_line_cnt                                        ;
    UINT32 G239_RESERVER_4                                          ;
    UINT32 G239_RESERVER_5                                          ;
    UINT32 G239_RESERVER_6                                          ;
    UINT32 G239_RESERVER_7                                          ;
    UINT32 G239_RESERVER_8                                          ;
    UINT32 v656in_4_status                                          ;
    UINT32 G239_RESERVER_9                                          ;
    UINT32 v656in_4_use_free_clk                                    ;
    UINT32 G239_RESERVER_10                                         ;
    UINT32 G239_RESERVER_11                                         ;
    UINT32 G239_RESERVER_12                                         ;
    UINT32 G239_RESERVER_13                                         ;
    UINT32 v656in_4_vs_delay                                        ;
    UINT32 v656in_4_total_pix_per_line_to_iw                        ;

    // Group 240 : V656IN
    UINT32 v656in_5_ctrl_1                                          ;
    UINT32 v656in_5_ctrl_2                                          ;
    UINT32 v656in_5_int                                             ;
    UINT32 v656in_5_int_mask                                        ;
    UINT32 v656in_5_masked_int                                      ;
    UINT32 v656in_5_timer_out_thr_l                                 ;
    UINT32 v656in_5_timer_out_thr_h                                 ;
    UINT32 G240_RESERVER_0                                          ;
    UINT32 G240_RESERVER_1                                          ;
    UINT32 G240_RESERVER_2                                          ;
    UINT32 G240_RESERVER_3                                          ;
    UINT32 v656in_5_err_cntl                                        ;
    UINT32 v656in_5_pixel_start                                     ;
    UINT32 v656in_5_pixel_end                                       ;
    UINT32 v656in_5_line_start                                      ;
    UINT32 v656in_5_line_end                                        ;
    UINT32 v656in_5_pix_cnt                                         ;
    UINT32 v656in_5_line_cnt                                        ;
    UINT32 G240_RESERVER_4                                          ;
    UINT32 G240_RESERVER_5                                          ;
    UINT32 G240_RESERVER_6                                          ;
    UINT32 G240_RESERVER_7                                          ;
    UINT32 G240_RESERVER_8                                          ;
    UINT32 v656in_5_status                                          ;
    UINT32 G240_RESERVER_9                                          ;
    UINT32 v656in_5_use_free_clk                                    ;
    UINT32 G240_RESERVER_10                                         ;
    UINT32 G240_RESERVER_11                                         ;
    UINT32 G240_RESERVER_12                                         ;
    UINT32 G240_RESERVER_13                                         ;
    UINT32 v656in_5_vs_delay                                        ;
    UINT32 v656in_5_total_pix_per_line_to_iw                        ;

    // Group 241 : V656IN
    UINT32 v656in_6_ctrl_1                                            ;
    UINT32 v656in_6_ctrl_2                                            ;
    UINT32 v656in_6_int                                               ;
    UINT32 v656in_6_int_mask                                          ;
    UINT32 v656in_6_masked_int                                        ;
    UINT32 v656in_6_timer_out_thr_l                                   ;
    UINT32 v656in_6_timer_out_thr_h                                   ;
    UINT32 G241_RESERVER_0                                            ;
    UINT32 G241_RESERVER_1                                            ;
    UINT32 G241_RESERVER_2                                            ;
    UINT32 G241_RESERVER_3                                            ;
    UINT32 v656in_6_err_cntl                                          ;
    UINT32 v656in_6_pixel_start                                       ;
    UINT32 v656in_6_pixel_end                                         ;
    UINT32 v656in_6_line_start                                        ;
    UINT32 v656in_6_line_end                                          ;
    UINT32 v656in_6_pix_cnt                                           ;
    UINT32 v656in_6_line_cnt                                          ;
    UINT32 G241_RESERVER_4                                            ;
    UINT32 G241_RESERVER_5                                            ;
    UINT32 G241_RESERVER_6                                            ;
    UINT32 G241_RESERVER_7                                            ;
    UINT32 G241_RESERVER_8                                            ;
    UINT32 v656in_6_status                                            ;
    UINT32 v656in_6_programmable_ext_fd_id_thr                        ;
    UINT32 v656in_6_use_free_clk                                      ;
    UINT32 reg_pix_start                                              ;
    UINT32 reg_pix_width                                              ;
    UINT32 reg_line_start                                             ;
    UINT32 reg_line_width                                             ;
    UINT32 v656in_6_vs_delay                                          ;
    UINT32 v656in_6_total_pix_per_line_to_iw                          ;

    // Group 242 : V656IN
    UINT32 v656iniw_0_latch_en                                 ;
    UINT32 v656iniw_0_enable_config                            ;
    UINT32 v656iniw_0_mode_config                              ;
    UINT32 v656iniw_0_luma_base_lsb                            ;
    UINT32 v656iniw_0_luma_base_msb                            ;
    UINT32 v656iniw_0_crma_base_lsb                            ;
    UINT32 v656iniw_0_crma_base_msb                            ;
    UINT32 v656iniw_0_mbus_config_0                            ;
    UINT32 v656iniw_0_mbus_config_1                            ;
    UINT32 v656iniw_0_frame_size                               ;
    UINT32 v656iniw_0_region_x_size                            ;
    UINT32 v656iniw_0_region_x_start                           ;
    UINT32 v656iniw_0_region_y_start                           ;
    UINT32 v656iniw_0_v_flip                                   ;
    UINT32 v656iniw_0_alpha_element                            ;
    UINT32 v656iniw_0_yuv_config                               ;
    UINT32 v656iniw_0_dither_config                            ;
    UINT32 v656iniw_0_sideband_config                          ;
    UINT32 v656iniw_0_iw_error_flag                            ;
    UINT32 v656iniw_0_ift_error_flag                           ;
    UINT32 v656iniw_0_luma_checksum                            ;
    UINT32 v656iniw_0_chroma_checksum                          ;
    UINT32 v656iniw_0_mbus_debug_0                             ;
    UINT32 v656iniw_0_mbus_debug_1                             ;
    UINT32 G242_RESERVER_0                                     ;
    UINT32 G242_RESERVER_1                                     ;
    UINT32 G242_RESERVER_2                                     ;
    UINT32 G242_RESERVER_3                                     ;
    UINT32 G242_RESERVER_4                                     ;
    UINT32 G242_RESERVER_5                                     ;
    UINT32 G242_RESERVER_6                                     ;
    UINT32 G242_RESERVER_7                                     ;

    // Group 243 : V656IN
    UINT32 v656iniw_1_latch_en                                ;
    UINT32 v656iniw_1_enable_config                           ;
    UINT32 v656iniw_1_mode_config                             ;
    UINT32 v656iniw_1_luma_base_lsb                           ;
    UINT32 v656iniw_1_luma_base_msb                           ;
    UINT32 v656iniw_1_crma_base_lsb                           ;
    UINT32 v656iniw_1_crma_base_msb                           ;
    UINT32 v656iniw_1_mbus_config_0                           ;
    UINT32 v656iniw_1_mbus_config_1                           ;
    UINT32 v656iniw_1_frame_size                              ;
    UINT32 v656iniw_1_region_x_size                           ;
    UINT32 v656iniw_1_region_x_start                          ;
    UINT32 v656iniw_1_region_y_start                          ;
    UINT32 v656iniw_1_v_flip                                  ;
    UINT32 v656iniw_1_alpha_element                           ;
    UINT32 v656iniw_1_yuv_config                              ;
    UINT32 v656iniw_1_dither_config                           ;
    UINT32 v656iniw_1_sideband_config                         ;
    UINT32 v656iniw_1_iw_error_flag                           ;
    UINT32 v656iniw_1_ift_error_flag                          ;
    UINT32 v656iniw_1_luma_checksum                           ;
    UINT32 v656iniw_1_chroma_checksum                         ;
    UINT32 v656iniw_1_mbus_debug_0                            ;
    UINT32 v656iniw_1_mbus_debug_1                            ;
    UINT32 G243_RESERVER_0                                    ;
    UINT32 G243_RESERVER_1                                    ;
    UINT32 G243_RESERVER_2                                    ;
    UINT32 G243_RESERVER_3                                    ;
    UINT32 G243_RESERVER_4                                    ;
    UINT32 G243_RESERVER_5                                    ;
    UINT32 G243_RESERVER_6                                    ;
    UINT32 G243_RESERVER_7                                    ;

    // Group 244 : V656IN
    UINT32 v656iniw_2_latch_en                                ;
    UINT32 v656iniw_2_enable_config                           ;
    UINT32 v656iniw_2_mode_config                             ;
    UINT32 v656iniw_2_luma_base_lsb                           ;
    UINT32 v656iniw_2_luma_base_msb                           ;
    UINT32 v656iniw_2_crma_base_lsb                           ;
    UINT32 v656iniw_2_crma_base_msb                           ;
    UINT32 v656iniw_2_mbus_config_0                           ;
    UINT32 v656iniw_2_mbus_config_1                           ;
    UINT32 v656iniw_2_frame_size                              ;
    UINT32 v656iniw_2_region_x_size                           ;
    UINT32 v656iniw_2_region_x_start                          ;
    UINT32 v656iniw_2_region_y_start                          ;
    UINT32 v656iniw_2_v_flip                                  ;
    UINT32 v656iniw_2_alpha_element                           ;
    UINT32 v656iniw_2_yuv_config                              ;
    UINT32 v656iniw_2_dither_config                           ;
    UINT32 v656iniw_2_sideband_config                         ;
    UINT32 v656iniw_2_iw_error_flag                           ;
    UINT32 v656iniw_2_ift_error_flag                          ;
    UINT32 v656iniw_2_luma_checksum                           ;
    UINT32 v656iniw_2_chroma_checksum                         ;
    UINT32 v656iniw_2_mbus_debug_0                            ;
    UINT32 v656iniw_2_mbus_debug_1                            ;
    UINT32 G244_RESERVER_0                                    ;
    UINT32 G244_RESERVER_1                                    ;
    UINT32 G244_RESERVER_2                                    ;
    UINT32 G244_RESERVER_3                                    ;
    UINT32 G244_RESERVER_4                                    ;
    UINT32 G244_RESERVER_5                                    ;
    UINT32 G244_RESERVER_6                                    ;
    UINT32 G244_RESERVER_7                                    ;

    // Group 245 : V656IN
    UINT32 v656iniw_3_latch_en                                ;
    UINT32 v656iniw_3_enable_config                           ;
    UINT32 v656iniw_3_mode_config                             ;
    UINT32 v656iniw_3_luma_base_lsb                           ;
    UINT32 v656iniw_3_luma_base_msb                           ;
    UINT32 v656iniw_3_crma_base_lsb                           ;
    UINT32 v656iniw_3_crma_base_msb                           ;
    UINT32 v656iniw_3_mbus_config_0                           ;
    UINT32 v656iniw_3_mbus_config_1                           ;
    UINT32 v656iniw_3_frame_size                              ;
    UINT32 v656iniw_3_region_x_size                           ;
    UINT32 v656iniw_3_region_x_start                          ;
    UINT32 v656iniw_3_region_y_start                          ;
    UINT32 v656iniw_3_v_flip                                  ;
    UINT32 v656iniw_3_alpha_element                           ;
    UINT32 v656iniw_3_yuv_config                              ;
    UINT32 v656iniw_3_dither_config                           ;
    UINT32 v656iniw_3_sideband_config                         ;
    UINT32 v656iniw_3_iw_error_flag                           ;
    UINT32 v656iniw_3_ift_error_flag                          ;
    UINT32 v656iniw_3_luma_checksum                           ;
    UINT32 v656iniw_3_chroma_checksum                         ;
    UINT32 v656iniw_3_mbus_debug_0                            ;
    UINT32 v656iniw_3_mbus_debug_1                            ;
    UINT32 G245_RESERVER_0                                    ;
    UINT32 G245_RESERVER_1                                    ;
    UINT32 G245_RESERVER_2                                    ;
    UINT32 G245_RESERVER_3                                    ;
    UINT32 G245_RESERVER_4                                    ;
    UINT32 G245_RESERVER_5                                    ;
    UINT32 G245_RESERVER_6                                    ;
    UINT32 G245_RESERVER_7                                    ;

    // Group 246 : V656IN
    UINT32 v656iniw_4_latch_en                               ;
    UINT32 v656iniw_4_enable_config                          ;
    UINT32 v656iniw_4_mode_config                            ;
    UINT32 v656iniw_4_luma_base_lsb                          ;
    UINT32 v656iniw_4_luma_base_msb                          ;
    UINT32 v656iniw_4_crma_base_lsb                          ;
    UINT32 v656iniw_4_crma_base_msb                          ;
    UINT32 v656iniw_4_mbus_config_0                          ;
    UINT32 v656iniw_4_mbus_config_1                          ;
    UINT32 v656iniw_4_frame_size                             ;
    UINT32 v656iniw_4_region_x_size                          ;
    UINT32 v656iniw_4_region_x_start                         ;
    UINT32 v656iniw_4_region_y_start                         ;
    UINT32 v656iniw_4_v_flip                                 ;
    UINT32 v656iniw_4_alpha_element                          ;
    UINT32 v656iniw_4_yuv_config                             ;
    UINT32 v656iniw_4_dither_config                          ;
    UINT32 v656iniw_4_sideband_config                        ;
    UINT32 v656iniw_4_iw_error_flag                          ;
    UINT32 v656iniw_4_ift_error_flag                         ;
    UINT32 v656iniw_4_luma_checksum                          ;
    UINT32 v656iniw_4_chroma_checksum                        ;
    UINT32 v656iniw_4_mbus_debug_0                           ;
    UINT32 v656iniw_4_mbus_debug_1                           ;
    UINT32 G246_RESERVER_0                                   ;
    UINT32 G246_RESERVER_1                                   ;
    UINT32 G246_RESERVER_2                                   ;
    UINT32 G246_RESERVER_3                                   ;
    UINT32 G246_RESERVER_4                                   ;
    UINT32 G246_RESERVER_5                                   ;
    UINT32 G246_RESERVER_6                                   ;
    UINT32 G246_RESERVER_7                                   ;

    // Group 247 : V656IN
    UINT32 v656iniw_5_latch_en                               ;
    UINT32 v656iniw_5_enable_config                          ;
    UINT32 v656iniw_5_mode_config                            ;
    UINT32 v656iniw_5_luma_base_lsb                          ;
    UINT32 v656iniw_5_luma_base_msb                          ;
    UINT32 v656iniw_5_crma_base_lsb                          ;
    UINT32 v656iniw_5_crma_base_msb                          ;
    UINT32 v656iniw_5_mbus_config_0                          ;
    UINT32 v656iniw_5_mbus_config_1                          ;
    UINT32 v656iniw_5_frame_size                             ;
    UINT32 v656iniw_5_region_x_size                          ;
    UINT32 v656iniw_5_region_x_start                         ;
    UINT32 v656iniw_5_region_y_start                         ;
    UINT32 v656iniw_5_v_flip                                 ;
    UINT32 v656iniw_5_alpha_element                          ;
    UINT32 v656iniw_5_yuv_config                             ;
    UINT32 v656iniw_5_dither_config                          ;
    UINT32 v656iniw_5_sideband_config                        ;
    UINT32 v656iniw_5_iw_error_flag                          ;
    UINT32 v656iniw_5_ift_error_flag                         ;
    UINT32 v656iniw_5_luma_checksum                          ;
    UINT32 v656iniw_5_chroma_checksum                        ;
    UINT32 v656iniw_5_mbus_debug_0                           ;
    UINT32 v656iniw_5_mbus_debug_1                           ;
    UINT32 G247_RESERVER_0                                   ;
    UINT32 G247_RESERVER_1                                   ;
    UINT32 G247_RESERVER_2                                   ;
    UINT32 G247_RESERVER_3                                   ;
    UINT32 G247_RESERVER_4                                   ;
    UINT32 G247_RESERVER_5                                   ;
    UINT32 G247_RESERVER_6                                   ;
    UINT32 G247_RESERVER_7                                   ;

    // Group 248 : V656IN
    UINT32 v656iniw_6_latch_en                               ;
    UINT32 v656iniw_6_enable_config                          ;
    UINT32 v656iniw_6_mode_config                            ;
    UINT32 v656iniw_6_luma_base_lsb                          ;
    UINT32 v656iniw_6_luma_base_msb                          ;
    UINT32 v656iniw_6_crma_base_lsb                          ;
    UINT32 v656iniw_6_crma_base_msb                          ;
    UINT32 v656iniw_6_mbus_config_0                          ;
    UINT32 v656iniw_6_mbus_config_1                          ;
    UINT32 v656iniw_6_frame_size                             ;
    UINT32 v656iniw_6_region_x_size                          ;
    UINT32 v656iniw_6_region_x_start                         ;
    UINT32 v656iniw_6_region_y_start                         ;
    UINT32 v656iniw_6_v_flip                                 ;
    UINT32 v656iniw_6_alpha_element                          ;
    UINT32 v656iniw_6_yuv_config                             ;
    UINT32 v656iniw_6_dither_config                          ;
    UINT32 v656iniw_6_sideband_config                        ;
    UINT32 v656iniw_6_iw_error_flag                          ;
    UINT32 v656iniw_6_ift_error_flag                         ;
    UINT32 v656iniw_6_luma_checksum                          ;
    UINT32 v656iniw_6_chroma_checksum                        ;
    UINT32 v656iniw_6_mbus_debug_0                           ;
    UINT32 v656iniw_6_mbus_debug_1                           ;
    UINT32 G248_RESERVER_0                                   ;
    UINT32 G248_RESERVER_1                                   ;
    UINT32 G248_RESERVER_2                                   ;
    UINT32 G248_RESERVER_3                                   ;
    UINT32 G248_RESERVER_4                                   ;
    UINT32 G248_RESERVER_5                                   ;
    UINT32 G248_RESERVER_6                                   ;
    UINT32 G248_RESERVER_7                                   ;

    // Group 249 : Reserved
    UINT32 v656in_top_rf_sd_3_sel                                      ;
    UINT32 v656in_top_MIPI_RX_BT1120_SEL                               ;
    UINT32 v656in_top_int_0_type_sel                                   ;
    UINT32 v656in_top_tw2864_input_chennal_mode                        ;
    UINT32 v656in_input_source_channel_sel                             ;
    UINT32 v656in_input_channel_xy_report_0                            ;
    UINT32 v656in_input_channel_xy_report_1                            ;
    UINT32 v656in_mismatch_report                                      ;
    UINT32 G249_RESERVER_0                                             ;
    UINT32 G249_RESERVER_1                                             ;
    UINT32 G249_RESERVER_2                                             ;
    UINT32 G249_RESERVER_3                                             ;
    UINT32 G249_RESERVER_4                                             ;
    UINT32 G249_RESERVER_5                                             ;
    UINT32 G249_RESERVER_6                                             ;
    UINT32 G249_RESERVER_7                                             ;
    UINT32 G249_RESERVER_8                                             ;
    UINT32 G249_RESERVER_9                                             ;
    UINT32 G249_RESERVER_10                                            ;
    UINT32 G249_RESERVER_11                                            ;
    UINT32 G249_RESERVER_12                                            ;
    UINT32 G249_RESERVER_13                                            ;
    UINT32 G249_RESERVER_14                                            ;
    UINT32 G249_RESERVER_15                                            ;
    UINT32 G249_RESERVER_16                                            ;
    UINT32 G249_RESERVER_17                                            ;
    UINT32 G249_RESERVER_18                                            ;
    UINT32 G249_RESERVER_19                                            ;
    UINT32 G249_RESERVER_20                                            ;
    UINT32 G249_RESERVER_21                                            ;
    UINT32 G249_RESERVER_22                                            ;
    UINT32 G249_RESERVER_23                                            ;

    // Group 250 : Reserved
    UINT32  G250_RESERVED[32]                     ;

    // Group 251 : Reserved
    UINT32  G251_RESERVED[32]                     ;

    // Group 252 : Reserved
    UINT32  G252_RESERVED[32]                     ;

    // Group 253 : Reserved
    UINT32  G253_RESERVED[32]                     ;

    // Group 254 : Reserved
    UINT32  G254_RESERVED[32]                     ;

    // Group 255 : Reserved
    UINT32  G255_RESERVED[32]                     ;

    // Group 256 : Reserved
    UINT32  G256_RESERVED[32]                     ;

    // Group 257 : HDMI_TX
    UINT32  G257_HDMI_TX[32]                      ;

    //Group   258 : MBOX
    UINT32  mbox0_a926_int_trigger                ; // 00  (ADDR : 0x9C00_8100)
    UINT32  mbox0_writelock_flag                  ; // 01  (ADDR : 0x9C00_8104)
    UINT32  mbox0_overwrite_flag                  ; // 02  (ADDR : 0x9C00_8108)
    UINT32  RGST_Group0258_Reg03                  ; // 03  (ADDR : 0x9C00_810C)
    UINT32  mbox0_normal_trans[20]                ; // 04  (ADDR : 0x9C00_8110)
						    // 05  (ADDR : 0x9C00_8114)
						    // 06  (ADDR : 0x9C00_8118)
						    // 07  (ADDR : 0x9C00_811C)
                                                    // 08  (ADDR : 0x9C00_8120)
                                                    // 09  (ADDR : 0x9C00_8124)
                                                    // 10  (ADDR : 0x9C00_8128)
                                                    // 11  (ADDR : 0x9C00_812C)
                                                    // 12  (ADDR : 0x9C00_8130)
                                                    // 13  (ADDR : 0x9C00_8134)
                                                    // 14  (ADDR : 0x9C00_8138)
                                                    // 15  (ADDR : 0x9C00_813C)
                                                    // 16  (ADDR : 0x9C00_8140)
                                                    // 17  (ADDR : 0x9C00_8144)
                                                    // 18  (ADDR : 0x9C00_8148)
                                                    // 19  (ADDR : 0x9C00_814C)
                                                    // 20  (ADDR : 0x9C00_8150)
                                                    // 21  (ADDR : 0x9C00_8154)
                                                    // 22  (ADDR : 0x9C00_8158)
                                                    // 23  (ADDR : 0x9C00_815C)
    UINT32  mbox0_direct_trans[8]                 ; // 24  (ADDR : 0x9C00_8160)
                                                    // 25  (ADDR : 0x9C00_8164)
                                                    // 26  (ADDR : 0x9C00_8168)
                                                    // 27  (ADDR : 0x9C00_816C)
                                                    // 28  (ADDR : 0x9C00_8170)
                                                    // 29  (ADDR : 0x9C00_8174)
                                                    // 30  (ADDR : 0x9C00_8178)
                                                    // 31  (ADDR : 0x9C00_817C)

    //Group   259 : MBOX
    UINT32  mbox1_ca9_int_trigger                 ; // 00  (ADDR : 0x9C00_8180)
    UINT32  mbox1_writelock_flag                  ; // 01  (ADDR : 0x9C00_8184)
    UINT32  mbox1_overwrite_flag                  ; // 02  (ADDR : 0x9C00_8188)
    UINT32  RGST_Group0259_Reg03                  ; // 03  (ADDR : 0x9C00_818C)
    UINT32  mbox1_normal_trans[20]                 ; // 04  (ADDR : 0x9C00_8190)
                                                    // 05  (ADDR : 0x9C00_8194)
                                                    // 06  (ADDR : 0x9C00_8198)
                                                    // 07  (ADDR : 0x9C00_819C)
                                                    // 08  (ADDR : 0x9C00_81A0)
                                                    // 09  (ADDR : 0x9C00_81A4)
                                                    // 10  (ADDR : 0x9C00_81A8)
                                                    // 11  (ADDR : 0x9C00_81AC)
                                                    // 12  (ADDR : 0x9C00_81B0)
                                                    // 13  (ADDR : 0x9C00_81B4)
                                                    // 14  (ADDR : 0x9C00_81B8)
                                                    // 15  (ADDR : 0x9C00_81BC)
                                                    // 16  (ADDR : 0x9C00_81C0)
                                                    // 17  (ADDR : 0x9C00_81C4)
                                                    // 18  (ADDR : 0x9C00_81C8)
                                                    // 19  (ADDR : 0x9C00_81CC)
                                                    // 20  (ADDR : 0x9C00_81D0)
                                                    // 21  (ADDR : 0x9C00_81D4)
                                                    // 22  (ADDR : 0x9C00_81D8)
                                                    // 23  (ADDR : 0x9C00_81DC)
    UINT32  mbox1_direct_trans[8]                 ; // 24  (ADDR : 0x9C00_81E0)
						    // 25  (ADDR : 0x9C00_81E4)
    		                                    // 26  (ADDR : 0x9C00_81E8)
    		                                    // 27  (ADDR : 0x9C00_81EC)
    		                                    // 28  (ADDR : 0x9C00_81F0)
    		                                    // 29  (ADDR : 0x9C00_81F4)
    		                                    // 30  (ADDR : 0x9C00_81F8)
    		                                    // 31  (ADDR : 0x9C00_81FC)

    // Group 260 : HDMI_TX
    UINT32  G260_HDMI_TX[32]                      ;

    // Group 261 : HDMI_TX
    UINT32  G261_HDMI_TX[32]                      ;

    // Group 262 : HDMI_TX
    UINT32  G262_HDMI_TX[32]                      ;

    // Group 263 : HDMI_TX
    UINT32  G263_HDMI_TX[32]                      ;

    // Group 264 : SDIO_CTL
    UINT32  G264_SDIO_CTL[32]                    ;
    
    // Group 265 : SDIO_CTL
    UINT32  G265_SDIO_CTL[32]                    ;

    // Group 266 : SDIO_CTL
    UINT32  G266_SDIO_CTL[32]                    ;

    // Group 267 : SDIO_CTL
    UINT32  G267_SDIO_CTL[32]                    ;

    // Group 268 : SDIO_CTL
    UINT32  G268_SDIO_CTL[32]                    ;
 
    // Group 269 ~ 270 , Reserved
    UINT32  G269_G270_RESERVED[2*32]              ; //

    // Group 271 : UART4
    UINT32  uart4_data                            ; // 0 
    UINT32  uart4_lsr                             ; // 1 
    UINT32  uart4_msr                             ; // 2 
    UINT32  uart4_lcr                             ; // 3 
    UINT32  uart4_mcr                             ; // 4 
    UINT32  uart4_div_l                           ; // 5 
    UINT32  uart4_div_h                           ; // 6 
    UINT32  uart4_isc                             ; // 7 
    UINT32  uart4_tx_residue                      ; // 8
    UINT32  uart4_rx_residue                      ; // 9
    UINT32  uart4_rxfifo_thr                      ; //10
    UINT32  G271_reserved[21]                     ; //

    // Group 272 : UART5
    UINT32  uart5_data                            ; // 0 
    UINT32  uart5_lsr                             ; // 1 
    UINT32  uart5_msr                             ; // 2 
    UINT32  uart5_lcr                             ; // 3 
    UINT32  uart5_mcr                             ; // 4 
    UINT32  uart5_div_l                           ; // 5 
    UINT32  uart5_div_h                           ; // 6 
    UINT32  uart5_isc                             ; // 7 
    UINT32  uart5_tx_residue                      ; // 8
    UINT32  uart5_rx_residue                      ; // 9
    UINT32  uart5_rxfifo_thr                      ; //10
    UINT32  G272_reserved[21]                     ; //

    // Group 273 : UART6
    UINT32  G273_reserved[32]                     ; //

    // Group 274 : Reserved
    UINT32  G274_RESERVED[32]                     ; //

    // Group 275 : UART_DMA
    UINT32  RF_DMA0_ENABLE_SEL                    ; // 00
    UINT32  RF_DMA0_START_ADDR                    ; // 01
    UINT32  RF_DMA0_TIMEOUT_SET                   ; // 02
    UINT32  RF_DMA0_STATUS                        ; // 03
    UINT32  RF_DMA0_WR_ADR                        ; // 04
    UINT32  RF_DMA0_RD_ADR                        ; // 05
    UINT32  RF_DMA0_LENGTH_THR                    ; // 06
    UINT32  RF_DMA0_END_ADDR                      ; // 07
    UINT32  RF_DMA0_DATABYTES                     ; // 08
    UINT32  RF_DMA0_DEBUG_INFO                    ; // 09
    UINT32  RF_DMA0_RESERVED[6]                   ; // 10 ~ 15
    UINT32  RF_DMA1_ENABLE_SEL                    ; // 16
    UINT32  RF_DMA1_START_ADDR                    ; // 17
    UINT32  RF_DMA1_TIMEOUT_SET                   ; // 18
    UINT32  RF_DMA1_STATUS                        ; // 19
    UINT32  RF_DMA1_WR_ADR                        ; // 20
    UINT32  RF_DMA1_RD_ADR                        ; // 21
    UINT32  RF_DMA1_LENGTH_THR                    ; // 22
    UINT32  RF_DMA1_END_ADDR                      ; // 23
    UINT32  RF_DMA1_DATABYTES                     ; // 24
    UINT32  RF_DMA1_DEBUG_INFO                    ; // 25
    UINT32  RF_DMA1_RESERVED[6]                   ; // 26 ~ 31

    // Group 276 ~ 280 , Reserved
    UINT32  G276_G280_RESERVED[5*32]            ;
    
    //Group   281 : EMU_G0
    UINT32  RGST_Group0281_Reg00                  ; // 00  (ADDR : 0x9C00_8C80)
    UINT32  RGST_Group0281_Reg01                  ; // 01  (ADDR : 0x9C00_8C84)
    UINT32  RGST_Group0281_Reg02                  ; // 02  (ADDR : 0x9C00_8C88)
    UINT32  RGST_Group0281_Reg03                  ; // 03  (ADDR : 0x9C00_8C8C)
    UINT32  RGST_Group0281_Reg04                  ; // 04  (ADDR : 0x9C00_8C90)
    UINT32  RGST_Group0281_Reg05                  ; // 05  (ADDR : 0x9C00_8C94)
    UINT32  RGST_Group0281_Reg06                  ; // 06  (ADDR : 0x9C00_8C98)
    UINT32  RGST_Group0281_Reg07                  ; // 07  (ADDR : 0x9C00_8C9C)
    UINT32  RGST_Group0281_Reg08                  ; // 08  (ADDR : 0x9C00_8CA0)
    UINT32  RGST_Group0281_Reg09                  ; // 09  (ADDR : 0x9C00_8CA4)
    UINT32  RGST_Group0281_Reg10                  ; // 10  (ADDR : 0x9C00_8CA8)
    UINT32  RGST_Group0281_Reg11                  ; // 11  (ADDR : 0x9C00_8CAC)
    UINT32  RGST_Group0281_Reg12                  ; // 12  (ADDR : 0x9C00_8CB0)
    UINT32  RGST_Group0281_Reg13                  ; // 13  (ADDR : 0x9C00_8CB4)
    UINT32  RGST_Group0281_Reg14                  ; // 14  (ADDR : 0x9C00_8CB8)
    UINT32  RGST_Group0281_Reg15                  ; // 15  (ADDR : 0x9C00_8CBC)
    UINT32  RGST_Group0281_Reg16                  ; // 16  (ADDR : 0x9C00_8CC0)
    UINT32  RGST_Group0281_Reg17                  ; // 17  (ADDR : 0x9C00_8CC4)
    UINT32  RGST_Group0281_Reg18                  ; // 18  (ADDR : 0x9C00_8CC8)
    UINT32  RGST_Group0281_Reg19                  ; // 19  (ADDR : 0x9C00_8CCC)
    UINT32  RGST_Group0281_Reg20                  ; // 20  (ADDR : 0x9C00_8CD0)
    UINT32  RGST_Group0281_Reg21                  ; // 21  (ADDR : 0x9C00_8CD4)
    UINT32  RGST_Group0281_Reg22                  ; // 22  (ADDR : 0x9C00_8CD8)
    UINT32  RGST_Group0281_Reg23                  ; // 23  (ADDR : 0x9C00_8CDC)
    UINT32  RGST_Group0281_Reg24                  ; // 24  (ADDR : 0x9C00_8CE0)
    UINT32  RGST_Group0281_Reg25                  ; // 25  (ADDR : 0x9C00_8CE4)
    UINT32  RGST_Group0281_Reg26                  ; // 26  (ADDR : 0x9C00_8CE8)
    UINT32  RGST_Group0281_Reg27                  ; // 27  (ADDR : 0x9C00_8CEC)
    UINT32  RGST_Group0281_Reg28                  ; // 28  (ADDR : 0x9C00_8CF0)
    UINT32  RGST_Group0281_Reg29                  ; // 29  (ADDR : 0x9C00_8CF4)
    UINT32  RGST_Group0281_Reg30                  ; // 30  (ADDR : 0x9C00_8CF8)
    UINT32  RGST_Group0281_Reg31                  ; // 31  (ADDR : 0x9C00_8CFC)

    //Group   282 : EMU_G0
    UINT32  RGST_Group0282_Reg00                  ; // 00  (ADDR : 0x9C00_8D00)
    UINT32  RGST_Group0282_Reg01                  ; // 01  (ADDR : 0x9C00_8D04)
    UINT32  RGST_Group0282_Reg02                  ; // 02  (ADDR : 0x9C00_8D08)
    UINT32  RGST_Group0282_Reg03                  ; // 03  (ADDR : 0x9C00_8D0C)
    UINT32  RGST_Group0282_Reg04                  ; // 04  (ADDR : 0x9C00_8D10)
    UINT32  RGST_Group0282_Reg05                  ; // 05  (ADDR : 0x9C00_8D14)
    UINT32  RGST_Group0282_Reg06                  ; // 06  (ADDR : 0x9C00_8D18)
    UINT32  RGST_Group0282_Reg07                  ; // 07  (ADDR : 0x9C00_8D1C)
    UINT32  RGST_Group0282_Reg08                  ; // 08  (ADDR : 0x9C00_8D20)
    UINT32  RGST_Group0282_Reg09                  ; // 09  (ADDR : 0x9C00_8D24)
    UINT32  RGST_Group0282_Reg10                  ; // 10  (ADDR : 0x9C00_8D28)
    UINT32  RGST_Group0282_Reg11                  ; // 11  (ADDR : 0x9C00_8D2C)
    UINT32  RGST_Group0282_Reg12                  ; // 12  (ADDR : 0x9C00_8D30)
    UINT32  RGST_Group0282_Reg13                  ; // 13  (ADDR : 0x9C00_8D34)
    UINT32  RGST_Group0282_Reg14                  ; // 14  (ADDR : 0x9C00_8D38)
    UINT32  RGST_Group0282_Reg15                  ; // 15  (ADDR : 0x9C00_8D3C)
    UINT32  RGST_Group0282_Reg16                  ; // 16  (ADDR : 0x9C00_8D40)
    UINT32  RGST_Group0282_Reg17                  ; // 17  (ADDR : 0x9C00_8D44)
    UINT32  RGST_Group0282_Reg18                  ; // 18  (ADDR : 0x9C00_8D48)
    UINT32  RGST_Group0282_Reg19                  ; // 19  (ADDR : 0x9C00_8D4C)
    UINT32  RGST_Group0282_Reg20                  ; // 20  (ADDR : 0x9C00_8D50)
    UINT32  RGST_Group0282_Reg21                  ; // 21  (ADDR : 0x9C00_8D54)
    UINT32  RGST_Group0282_Reg22                  ; // 22  (ADDR : 0x9C00_8D58)
    UINT32  RGST_Group0282_Reg23                  ; // 23  (ADDR : 0x9C00_8D5C)
    UINT32  RGST_Group0282_Reg24                  ; // 24  (ADDR : 0x9C00_8D60)
    UINT32  RGST_Group0282_Reg25                  ; // 25  (ADDR : 0x9C00_8D64)
    UINT32  RGST_Group0282_Reg26                  ; // 26  (ADDR : 0x9C00_8D68)
    UINT32  RGST_Group0282_Reg27                  ; // 27  (ADDR : 0x9C00_8D6C)
    UINT32  RGST_Group0282_Reg28                  ; // 28  (ADDR : 0x9C00_8D70)
    UINT32  RGST_Group0282_Reg29                  ; // 29  (ADDR : 0x9C00_8D74)
    UINT32  RGST_Group0282_Reg30                  ; // 30  (ADDR : 0x9C00_8D78)
    UINT32  RGST_Group0282_Reg31                  ; // 31  (ADDR : 0x9C00_8D7C)

    //Group   283 : EMU_G1
    UINT32  RGST_Group0283_Reg00                  ; // 00  (ADDR : 0x9C00_8D80)
    UINT32  RGST_Group0283_Reg01                  ; // 01  (ADDR : 0x9C00_8D84)
    UINT32  RGST_Group0283_Reg02                  ; // 02  (ADDR : 0x9C00_8D88)
    UINT32  RGST_Group0283_Reg03                  ; // 03  (ADDR : 0x9C00_8D8C)
    UINT32  RGST_Group0283_Reg04                  ; // 04  (ADDR : 0x9C00_8D90)
    UINT32  RGST_Group0283_Reg05                  ; // 05  (ADDR : 0x9C00_8D94)
    UINT32  RGST_Group0283_Reg06                  ; // 06  (ADDR : 0x9C00_8D98)
    UINT32  RGST_Group0283_Reg07                  ; // 07  (ADDR : 0x9C00_8D9C)
    UINT32  RGST_Group0283_Reg08                  ; // 08  (ADDR : 0x9C00_8DA0)
    UINT32  RGST_Group0283_Reg09                  ; // 09  (ADDR : 0x9C00_8DA4)
    UINT32  RGST_Group0283_Reg10                  ; // 10  (ADDR : 0x9C00_8DA8)
    UINT32  RGST_Group0283_Reg11                  ; // 11  (ADDR : 0x9C00_8DAC)
    UINT32  RGST_Group0283_Reg12                  ; // 12  (ADDR : 0x9C00_8DB0)
    UINT32  RGST_Group0283_Reg13                  ; // 13  (ADDR : 0x9C00_8DB4)
    UINT32  RGST_Group0283_Reg14                  ; // 14  (ADDR : 0x9C00_8DB8)
    UINT32  RGST_Group0283_Reg15                  ; // 15  (ADDR : 0x9C00_8DBC)
    UINT32  RGST_Group0283_Reg16                  ; // 16  (ADDR : 0x9C00_8DC0)
    UINT32  RGST_Group0283_Reg17                  ; // 17  (ADDR : 0x9C00_8DC4)
    UINT32  RGST_Group0283_Reg18                  ; // 18  (ADDR : 0x9C00_8DC8)
    UINT32  RGST_Group0283_Reg19                  ; // 19  (ADDR : 0x9C00_8DCC)
    UINT32  RGST_Group0283_Reg20                  ; // 20  (ADDR : 0x9C00_8DD0)
    UINT32  RGST_Group0283_Reg21                  ; // 21  (ADDR : 0x9C00_8DD4)
    UINT32  RGST_Group0283_Reg22                  ; // 22  (ADDR : 0x9C00_8DD8)
    UINT32  RGST_Group0283_Reg23                  ; // 23  (ADDR : 0x9C00_8DDC)
    UINT32  RGST_Group0283_Reg24                  ; // 24  (ADDR : 0x9C00_8DE0)
    UINT32  RGST_Group0283_Reg25                  ; // 25  (ADDR : 0x9C00_8DE4)
    UINT32  RGST_Group0283_Reg26                  ; // 26  (ADDR : 0x9C00_8DE8)
    UINT32  RGST_Group0283_Reg27                  ; // 27  (ADDR : 0x9C00_8DEC)
    UINT32  RGST_Group0283_Reg28                  ; // 28  (ADDR : 0x9C00_8DF0)
    UINT32  RGST_Group0283_Reg29                  ; // 29  (ADDR : 0x9C00_8DF4)
    UINT32  RGST_Group0283_Reg30                  ; // 30  (ADDR : 0x9C00_8DF8)
    UINT32  RGST_Group0283_Reg31                  ; // 31  (ADDR : 0x9C00_8DFC)

    //Group   284 : EMU_G2
    UINT32  RGST_Group0284_Reg00                  ; // 00  (ADDR : 0x9C00_8E00)
    UINT32  RGST_Group0284_Reg01                  ; // 01  (ADDR : 0x9C00_8E04)
    UINT32  RGST_Group0284_Reg02                  ; // 02  (ADDR : 0x9C00_8E08)
    UINT32  RGST_Group0284_Reg03                  ; // 03  (ADDR : 0x9C00_8E0C)
    UINT32  RGST_Group0284_Reg04                  ; // 04  (ADDR : 0x9C00_8E10)
    UINT32  RGST_Group0284_Reg05                  ; // 05  (ADDR : 0x9C00_8E14)
    UINT32  RGST_Group0284_Reg06                  ; // 06  (ADDR : 0x9C00_8E18)
    UINT32  RGST_Group0284_Reg07                  ; // 07  (ADDR : 0x9C00_8E1C)
    UINT32  RGST_Group0284_Reg08                  ; // 08  (ADDR : 0x9C00_8E20)
    UINT32  RGST_Group0284_Reg09                  ; // 09  (ADDR : 0x9C00_8E24)
    UINT32  RGST_Group0284_Reg10                  ; // 10  (ADDR : 0x9C00_8E28)
    UINT32  RGST_Group0284_Reg11                  ; // 11  (ADDR : 0x9C00_8E2C)
    UINT32  RGST_Group0284_Reg12                  ; // 12  (ADDR : 0x9C00_8E30)
    UINT32  RGST_Group0284_Reg13                  ; // 13  (ADDR : 0x9C00_8E34)
    UINT32  RGST_Group0284_Reg14                  ; // 14  (ADDR : 0x9C00_8E38)
    UINT32  RGST_Group0284_Reg15                  ; // 15  (ADDR : 0x9C00_8E3C)
    UINT32  RGST_Group0284_Reg16                  ; // 16  (ADDR : 0x9C00_8E40)
    UINT32  RGST_Group0284_Reg17                  ; // 17  (ADDR : 0x9C00_8E44)
    UINT32  RGST_Group0284_Reg18                  ; // 18  (ADDR : 0x9C00_8E48)
    UINT32  RGST_Group0284_Reg19                  ; // 19  (ADDR : 0x9C00_8E4C)
    UINT32  RGST_Group0284_Reg20                  ; // 20  (ADDR : 0x9C00_8E50)
    UINT32  RGST_Group0284_Reg21                  ; // 21  (ADDR : 0x9C00_8E54)
    UINT32  RGST_Group0284_Reg22                  ; // 22  (ADDR : 0x9C00_8E58)
    UINT32  RGST_Group0284_Reg23                  ; // 23  (ADDR : 0x9C00_8E5C)
    UINT32  RGST_Group0284_Reg24                  ; // 24  (ADDR : 0x9C00_8E60)
    UINT32  RGST_Group0284_Reg25                  ; // 25  (ADDR : 0x9C00_8E64)
    UINT32  RGST_Group0284_Reg26                  ; // 26  (ADDR : 0x9C00_8E68)
    UINT32  RGST_Group0284_Reg27                  ; // 27  (ADDR : 0x9C00_8E6C)
    UINT32  RGST_Group0284_Reg28                  ; // 28  (ADDR : 0x9C00_8E70)
    UINT32  RGST_Group0284_Reg29                  ; // 29  (ADDR : 0x9C00_8E74)
    UINT32  RGST_Group0284_Reg30                  ; // 30  (ADDR : 0x9C00_8E78)
    UINT32  RGST_Group0284_Reg31                  ; // 31  (ADDR : 0x9C00_8E7C)

    //Group   285 ~ 290 : Reserved
    UINT32  RGST_Group0285_Reserved[32]           ; //     (ADDR : 0x9C00_8E80) ~ (ADDR : 0x9C00_8EFC)
    UINT32  RGST_Group0286_Reserved[32]           ; //     (ADDR : 0x9C00_8F00) ~ (ADDR : 0x9C00_8F7C)
    UINT32  RGST_Group0287_Reserved[32]           ; //     (ADDR : 0x9C00_8F80) ~ (ADDR : 0x9C00_8FFC)
    UINT32  RGST_Group0288_Reserved[32]           ; //     (ADDR : 0x9C00_9000) ~ (ADDR : 0x9C00_907C)
    UINT32  RGST_Group0289_Reserved[32]           ; //     (ADDR : 0x9C00_9080) ~ (ADDR : 0x9C00_90FC)
    UINT32  RGST_Group0290_Reserved[32]           ; //     (ADDR : 0x9C00_9100) ~ (ADDR : 0x9C00_917C)

    //Group   291 : TNR0
    UINT32  RGST_Group0291_Reg00                  ; // 00  (ADDR : 0x9C00_9180)
    UINT32  RGST_Group0291_Reg01                  ; // 01  (ADDR : 0x9C00_9184)
    UINT32  RGST_Group0291_Reg02                  ; // 02  (ADDR : 0x9C00_9188)
    UINT32  RGST_Group0291_Reg03                  ; // 03  (ADDR : 0x9C00_918C)
    UINT32  RGST_Group0291_Reg04                  ; // 04  (ADDR : 0x9C00_9190)
    UINT32  RGST_Group0291_Reg05                  ; // 05  (ADDR : 0x9C00_9194)
    UINT32  RGST_Group0291_Reg06                  ; // 06  (ADDR : 0x9C00_9198)
    UINT32  RGST_Group0291_Reg07                  ; // 07  (ADDR : 0x9C00_919C)
    UINT32  RGST_Group0291_Reg08                  ; // 08  (ADDR : 0x9C00_91A0)
    UINT32  RGST_Group0291_Reg09                  ; // 09  (ADDR : 0x9C00_91A4)
    UINT32  RGST_Group0291_Reg10                  ; // 10  (ADDR : 0x9C00_91A8)
    UINT32  RGST_Group0291_Reg11                  ; // 11  (ADDR : 0x9C00_91AC)
    UINT32  RGST_Group0291_Reg12                  ; // 12  (ADDR : 0x9C00_91B0)
    UINT32  RGST_Group0291_Reg13                  ; // 13  (ADDR : 0x9C00_91B4)
    UINT32  RGST_Group0291_Reg14                  ; // 14  (ADDR : 0x9C00_91B8)
    UINT32  RGST_Group0291_Reg15                  ; // 15  (ADDR : 0x9C00_91BC)
    UINT32  RGST_Group0291_Reg16                  ; // 16  (ADDR : 0x9C00_91C0)
    UINT32  RGST_Group0291_Reg17                  ; // 17  (ADDR : 0x9C00_91C4)
    UINT32  RGST_Group0291_Reg18                  ; // 18  (ADDR : 0x9C00_91C8)
    UINT32  RGST_Group0291_Reg19                  ; // 19  (ADDR : 0x9C00_91CC)
    UINT32  RGST_Group0291_Reg20                  ; // 20  (ADDR : 0x9C00_91D0)
    UINT32  RGST_Group0291_Reg21                  ; // 21  (ADDR : 0x9C00_91D4)
    UINT32  RGST_Group0291_Reg22                  ; // 22  (ADDR : 0x9C00_91D8)
    UINT32  RGST_Group0291_Reg23                  ; // 23  (ADDR : 0x9C00_91DC)
    UINT32  RGST_Group0291_Reg24                  ; // 24  (ADDR : 0x9C00_91E0)
    UINT32  RGST_Group0291_Reg25                  ; // 25  (ADDR : 0x9C00_91E4)
    UINT32  RGST_Group0291_Reg26                  ; // 26  (ADDR : 0x9C00_91E8)
    UINT32  RGST_Group0291_Reg27                  ; // 27  (ADDR : 0x9C00_91EC)
    UINT32  RGST_Group0291_Reg28                  ; // 28  (ADDR : 0x9C00_91F0)
    UINT32  RGST_Group0291_Reg29                  ; // 29  (ADDR : 0x9C00_91F4)
    UINT32  RGST_Group0291_Reg30                  ; // 30  (ADDR : 0x9C00_91F8)
    UINT32  RGST_Group0291_Reg31                  ; // 31  (ADDR : 0x9C00_91FC)

    //Group   292 : TNR0
    UINT32  RGST_Group0292_Reg00                  ; // 00  (ADDR : 0x9C00_9200)
    UINT32  RGST_Group0292_Reg01                  ; // 01  (ADDR : 0x9C00_9204)
    UINT32  RGST_Group0292_Reg02                  ; // 02  (ADDR : 0x9C00_9208)
    UINT32  RGST_Group0292_Reg03                  ; // 03  (ADDR : 0x9C00_920C)
    UINT32  RGST_Group0292_Reg04                  ; // 04  (ADDR : 0x9C00_9210)
    UINT32  RGST_Group0292_Reg05                  ; // 05  (ADDR : 0x9C00_9214)
    UINT32  RGST_Group0292_Reg06                  ; // 06  (ADDR : 0x9C00_9218)
    UINT32  RGST_Group0292_Reg07                  ; // 07  (ADDR : 0x9C00_921C)
    UINT32  RGST_Group0292_Reg08                  ; // 08  (ADDR : 0x9C00_9220)
    UINT32  RGST_Group0292_Reg09                  ; // 09  (ADDR : 0x9C00_9224)
    UINT32  RGST_Group0292_Reg10                  ; // 10  (ADDR : 0x9C00_9228)
    UINT32  RGST_Group0292_Reg11                  ; // 11  (ADDR : 0x9C00_922C)
    UINT32  RGST_Group0292_Reg12                  ; // 12  (ADDR : 0x9C00_9230)
    UINT32  RGST_Group0292_Reg13                  ; // 13  (ADDR : 0x9C00_9234)
    UINT32  RGST_Group0292_Reg14                  ; // 14  (ADDR : 0x9C00_9238)
    UINT32  RGST_Group0292_Reg15                  ; // 15  (ADDR : 0x9C00_923C)
    UINT32  RGST_Group0292_Reg16                  ; // 16  (ADDR : 0x9C00_9240)
    UINT32  RGST_Group0292_Reg17                  ; // 17  (ADDR : 0x9C00_9244)
    UINT32  RGST_Group0292_Reg18                  ; // 18  (ADDR : 0x9C00_9248)
    UINT32  RGST_Group0292_Reg19                  ; // 19  (ADDR : 0x9C00_924C)
    UINT32  RGST_Group0292_Reg20                  ; // 20  (ADDR : 0x9C00_9250)
    UINT32  RGST_Group0292_Reg21                  ; // 21  (ADDR : 0x9C00_9254)
    UINT32  RGST_Group0292_Reg22                  ; // 22  (ADDR : 0x9C00_9258)
    UINT32  RGST_Group0292_Reg23                  ; // 23  (ADDR : 0x9C00_925C)
    UINT32  RGST_Group0292_Reg24                  ; // 24  (ADDR : 0x9C00_9260)
    UINT32  RGST_Group0292_Reg25                  ; // 25  (ADDR : 0x9C00_9264)
    UINT32  RGST_Group0292_Reg26                  ; // 26  (ADDR : 0x9C00_9268)
    UINT32  RGST_Group0292_Reg27                  ; // 27  (ADDR : 0x9C00_926C)
    UINT32  RGST_Group0292_Reg28                  ; // 28  (ADDR : 0x9C00_9270)
    UINT32  RGST_Group0292_Reg29                  ; // 29  (ADDR : 0x9C00_9274)
    UINT32  RGST_Group0292_Reg30                  ; // 30  (ADDR : 0x9C00_9278)
    UINT32  RGST_Group0292_Reg31                  ; // 31  (ADDR : 0x9C00_927C)

    //Group   293 : TNR1
    UINT32  RGST_Group0293_Reg00                  ; // 00  (ADDR : 0x9C00_9280)
    UINT32  RGST_Group0293_Reg01                  ; // 01  (ADDR : 0x9C00_9284)
    UINT32  RGST_Group0293_Reg02                  ; // 02  (ADDR : 0x9C00_9288)
    UINT32  RGST_Group0293_Reg03                  ; // 03  (ADDR : 0x9C00_928C)
    UINT32  RGST_Group0293_Reg04                  ; // 04  (ADDR : 0x9C00_9290)
    UINT32  RGST_Group0293_Reg05                  ; // 05  (ADDR : 0x9C00_9294)
    UINT32  RGST_Group0293_Reg06                  ; // 06  (ADDR : 0x9C00_9298)
    UINT32  RGST_Group0293_Reg07                  ; // 07  (ADDR : 0x9C00_929C)
    UINT32  RGST_Group0293_Reg08                  ; // 08  (ADDR : 0x9C00_92A0)
    UINT32  RGST_Group0293_Reg09                  ; // 09  (ADDR : 0x9C00_92A4)
    UINT32  RGST_Group0293_Reg10                  ; // 10  (ADDR : 0x9C00_92A8)
    UINT32  RGST_Group0293_Reg11                  ; // 11  (ADDR : 0x9C00_92AC)
    UINT32  RGST_Group0293_Reg12                  ; // 12  (ADDR : 0x9C00_92B0)
    UINT32  RGST_Group0293_Reg13                  ; // 13  (ADDR : 0x9C00_92B4)
    UINT32  RGST_Group0293_Reg14                  ; // 14  (ADDR : 0x9C00_92B8)
    UINT32  RGST_Group0293_Reg15                  ; // 15  (ADDR : 0x9C00_92BC)
    UINT32  RGST_Group0293_Reg16                  ; // 16  (ADDR : 0x9C00_92C0)
    UINT32  RGST_Group0293_Reg17                  ; // 17  (ADDR : 0x9C00_92C4)
    UINT32  RGST_Group0293_Reg18                  ; // 18  (ADDR : 0x9C00_92C8)
    UINT32  RGST_Group0293_Reg19                  ; // 19  (ADDR : 0x9C00_92CC)
    UINT32  RGST_Group0293_Reg20                  ; // 20  (ADDR : 0x9C00_92D0)
    UINT32  RGST_Group0293_Reg21                  ; // 21  (ADDR : 0x9C00_92D4)
    UINT32  RGST_Group0293_Reg22                  ; // 22  (ADDR : 0x9C00_92D8)
    UINT32  RGST_Group0293_Reg23                  ; // 23  (ADDR : 0x9C00_92DC)
    UINT32  RGST_Group0293_Reg24                  ; // 24  (ADDR : 0x9C00_92E0)
    UINT32  RGST_Group0293_Reg25                  ; // 25  (ADDR : 0x9C00_92E4)
    UINT32  RGST_Group0293_Reg26                  ; // 26  (ADDR : 0x9C00_92E8)
    UINT32  RGST_Group0293_Reg27                  ; // 27  (ADDR : 0x9C00_92EC)
    UINT32  RGST_Group0293_Reg28                  ; // 28  (ADDR : 0x9C00_92F0)
    UINT32  RGST_Group0293_Reg29                  ; // 29  (ADDR : 0x9C00_92F4)
    UINT32  RGST_Group0293_Reg30                  ; // 30  (ADDR : 0x9C00_92F8)
    UINT32  RGST_Group0293_Reg31                  ; // 31  (ADDR : 0x9C00_92FC)

    //Group   294 : TNR1
    UINT32  RGST_Group0294_Reg00                  ; // 00  (ADDR : 0x9C00_9300)
    UINT32  RGST_Group0294_Reg01                  ; // 01  (ADDR : 0x9C00_9304)
    UINT32  RGST_Group0294_Reg02                  ; // 02  (ADDR : 0x9C00_9308)
    UINT32  RGST_Group0294_Reg03                  ; // 03  (ADDR : 0x9C00_930C)
    UINT32  RGST_Group0294_Reg04                  ; // 04  (ADDR : 0x9C00_9310)
    UINT32  RGST_Group0294_Reg05                  ; // 05  (ADDR : 0x9C00_9314)
    UINT32  RGST_Group0294_Reg06                  ; // 06  (ADDR : 0x9C00_9318)
    UINT32  RGST_Group0294_Reg07                  ; // 07  (ADDR : 0x9C00_931C)
    UINT32  RGST_Group0294_Reg08                  ; // 08  (ADDR : 0x9C00_9320)
    UINT32  RGST_Group0294_Reg09                  ; // 09  (ADDR : 0x9C00_9324)
    UINT32  RGST_Group0294_Reg10                  ; // 10  (ADDR : 0x9C00_9328)
    UINT32  RGST_Group0294_Reg11                  ; // 11  (ADDR : 0x9C00_932C)
    UINT32  RGST_Group0294_Reg12                  ; // 12  (ADDR : 0x9C00_9330)
    UINT32  RGST_Group0294_Reg13                  ; // 13  (ADDR : 0x9C00_9334)
    UINT32  RGST_Group0294_Reg14                  ; // 14  (ADDR : 0x9C00_9338)
    UINT32  RGST_Group0294_Reg15                  ; // 15  (ADDR : 0x9C00_933C)
    UINT32  RGST_Group0294_Reg16                  ; // 16  (ADDR : 0x9C00_9340)
    UINT32  RGST_Group0294_Reg17                  ; // 17  (ADDR : 0x9C00_9344)
    UINT32  RGST_Group0294_Reg18                  ; // 18  (ADDR : 0x9C00_9348)
    UINT32  RGST_Group0294_Reg19                  ; // 19  (ADDR : 0x9C00_934C)
    UINT32  RGST_Group0294_Reg20                  ; // 20  (ADDR : 0x9C00_9350)
    UINT32  RGST_Group0294_Reg21                  ; // 21  (ADDR : 0x9C00_9354)
    UINT32  RGST_Group0294_Reg22                  ; // 22  (ADDR : 0x9C00_9358)
    UINT32  RGST_Group0294_Reg23                  ; // 23  (ADDR : 0x9C00_935C)
    UINT32  RGST_Group0294_Reg24                  ; // 24  (ADDR : 0x9C00_9360)
    UINT32  RGST_Group0294_Reg25                  ; // 25  (ADDR : 0x9C00_9364)
    UINT32  RGST_Group0294_Reg26                  ; // 26  (ADDR : 0x9C00_9368)
    UINT32  RGST_Group0294_Reg27                  ; // 27  (ADDR : 0x9C00_936C)
    UINT32  RGST_Group0294_Reg28                  ; // 28  (ADDR : 0x9C00_9370)
    UINT32  RGST_Group0294_Reg29                  ; // 29  (ADDR : 0x9C00_9374)
    UINT32  RGST_Group0294_Reg30                  ; // 30  (ADDR : 0x9C00_9378)
    UINT32  RGST_Group0294_Reg31                  ; // 31  (ADDR : 0x9C00_937C)

    //Group   295 : TNRIW0
    UINT32  RGST_Group0295_Reg00                  ; // 00  (ADDR : 0x9C00_9380)
    UINT32  RGST_Group0295_Reg01                  ; // 01  (ADDR : 0x9C00_9384)
    UINT32  RGST_Group0295_Reg02                  ; // 02  (ADDR : 0x9C00_9388)
    UINT32  RGST_Group0295_Reg03                  ; // 03  (ADDR : 0x9C00_938C)
    UINT32  RGST_Group0295_Reg04                  ; // 04  (ADDR : 0x9C00_9390)
    UINT32  RGST_Group0295_Reg05                  ; // 05  (ADDR : 0x9C00_9394)
    UINT32  RGST_Group0295_Reg06                  ; // 06  (ADDR : 0x9C00_9398)
    UINT32  RGST_Group0295_Reg07                  ; // 07  (ADDR : 0x9C00_939C)
    UINT32  RGST_Group0295_Reg08                  ; // 08  (ADDR : 0x9C00_93A0)
    UINT32  RGST_Group0295_Reg09                  ; // 09  (ADDR : 0x9C00_93A4)
    UINT32  RGST_Group0295_Reg10                  ; // 10  (ADDR : 0x9C00_93A8)
    UINT32  RGST_Group0295_Reg11                  ; // 11  (ADDR : 0x9C00_93AC)
    UINT32  RGST_Group0295_Reg12                  ; // 12  (ADDR : 0x9C00_93B0)
    UINT32  RGST_Group0295_Reg13                  ; // 13  (ADDR : 0x9C00_93B4)
    UINT32  RGST_Group0295_Reg14                  ; // 14  (ADDR : 0x9C00_93B8)
    UINT32  RGST_Group0295_Reg15                  ; // 15  (ADDR : 0x9C00_93BC)
    UINT32  RGST_Group0295_Reg16                  ; // 16  (ADDR : 0x9C00_93C0)
    UINT32  RGST_Group0295_Reg17                  ; // 17  (ADDR : 0x9C00_93C4)
    UINT32  RGST_Group0295_Reg18                  ; // 18  (ADDR : 0x9C00_93C8)
    UINT32  RGST_Group0295_Reg19                  ; // 19  (ADDR : 0x9C00_93CC)
    UINT32  RGST_Group0295_Reg20                  ; // 20  (ADDR : 0x9C00_93D0)
    UINT32  RGST_Group0295_Reg21                  ; // 21  (ADDR : 0x9C00_93D4)
    UINT32  RGST_Group0295_Reg22                  ; // 22  (ADDR : 0x9C00_93D8)
    UINT32  RGST_Group0295_Reg23                  ; // 23  (ADDR : 0x9C00_93DC)
    UINT32  RGST_Group0295_Reg24                  ; // 24  (ADDR : 0x9C00_93E0)
    UINT32  RGST_Group0295_Reg25                  ; // 25  (ADDR : 0x9C00_93E4)
    UINT32  RGST_Group0295_Reg26                  ; // 26  (ADDR : 0x9C00_93E8)
    UINT32  RGST_Group0295_Reg27                  ; // 27  (ADDR : 0x9C00_93EC)
    UINT32  RGST_Group0295_Reg28                  ; // 28  (ADDR : 0x9C00_93F0)
    UINT32  RGST_Group0295_Reg29                  ; // 29  (ADDR : 0x9C00_93F4)
    UINT32  RGST_Group0295_Reg30                  ; // 30  (ADDR : 0x9C00_93F8)
    UINT32  RGST_Group0295_Reg31                  ; // 31  (ADDR : 0x9C00_93FC)

    //Group   296 : TNRIW1
    UINT32  RGST_Group0296_Reg00                  ; // 00  (ADDR : 0x9C00_9400)
    UINT32  RGST_Group0296_Reg01                  ; // 01  (ADDR : 0x9C00_9404)
    UINT32  RGST_Group0296_Reg02                  ; // 02  (ADDR : 0x9C00_9408)
    UINT32  RGST_Group0296_Reg03                  ; // 03  (ADDR : 0x9C00_940C)
    UINT32  RGST_Group0296_Reg04                  ; // 04  (ADDR : 0x9C00_9410)
    UINT32  RGST_Group0296_Reg05                  ; // 05  (ADDR : 0x9C00_9414)
    UINT32  RGST_Group0296_Reg06                  ; // 06  (ADDR : 0x9C00_9418)
    UINT32  RGST_Group0296_Reg07                  ; // 07  (ADDR : 0x9C00_941C)
    UINT32  RGST_Group0296_Reg08                  ; // 08  (ADDR : 0x9C00_9420)
    UINT32  RGST_Group0296_Reg09                  ; // 09  (ADDR : 0x9C00_9424)
    UINT32  RGST_Group0296_Reg10                  ; // 10  (ADDR : 0x9C00_9428)
    UINT32  RGST_Group0296_Reg11                  ; // 11  (ADDR : 0x9C00_942C)
    UINT32  RGST_Group0296_Reg12                  ; // 12  (ADDR : 0x9C00_9430)
    UINT32  RGST_Group0296_Reg13                  ; // 13  (ADDR : 0x9C00_9434)
    UINT32  RGST_Group0296_Reg14                  ; // 14  (ADDR : 0x9C00_9438)
    UINT32  RGST_Group0296_Reg15                  ; // 15  (ADDR : 0x9C00_943C)
    UINT32  RGST_Group0296_Reg16                  ; // 16  (ADDR : 0x9C00_9440)
    UINT32  RGST_Group0296_Reg17                  ; // 17  (ADDR : 0x9C00_9444)
    UINT32  RGST_Group0296_Reg18                  ; // 18  (ADDR : 0x9C00_9448)
    UINT32  RGST_Group0296_Reg19                  ; // 19  (ADDR : 0x9C00_944C)
    UINT32  RGST_Group0296_Reg20                  ; // 20  (ADDR : 0x9C00_9450)
    UINT32  RGST_Group0296_Reg21                  ; // 21  (ADDR : 0x9C00_9454)
    UINT32  RGST_Group0296_Reg22                  ; // 22  (ADDR : 0x9C00_9458)
    UINT32  RGST_Group0296_Reg23                  ; // 23  (ADDR : 0x9C00_945C)
    UINT32  RGST_Group0296_Reg24                  ; // 24  (ADDR : 0x9C00_9460)
    UINT32  RGST_Group0296_Reg25                  ; // 25  (ADDR : 0x9C00_9464)
    UINT32  RGST_Group0296_Reg26                  ; // 26  (ADDR : 0x9C00_9468)
    UINT32  RGST_Group0296_Reg27                  ; // 27  (ADDR : 0x9C00_946C)
    UINT32  RGST_Group0296_Reg28                  ; // 28  (ADDR : 0x9C00_9470)
    UINT32  RGST_Group0296_Reg29                  ; // 29  (ADDR : 0x9C00_9474)
    UINT32  RGST_Group0296_Reg30                  ; // 30  (ADDR : 0x9C00_9478)
    UINT32  RGST_Group0296_Reg31                  ; // 31  (ADDR : 0x9C00_947C)

    //Group   297 : VSCL0
    UINT32  RGST_Group0297_Reg00                  ; // 00  (ADDR : 0x9C00_9480)
    UINT32  RGST_Group0297_Reg01                  ; // 01  (ADDR : 0x9C00_9484)
    UINT32  RGST_Group0297_Reg02                  ; // 02  (ADDR : 0x9C00_9488)
    UINT32  RGST_Group0297_Reg03                  ; // 03  (ADDR : 0x9C00_948C)
    UINT32  RGST_Group0297_Reg04                  ; // 04  (ADDR : 0x9C00_9490)
    UINT32  RGST_Group0297_Reg05                  ; // 05  (ADDR : 0x9C00_9494)
    UINT32  RGST_Group0297_Reg06                  ; // 06  (ADDR : 0x9C00_9498)
    UINT32  RGST_Group0297_Reg07                  ; // 07  (ADDR : 0x9C00_949C)
    UINT32  RGST_Group0297_Reg08                  ; // 08  (ADDR : 0x9C00_94A0)
    UINT32  RGST_Group0297_Reg09                  ; // 09  (ADDR : 0x9C00_94A4)
    UINT32  RGST_Group0297_Reg10                  ; // 10  (ADDR : 0x9C00_94A8)
    UINT32  RGST_Group0297_Reg11                  ; // 11  (ADDR : 0x9C00_94AC)
    UINT32  RGST_Group0297_Reg12                  ; // 12  (ADDR : 0x9C00_94B0)
    UINT32  RGST_Group0297_Reg13                  ; // 13  (ADDR : 0x9C00_94B4)
    UINT32  RGST_Group0297_Reg14                  ; // 14  (ADDR : 0x9C00_94B8)
    UINT32  RGST_Group0297_Reg15                  ; // 15  (ADDR : 0x9C00_94BC)
    UINT32  RGST_Group0297_Reg16                  ; // 16  (ADDR : 0x9C00_94C0)
    UINT32  RGST_Group0297_Reg17                  ; // 17  (ADDR : 0x9C00_94C4)
    UINT32  RGST_Group0297_Reg18                  ; // 18  (ADDR : 0x9C00_94C8)
    UINT32  RGST_Group0297_Reg19                  ; // 19  (ADDR : 0x9C00_94CC)
    UINT32  RGST_Group0297_Reg20                  ; // 20  (ADDR : 0x9C00_94D0)
    UINT32  RGST_Group0297_Reg21                  ; // 21  (ADDR : 0x9C00_94D4)
    UINT32  RGST_Group0297_Reg22                  ; // 22  (ADDR : 0x9C00_94D8)
    UINT32  RGST_Group0297_Reg23                  ; // 23  (ADDR : 0x9C00_94DC)
    UINT32  RGST_Group0297_Reg24                  ; // 24  (ADDR : 0x9C00_94E0)
    UINT32  RGST_Group0297_Reg25                  ; // 25  (ADDR : 0x9C00_94E4)
    UINT32  RGST_Group0297_Reg26                  ; // 26  (ADDR : 0x9C00_94E8)
    UINT32  RGST_Group0297_Reg27                  ; // 27  (ADDR : 0x9C00_94EC)
    UINT32  RGST_Group0297_Reg28                  ; // 28  (ADDR : 0x9C00_94F0)
    UINT32  RGST_Group0297_Reg29                  ; // 29  (ADDR : 0x9C00_94F4)
    UINT32  RGST_Group0297_Reg30                  ; // 30  (ADDR : 0x9C00_94F8)
    UINT32  RGST_Group0297_Reg31                  ; // 31  (ADDR : 0x9C00_94FC)

    //Group   298 : IMG0
    UINT32  RGST_Group0298_Reg00                  ; // 00  (ADDR : 0x9C00_9500)
    UINT32  RGST_Group0298_Reg01                  ; // 01  (ADDR : 0x9C00_9504)
    UINT32  RGST_Group0298_Reg02                  ; // 02  (ADDR : 0x9C00_9508)
    UINT32  RGST_Group0298_Reg03                  ; // 03  (ADDR : 0x9C00_950C)
    UINT32  RGST_Group0298_Reg04                  ; // 04  (ADDR : 0x9C00_9510)
    UINT32  RGST_Group0298_Reg05                  ; // 05  (ADDR : 0x9C00_9514)
    UINT32  RGST_Group0298_Reg06                  ; // 06  (ADDR : 0x9C00_9518)
    UINT32  RGST_Group0298_Reg07                  ; // 07  (ADDR : 0x9C00_951C)
    UINT32  RGST_Group0298_Reg08                  ; // 08  (ADDR : 0x9C00_9520)
    UINT32  RGST_Group0298_Reg09                  ; // 09  (ADDR : 0x9C00_9524)
    UINT32  RGST_Group0298_Reg10                  ; // 10  (ADDR : 0x9C00_9528)
    UINT32  RGST_Group0298_Reg11                  ; // 11  (ADDR : 0x9C00_952C)
    UINT32  RGST_Group0298_Reg12                  ; // 12  (ADDR : 0x9C00_9530)
    UINT32  RGST_Group0298_Reg13                  ; // 13  (ADDR : 0x9C00_9534)
    UINT32  RGST_Group0298_Reg14                  ; // 14  (ADDR : 0x9C00_9538)
    UINT32  RGST_Group0298_Reg15                  ; // 15  (ADDR : 0x9C00_953C)
    UINT32  RGST_Group0298_Reg16                  ; // 16  (ADDR : 0x9C00_9540)
    UINT32  RGST_Group0298_Reg17                  ; // 17  (ADDR : 0x9C00_9544)
    UINT32  RGST_Group0298_Reg18                  ; // 18  (ADDR : 0x9C00_9548)
    UINT32  RGST_Group0298_Reg19                  ; // 19  (ADDR : 0x9C00_954C)
    UINT32  RGST_Group0298_Reg20                  ; // 20  (ADDR : 0x9C00_9550)
    UINT32  RGST_Group0298_Reg21                  ; // 21  (ADDR : 0x9C00_9554)
    UINT32  RGST_Group0298_Reg22                  ; // 22  (ADDR : 0x9C00_9558)
    UINT32  RGST_Group0298_Reg23                  ; // 23  (ADDR : 0x9C00_955C)
    UINT32  RGST_Group0298_Reg24                  ; // 24  (ADDR : 0x9C00_9560)
    UINT32  RGST_Group0298_Reg25                  ; // 25  (ADDR : 0x9C00_9564)
    UINT32  RGST_Group0298_Reg26                  ; // 26  (ADDR : 0x9C00_9568)
    UINT32  RGST_Group0298_Reg27                  ; // 27  (ADDR : 0x9C00_956C)
    UINT32  RGST_Group0298_Reg28                  ; // 28  (ADDR : 0x9C00_9570)
    UINT32  RGST_Group0298_Reg29                  ; // 29  (ADDR : 0x9C00_9574)
    UINT32  RGST_Group0298_Reg30                  ; // 30  (ADDR : 0x9C00_9578)
    UINT32  RGST_Group0298_Reg31                  ; // 31  (ADDR : 0x9C00_957C)

    //Group   299 : VSCL1
    UINT32  RGST_Group0299_Reg00                  ; // 00  (ADDR : 0x9C00_9580)
    UINT32  RGST_Group0299_Reg01                  ; // 01  (ADDR : 0x9C00_9584)
    UINT32  RGST_Group0299_Reg02                  ; // 02  (ADDR : 0x9C00_9588)
    UINT32  RGST_Group0299_Reg03                  ; // 03  (ADDR : 0x9C00_958C)
    UINT32  RGST_Group0299_Reg04                  ; // 04  (ADDR : 0x9C00_9590)
    UINT32  RGST_Group0299_Reg05                  ; // 05  (ADDR : 0x9C00_9594)
    UINT32  RGST_Group0299_Reg06                  ; // 06  (ADDR : 0x9C00_9598)
    UINT32  RGST_Group0299_Reg07                  ; // 07  (ADDR : 0x9C00_959C)
    UINT32  RGST_Group0299_Reg08                  ; // 08  (ADDR : 0x9C00_95A0)
    UINT32  RGST_Group0299_Reg09                  ; // 09  (ADDR : 0x9C00_95A4)
    UINT32  RGST_Group0299_Reg10                  ; // 10  (ADDR : 0x9C00_95A8)
    UINT32  RGST_Group0299_Reg11                  ; // 11  (ADDR : 0x9C00_95AC)
    UINT32  RGST_Group0299_Reg12                  ; // 12  (ADDR : 0x9C00_95B0)
    UINT32  RGST_Group0299_Reg13                  ; // 13  (ADDR : 0x9C00_95B4)
    UINT32  RGST_Group0299_Reg14                  ; // 14  (ADDR : 0x9C00_95B8)
    UINT32  RGST_Group0299_Reg15                  ; // 15  (ADDR : 0x9C00_95BC)
    UINT32  RGST_Group0299_Reg16                  ; // 16  (ADDR : 0x9C00_95C0)
    UINT32  RGST_Group0299_Reg17                  ; // 17  (ADDR : 0x9C00_95C4)
    UINT32  RGST_Group0299_Reg18                  ; // 18  (ADDR : 0x9C00_95C8)
    UINT32  RGST_Group0299_Reg19                  ; // 19  (ADDR : 0x9C00_95CC)
    UINT32  RGST_Group0299_Reg20                  ; // 20  (ADDR : 0x9C00_95D0)
    UINT32  RGST_Group0299_Reg21                  ; // 21  (ADDR : 0x9C00_95D4)
    UINT32  RGST_Group0299_Reg22                  ; // 22  (ADDR : 0x9C00_95D8)
    UINT32  RGST_Group0299_Reg23                  ; // 23  (ADDR : 0x9C00_95DC)
    UINT32  RGST_Group0299_Reg24                  ; // 24  (ADDR : 0x9C00_95E0)
    UINT32  RGST_Group0299_Reg25                  ; // 25  (ADDR : 0x9C00_95E4)
    UINT32  RGST_Group0299_Reg26                  ; // 26  (ADDR : 0x9C00_95E8)
    UINT32  RGST_Group0299_Reg27                  ; // 27  (ADDR : 0x9C00_95EC)
    UINT32  RGST_Group0299_Reg28                  ; // 28  (ADDR : 0x9C00_95F0)
    UINT32  RGST_Group0299_Reg29                  ; // 29  (ADDR : 0x9C00_95F4)
    UINT32  RGST_Group0299_Reg30                  ; // 30  (ADDR : 0x9C00_95F8)
    UINT32  RGST_Group0299_Reg31                  ; // 31  (ADDR : 0x9C00_95FC)

    //Group   300 : IMG1
    UINT32  RGST_Group0300_Reg00                  ; // 00  (ADDR : 0x9C00_9600)
    UINT32  RGST_Group0300_Reg01                  ; // 01  (ADDR : 0x9C00_9604)
    UINT32  RGST_Group0300_Reg02                  ; // 02  (ADDR : 0x9C00_9608)
    UINT32  RGST_Group0300_Reg03                  ; // 03  (ADDR : 0x9C00_960C)
    UINT32  RGST_Group0300_Reg04                  ; // 04  (ADDR : 0x9C00_9610)
    UINT32  RGST_Group0300_Reg05                  ; // 05  (ADDR : 0x9C00_9614)
    UINT32  RGST_Group0300_Reg06                  ; // 06  (ADDR : 0x9C00_9618)
    UINT32  RGST_Group0300_Reg07                  ; // 07  (ADDR : 0x9C00_961C)
    UINT32  RGST_Group0300_Reg08                  ; // 08  (ADDR : 0x9C00_9620)
    UINT32  RGST_Group0300_Reg09                  ; // 09  (ADDR : 0x9C00_9624)
    UINT32  RGST_Group0300_Reg10                  ; // 10  (ADDR : 0x9C00_9628)
    UINT32  RGST_Group0300_Reg11                  ; // 11  (ADDR : 0x9C00_962C)
    UINT32  RGST_Group0300_Reg12                  ; // 12  (ADDR : 0x9C00_9630)
    UINT32  RGST_Group0300_Reg13                  ; // 13  (ADDR : 0x9C00_9634)
    UINT32  RGST_Group0300_Reg14                  ; // 14  (ADDR : 0x9C00_9638)
    UINT32  RGST_Group0300_Reg15                  ; // 15  (ADDR : 0x9C00_963C)
    UINT32  RGST_Group0300_Reg16                  ; // 16  (ADDR : 0x9C00_9640)
    UINT32  RGST_Group0300_Reg17                  ; // 17  (ADDR : 0x9C00_9644)
    UINT32  RGST_Group0300_Reg18                  ; // 18  (ADDR : 0x9C00_9648)
    UINT32  RGST_Group0300_Reg19                  ; // 19  (ADDR : 0x9C00_964C)
    UINT32  RGST_Group0300_Reg20                  ; // 20  (ADDR : 0x9C00_9650)
    UINT32  RGST_Group0300_Reg21                  ; // 21  (ADDR : 0x9C00_9654)
    UINT32  RGST_Group0300_Reg22                  ; // 22  (ADDR : 0x9C00_9658)
    UINT32  RGST_Group0300_Reg23                  ; // 23  (ADDR : 0x9C00_965C)
    UINT32  RGST_Group0300_Reg24                  ; // 24  (ADDR : 0x9C00_9660)
    UINT32  RGST_Group0300_Reg25                  ; // 25  (ADDR : 0x9C00_9664)
    UINT32  RGST_Group0300_Reg26                  ; // 26  (ADDR : 0x9C00_9668)
    UINT32  RGST_Group0300_Reg27                  ; // 27  (ADDR : 0x9C00_966C)
    UINT32  RGST_Group0300_Reg28                  ; // 28  (ADDR : 0x9C00_9670)
    UINT32  RGST_Group0300_Reg29                  ; // 29  (ADDR : 0x9C00_9674)
    UINT32  RGST_Group0300_Reg30                  ; // 30  (ADDR : 0x9C00_9678)
    UINT32  RGST_Group0300_Reg31                  ; // 31  (ADDR : 0x9C00_967C)

    //Group   301 : IMG0
    UINT32  RGST_Group0301_Reg00                  ; // 00  (ADDR : 0x9C00_9680)
    UINT32  RGST_Group0301_Reg01                  ; // 01  (ADDR : 0x9C00_9684)
    UINT32  RGST_Group0301_Reg02                  ; // 02  (ADDR : 0x9C00_9688)
    UINT32  RGST_Group0301_Reg03                  ; // 03  (ADDR : 0x9C00_968C)
    UINT32  RGST_Group0301_Reg04                  ; // 04  (ADDR : 0x9C00_9690)
    UINT32  RGST_Group0301_Reg05                  ; // 05  (ADDR : 0x9C00_9694)
    UINT32  RGST_Group0301_Reg06                  ; // 06  (ADDR : 0x9C00_9698)
    UINT32  RGST_Group0301_Reg07                  ; // 07  (ADDR : 0x9C00_969C)
    UINT32  RGST_Group0301_Reg08                  ; // 08  (ADDR : 0x9C00_96A0)
    UINT32  RGST_Group0301_Reg09                  ; // 09  (ADDR : 0x9C00_96A4)
    UINT32  RGST_Group0301_Reg10                  ; // 10  (ADDR : 0x9C00_96A8)
    UINT32  RGST_Group0301_Reg11                  ; // 11  (ADDR : 0x9C00_96AC)
    UINT32  RGST_Group0301_Reg12                  ; // 12  (ADDR : 0x9C00_96B0)
    UINT32  RGST_Group0301_Reg13                  ; // 13  (ADDR : 0x9C00_96B4)
    UINT32  RGST_Group0301_Reg14                  ; // 14  (ADDR : 0x9C00_96B8)
    UINT32  RGST_Group0301_Reg15                  ; // 15  (ADDR : 0x9C00_96BC)
    UINT32  RGST_Group0301_Reg16                  ; // 16  (ADDR : 0x9C00_96C0)
    UINT32  RGST_Group0301_Reg17                  ; // 17  (ADDR : 0x9C00_96C4)
    UINT32  RGST_Group0301_Reg18                  ; // 18  (ADDR : 0x9C00_96C8)
    UINT32  RGST_Group0301_Reg19                  ; // 19  (ADDR : 0x9C00_96CC)
    UINT32  RGST_Group0301_Reg20                  ; // 20  (ADDR : 0x9C00_96D0)
    UINT32  RGST_Group0301_Reg21                  ; // 21  (ADDR : 0x9C00_96D4)
    UINT32  RGST_Group0301_Reg22                  ; // 22  (ADDR : 0x9C00_96D8)
    UINT32  RGST_Group0301_Reg23                  ; // 23  (ADDR : 0x9C00_96DC)
    UINT32  RGST_Group0301_Reg24                  ; // 24  (ADDR : 0x9C00_96E0)
    UINT32  RGST_Group0301_Reg25                  ; // 25  (ADDR : 0x9C00_96E4)
    UINT32  RGST_Group0301_Reg26                  ; // 26  (ADDR : 0x9C00_96E8)
    UINT32  RGST_Group0301_Reg27                  ; // 27  (ADDR : 0x9C00_96EC)
    UINT32  RGST_Group0301_Reg28                  ; // 28  (ADDR : 0x9C00_96F0)
    UINT32  RGST_Group0301_Reg29                  ; // 29  (ADDR : 0x9C00_96F4)
    UINT32  RGST_Group0301_Reg30                  ; // 30  (ADDR : 0x9C00_96F8)
    UINT32  RGST_Group0301_Reg31                  ; // 31  (ADDR : 0x9C00_96FC)

    //Group   302 : IMG0
    UINT32  RGST_Group0302_Reg00                  ; // 00  (ADDR : 0x9C00_9700)
    UINT32  RGST_Group0302_Reg01                  ; // 01  (ADDR : 0x9C00_9704)
    UINT32  RGST_Group0302_Reg02                  ; // 02  (ADDR : 0x9C00_9708)
    UINT32  RGST_Group0302_Reg03                  ; // 03  (ADDR : 0x9C00_970C)
    UINT32  RGST_Group0302_Reg04                  ; // 04  (ADDR : 0x9C00_9710)
    UINT32  RGST_Group0302_Reg05                  ; // 05  (ADDR : 0x9C00_9714)
    UINT32  RGST_Group0302_Reg06                  ; // 06  (ADDR : 0x9C00_9718)
    UINT32  RGST_Group0302_Reg07                  ; // 07  (ADDR : 0x9C00_971C)
    UINT32  RGST_Group0302_Reg08                  ; // 08  (ADDR : 0x9C00_9720)
    UINT32  RGST_Group0302_Reg09                  ; // 09  (ADDR : 0x9C00_9724)
    UINT32  RGST_Group0302_Reg10                  ; // 10  (ADDR : 0x9C00_9728)
    UINT32  RGST_Group0302_Reg11                  ; // 11  (ADDR : 0x9C00_972C)
    UINT32  RGST_Group0302_Reg12                  ; // 12  (ADDR : 0x9C00_9730)
    UINT32  RGST_Group0302_Reg13                  ; // 13  (ADDR : 0x9C00_9734)
    UINT32  RGST_Group0302_Reg14                  ; // 14  (ADDR : 0x9C00_9738)
    UINT32  RGST_Group0302_Reg15                  ; // 15  (ADDR : 0x9C00_973C)
    UINT32  RGST_Group0302_Reg16                  ; // 16  (ADDR : 0x9C00_9740)
    UINT32  RGST_Group0302_Reg17                  ; // 17  (ADDR : 0x9C00_9744)
    UINT32  RGST_Group0302_Reg18                  ; // 18  (ADDR : 0x9C00_9748)
    UINT32  RGST_Group0302_Reg19                  ; // 19  (ADDR : 0x9C00_974C)
    UINT32  RGST_Group0302_Reg20                  ; // 20  (ADDR : 0x9C00_9750)
    UINT32  RGST_Group0302_Reg21                  ; // 21  (ADDR : 0x9C00_9754)
    UINT32  RGST_Group0302_Reg22                  ; // 22  (ADDR : 0x9C00_9758)
    UINT32  RGST_Group0302_Reg23                  ; // 23  (ADDR : 0x9C00_975C)
    UINT32  RGST_Group0302_Reg24                  ; // 24  (ADDR : 0x9C00_9760)
    UINT32  RGST_Group0302_Reg25                  ; // 25  (ADDR : 0x9C00_9764)
    UINT32  RGST_Group0302_Reg26                  ; // 26  (ADDR : 0x9C00_9768)
    UINT32  RGST_Group0302_Reg27                  ; // 27  (ADDR : 0x9C00_976C)
    UINT32  RGST_Group0302_Reg28                  ; // 28  (ADDR : 0x9C00_9770)
    UINT32  RGST_Group0302_Reg29                  ; // 29  (ADDR : 0x9C00_9774)
    UINT32  RGST_Group0302_Reg30                  ; // 30  (ADDR : 0x9C00_9778)
    UINT32  RGST_Group0302_Reg31                  ; // 31  (ADDR : 0x9C00_977C)

    //Group   303 : IMG1
    UINT32  RGST_Group0303_Reg00                  ; // 00  (ADDR : 0x9C00_9780)
    UINT32  RGST_Group0303_Reg01                  ; // 01  (ADDR : 0x9C00_9784)
    UINT32  RGST_Group0303_Reg02                  ; // 02  (ADDR : 0x9C00_9788)
    UINT32  RGST_Group0303_Reg03                  ; // 03  (ADDR : 0x9C00_978C)
    UINT32  RGST_Group0303_Reg04                  ; // 04  (ADDR : 0x9C00_9790)
    UINT32  RGST_Group0303_Reg05                  ; // 05  (ADDR : 0x9C00_9794)
    UINT32  RGST_Group0303_Reg06                  ; // 06  (ADDR : 0x9C00_9798)
    UINT32  RGST_Group0303_Reg07                  ; // 07  (ADDR : 0x9C00_979C)
    UINT32  RGST_Group0303_Reg08                  ; // 08  (ADDR : 0x9C00_97A0)
    UINT32  RGST_Group0303_Reg09                  ; // 09  (ADDR : 0x9C00_97A4)
    UINT32  RGST_Group0303_Reg10                  ; // 10  (ADDR : 0x9C00_97A8)
    UINT32  RGST_Group0303_Reg11                  ; // 11  (ADDR : 0x9C00_97AC)
    UINT32  RGST_Group0303_Reg12                  ; // 12  (ADDR : 0x9C00_97B0)
    UINT32  RGST_Group0303_Reg13                  ; // 13  (ADDR : 0x9C00_97B4)
    UINT32  RGST_Group0303_Reg14                  ; // 14  (ADDR : 0x9C00_97B8)
    UINT32  RGST_Group0303_Reg15                  ; // 15  (ADDR : 0x9C00_97BC)
    UINT32  RGST_Group0303_Reg16                  ; // 16  (ADDR : 0x9C00_97C0)
    UINT32  RGST_Group0303_Reg17                  ; // 17  (ADDR : 0x9C00_97C4)
    UINT32  RGST_Group0303_Reg18                  ; // 18  (ADDR : 0x9C00_97C8)
    UINT32  RGST_Group0303_Reg19                  ; // 19  (ADDR : 0x9C00_97CC)
    UINT32  RGST_Group0303_Reg20                  ; // 20  (ADDR : 0x9C00_97D0)
    UINT32  RGST_Group0303_Reg21                  ; // 21  (ADDR : 0x9C00_97D4)
    UINT32  RGST_Group0303_Reg22                  ; // 22  (ADDR : 0x9C00_97D8)
    UINT32  RGST_Group0303_Reg23                  ; // 23  (ADDR : 0x9C00_97DC)
    UINT32  RGST_Group0303_Reg24                  ; // 24  (ADDR : 0x9C00_97E0)
    UINT32  RGST_Group0303_Reg25                  ; // 25  (ADDR : 0x9C00_97E4)
    UINT32  RGST_Group0303_Reg26                  ; // 26  (ADDR : 0x9C00_97E8)
    UINT32  RGST_Group0303_Reg27                  ; // 27  (ADDR : 0x9C00_97EC)
    UINT32  RGST_Group0303_Reg28                  ; // 28  (ADDR : 0x9C00_97F0)
    UINT32  RGST_Group0303_Reg29                  ; // 29  (ADDR : 0x9C00_97F4)
    UINT32  RGST_Group0303_Reg30                  ; // 30  (ADDR : 0x9C00_97F8)
    UINT32  RGST_Group0303_Reg31                  ; // 31  (ADDR : 0x9C00_97FC)

    //Group   304 : IMG1
    UINT32  RGST_Group0304_Reg00                  ; // 00  (ADDR : 0x9C00_9800)
    UINT32  RGST_Group0304_Reg01                  ; // 01  (ADDR : 0x9C00_9804)
    UINT32  RGST_Group0304_Reg02                  ; // 02  (ADDR : 0x9C00_9808)
    UINT32  RGST_Group0304_Reg03                  ; // 03  (ADDR : 0x9C00_980C)
    UINT32  RGST_Group0304_Reg04                  ; // 04  (ADDR : 0x9C00_9810)
    UINT32  RGST_Group0304_Reg05                  ; // 05  (ADDR : 0x9C00_9814)
    UINT32  RGST_Group0304_Reg06                  ; // 06  (ADDR : 0x9C00_9818)
    UINT32  RGST_Group0304_Reg07                  ; // 07  (ADDR : 0x9C00_981C)
    UINT32  RGST_Group0304_Reg08                  ; // 08  (ADDR : 0x9C00_9820)
    UINT32  RGST_Group0304_Reg09                  ; // 09  (ADDR : 0x9C00_9824)
    UINT32  RGST_Group0304_Reg10                  ; // 10  (ADDR : 0x9C00_9828)
    UINT32  RGST_Group0304_Reg11                  ; // 11  (ADDR : 0x9C00_982C)
    UINT32  RGST_Group0304_Reg12                  ; // 12  (ADDR : 0x9C00_9830)
    UINT32  RGST_Group0304_Reg13                  ; // 13  (ADDR : 0x9C00_9834)
    UINT32  RGST_Group0304_Reg14                  ; // 14  (ADDR : 0x9C00_9838)
    UINT32  RGST_Group0304_Reg15                  ; // 15  (ADDR : 0x9C00_983C)
    UINT32  RGST_Group0304_Reg16                  ; // 16  (ADDR : 0x9C00_9840)
    UINT32  RGST_Group0304_Reg17                  ; // 17  (ADDR : 0x9C00_9844)
    UINT32  RGST_Group0304_Reg18                  ; // 18  (ADDR : 0x9C00_9848)
    UINT32  RGST_Group0304_Reg19                  ; // 19  (ADDR : 0x9C00_984C)
    UINT32  RGST_Group0304_Reg20                  ; // 20  (ADDR : 0x9C00_9850)
    UINT32  RGST_Group0304_Reg21                  ; // 21  (ADDR : 0x9C00_9854)
    UINT32  RGST_Group0304_Reg22                  ; // 22  (ADDR : 0x9C00_9858)
    UINT32  RGST_Group0304_Reg23                  ; // 23  (ADDR : 0x9C00_985C)
    UINT32  RGST_Group0304_Reg24                  ; // 24  (ADDR : 0x9C00_9860)
    UINT32  RGST_Group0304_Reg25                  ; // 25  (ADDR : 0x9C00_9864)
    UINT32  RGST_Group0304_Reg26                  ; // 26  (ADDR : 0x9C00_9868)
    UINT32  RGST_Group0304_Reg27                  ; // 27  (ADDR : 0x9C00_986C)
    UINT32  RGST_Group0304_Reg28                  ; // 28  (ADDR : 0x9C00_9870)
    UINT32  RGST_Group0304_Reg29                  ; // 29  (ADDR : 0x9C00_9874)
    UINT32  RGST_Group0304_Reg30                  ; // 30  (ADDR : 0x9C00_9878)
    UINT32  RGST_Group0304_Reg31                  ; // 31  (ADDR : 0x9C00_987C)

    //Group   305 : IMG0
    UINT32  RGST_Group0305_Reg00                  ; // 00  (ADDR : 0x9C00_9880)
    UINT32  RGST_Group0305_Reg01                  ; // 01  (ADDR : 0x9C00_9884)
    UINT32  RGST_Group0305_Reg02                  ; // 02  (ADDR : 0x9C00_9888)
    UINT32  RGST_Group0305_Reg03                  ; // 03  (ADDR : 0x9C00_988C)
    UINT32  RGST_Group0305_Reg04                  ; // 04  (ADDR : 0x9C00_9890)
    UINT32  RGST_Group0305_Reg05                  ; // 05  (ADDR : 0x9C00_9894)
    UINT32  RGST_Group0305_Reg06                  ; // 06  (ADDR : 0x9C00_9898)
    UINT32  RGST_Group0305_Reg07                  ; // 07  (ADDR : 0x9C00_989C)
    UINT32  RGST_Group0305_Reg08                  ; // 08  (ADDR : 0x9C00_98A0)
    UINT32  RGST_Group0305_Reg09                  ; // 09  (ADDR : 0x9C00_98A4)
    UINT32  RGST_Group0305_Reg10                  ; // 10  (ADDR : 0x9C00_98A8)
    UINT32  RGST_Group0305_Reg11                  ; // 11  (ADDR : 0x9C00_98AC)
    UINT32  RGST_Group0305_Reg12                  ; // 12  (ADDR : 0x9C00_98B0)
    UINT32  RGST_Group0305_Reg13                  ; // 13  (ADDR : 0x9C00_98B4)
    UINT32  RGST_Group0305_Reg14                  ; // 14  (ADDR : 0x9C00_98B8)
    UINT32  RGST_Group0305_Reg15                  ; // 15  (ADDR : 0x9C00_98BC)
    UINT32  RGST_Group0305_Reg16                  ; // 16  (ADDR : 0x9C00_98C0)
    UINT32  RGST_Group0305_Reg17                  ; // 17  (ADDR : 0x9C00_98C4)
    UINT32  RGST_Group0305_Reg18                  ; // 18  (ADDR : 0x9C00_98C8)
    UINT32  RGST_Group0305_Reg19                  ; // 19  (ADDR : 0x9C00_98CC)
    UINT32  RGST_Group0305_Reg20                  ; // 20  (ADDR : 0x9C00_98D0)
    UINT32  RGST_Group0305_Reg21                  ; // 21  (ADDR : 0x9C00_98D4)
    UINT32  RGST_Group0305_Reg22                  ; // 22  (ADDR : 0x9C00_98D8)
    UINT32  RGST_Group0305_Reg23                  ; // 23  (ADDR : 0x9C00_98DC)
    UINT32  RGST_Group0305_Reg24                  ; // 24  (ADDR : 0x9C00_98E0)
    UINT32  RGST_Group0305_Reg25                  ; // 25  (ADDR : 0x9C00_98E4)
    UINT32  RGST_Group0305_Reg26                  ; // 26  (ADDR : 0x9C00_98E8)
    UINT32  RGST_Group0305_Reg27                  ; // 27  (ADDR : 0x9C00_98EC)
    UINT32  RGST_Group0305_Reg28                  ; // 28  (ADDR : 0x9C00_98F0)
    UINT32  RGST_Group0305_Reg29                  ; // 29  (ADDR : 0x9C00_98F4)
    UINT32  RGST_Group0305_Reg30                  ; // 30  (ADDR : 0x9C00_98F8)
    UINT32  RGST_Group0305_Reg31                  ; // 31  (ADDR : 0x9C00_98FC)

    //Group   306 : IMG1
    UINT32  RGST_Group0306_Reg00                  ; // 00  (ADDR : 0x9C00_9900)
    UINT32  RGST_Group0306_Reg01                  ; // 01  (ADDR : 0x9C00_9904)
    UINT32  RGST_Group0306_Reg02                  ; // 02  (ADDR : 0x9C00_9908)
    UINT32  RGST_Group0306_Reg03                  ; // 03  (ADDR : 0x9C00_990C)
    UINT32  RGST_Group0306_Reg04                  ; // 04  (ADDR : 0x9C00_9910)
    UINT32  RGST_Group0306_Reg05                  ; // 05  (ADDR : 0x9C00_9914)
    UINT32  RGST_Group0306_Reg06                  ; // 06  (ADDR : 0x9C00_9918)
    UINT32  RGST_Group0306_Reg07                  ; // 07  (ADDR : 0x9C00_991C)
    UINT32  RGST_Group0306_Reg08                  ; // 08  (ADDR : 0x9C00_9920)
    UINT32  RGST_Group0306_Reg09                  ; // 09  (ADDR : 0x9C00_9924)
    UINT32  RGST_Group0306_Reg10                  ; // 10  (ADDR : 0x9C00_9928)
    UINT32  RGST_Group0306_Reg11                  ; // 11  (ADDR : 0x9C00_992C)
    UINT32  RGST_Group0306_Reg12                  ; // 12  (ADDR : 0x9C00_9930)
    UINT32  RGST_Group0306_Reg13                  ; // 13  (ADDR : 0x9C00_9934)
    UINT32  RGST_Group0306_Reg14                  ; // 14  (ADDR : 0x9C00_9938)
    UINT32  RGST_Group0306_Reg15                  ; // 15  (ADDR : 0x9C00_993C)
    UINT32  RGST_Group0306_Reg16                  ; // 16  (ADDR : 0x9C00_9940)
    UINT32  RGST_Group0306_Reg17                  ; // 17  (ADDR : 0x9C00_9944)
    UINT32  RGST_Group0306_Reg18                  ; // 18  (ADDR : 0x9C00_9948)
    UINT32  RGST_Group0306_Reg19                  ; // 19  (ADDR : 0x9C00_994C)
    UINT32  RGST_Group0306_Reg20                  ; // 20  (ADDR : 0x9C00_9950)
    UINT32  RGST_Group0306_Reg21                  ; // 21  (ADDR : 0x9C00_9954)
    UINT32  RGST_Group0306_Reg22                  ; // 22  (ADDR : 0x9C00_9958)
    UINT32  RGST_Group0306_Reg23                  ; // 23  (ADDR : 0x9C00_995C)
    UINT32  RGST_Group0306_Reg24                  ; // 24  (ADDR : 0x9C00_9960)
    UINT32  RGST_Group0306_Reg25                  ; // 25  (ADDR : 0x9C00_9964)
    UINT32  RGST_Group0306_Reg26                  ; // 26  (ADDR : 0x9C00_9968)
    UINT32  RGST_Group0306_Reg27                  ; // 27  (ADDR : 0x9C00_996C)
    UINT32  RGST_Group0306_Reg28                  ; // 28  (ADDR : 0x9C00_9970)
    UINT32  RGST_Group0306_Reg29                  ; // 29  (ADDR : 0x9C00_9974)
    UINT32  RGST_Group0306_Reg30                  ; // 30  (ADDR : 0x9C00_9978)
    UINT32  RGST_Group0306_Reg31                  ; // 31  (ADDR : 0x9C00_997C)

    //Group   307 : V656IN0
    UINT32  tpiiw0_latch_en	                  ; // 00  (ADDR : 0x9C00_9980)
    UINT32  tpiiw0_mode_option	                  ; // 01  (ADDR : 0x9C00_9984)
    UINT32  tpiiw0_en		                  ; // 02  (ADDR : 0x9C00_9988)
    UINT32  tpiiw0_ug_thd	                  ; // 03  (ADDR : 0x9C00_998C)
    UINT32  tpiiw0_cmdq_thd	                  ; // 04  (ADDR : 0x9C00_9990)
    UINT32  tpiiw0_in_status  	       	          ; // 05  (ADDR : 0x9C00_9994)
    UINT32  RGST_Group0307_Reg06                  ; // 06  (ADDR : 0x9C00_9998)
    UINT32  RGST_Group0307_Reg07                  ; // 07  (ADDR : 0x9C00_999C)
    UINT32  RGST_Group0307_Reg08                  ; // 08  (ADDR : 0x9C00_99A0)
    UINT32  RGST_Group0307_Reg09                  ; // 09  (ADDR : 0x9C00_99A4)
    UINT32  tpiiw0_luma_iw_base_addr0             ; // 10  (ADDR : 0x9C00_99A8)
    UINT32  tpiiw0_luma_iw_base_addr1             ; // 11  (ADDR : 0x9C00_99AC)
    UINT32  tpiiw0_crma_iw_base_addr0             ; // 12  (ADDR : 0x9C00_99B0)
    UINT32  tpiiw0_crma_iw_base_addr1             ; // 13  (ADDR : 0x9C00_99B4)
    UINT32  tpiiw0_vdo_frame_size                 ; // 14  (ADDR : 0x9C00_99B8)
    UINT32  tpiiw0_vdo_xy_size	                  ; // 15  (ADDR : 0x9C00_99BC)
    UINT32  tpiiw0_debug_mode	                  ; // 16  (ADDR : 0x9C00_99C0)
    UINT32  tpiiw0_chksum_info                    ; // 17  (ADDR : 0x9C00_99C4)
    UINT32  tpiiw0_irq_field_start_line_cnt       ; // 18  (ADDR : 0x9C00_99C8)
    UINT32  tpiiw0_irq_mask                       ; // 19  (ADDR : 0x9C00_99CC)
    UINT32  tpiiw0_irq_ini	                  ; // 20  (ADDR : 0x9C00_99D0)
    UINT32  tpiiw0_irq_time_out_threshold         ; // 21  (ADDR : 0x9C00_99D4)
    UINT32  tpiiw0_irq_line_start                 ; // 22  (ADDR : 0x9C00_99D8)
    UINT32  tpiiw0_irq_pix_start	          ; // 23  (ADDR : 0x9C00_99DC)
    UINT32  tpiiw0_irq_other_control              ; // 24  (ADDR : 0x9C00_99E0)
    UINT32  RGST_Group0307_Reg25                  ; // 25  (ADDR : 0x9C00_99E4)
    UINT32  RGST_Group0307_Reg26                  ; // 26  (ADDR : 0x9C00_99E8)
    UINT32  tpiiw0_error_flag_info                ; // 27  (ADDR : 0x9C00_99EC)
    UINT32  RGST_Group0307_Reg28                  ; // 28  (ADDR : 0x9C00_99F0)
    UINT32  RGST_Group0307_Reg29                  ; // 29  (ADDR : 0x9C00_99F4)
    UINT32  RGST_Group0307_Reg30                  ; // 30  (ADDR : 0x9C00_99F8)
    UINT32  RGST_Group0307_Reg31                  ; // 31  (ADDR : 0x9C00_99FC)

    //Group   308 : V656IN1
    UINT32  tpiiw1_latch_en	           	  ; // 00  (ADDR : 0x9C00_9A00)
    UINT32  tpiiw1_mode_option	           	  ; // 01  (ADDR : 0x9C00_9A04)
    UINT32  tpiiw1_en		           	  ; // 02  (ADDR : 0x9C00_9A08)
    UINT32  tpiiw1_ug_thd	           	  ; // 03  (ADDR : 0x9C00_9A0C)
    UINT32  tpiiw1_cmdq_thd	           	  ; // 04  (ADDR : 0x9C00_9A10)
    UINT32  tpiiw1_in_status  	       	   	  ; // 05  (ADDR : 0x9C00_9A14)
    UINT32  RGST_Group0308_Reg06           	  ; // 06  (ADDR : 0x9C00_9A18)
    UINT32  RGST_Group0308_Reg07           	  ; // 07  (ADDR : 0x9C00_9A1C)
    UINT32  RGST_Group0308_Reg08           	  ; // 08  (ADDR : 0x9C00_9A20)
    UINT32  RGST_Group0308_Reg09           	  ; // 09  (ADDR : 0x9C00_9A24)
    UINT32  tpiiw1_luma_iw_base_addr0      	  ; // 10  (ADDR : 0x9C00_9A28)
    UINT32  tpiiw1_luma_iw_base_addr1      	  ; // 11  (ADDR : 0x9C00_9A2C)
    UINT32  tpiiw1_crma_iw_base_addr0      	  ; // 12  (ADDR : 0x9C00_9A30)
    UINT32  tpiiw1_crma_iw_base_addr1      	  ; // 13  (ADDR : 0x9C00_9A34)
    UINT32  tpiiw1_vdo_frame_size          	  ; // 14  (ADDR : 0x9C00_9A38)
    UINT32  tpiiw1_vdo_xy_size	           	  ; // 15  (ADDR : 0x9C00_9A3C)
    UINT32  tpiiw1_debug_mode	           	  ; // 16  (ADDR : 0x9C00_9A40)
    UINT32  tpiiw1_chksum_info             	  ; // 17  (ADDR : 0x9C00_9A44)
    UINT32  tpiiw1_irq_field_start_line_cnt	  ; // 18  (ADDR : 0x9C00_9A48)
    UINT32  tpiiw1_irq_mask                	  ; // 19  (ADDR : 0x9C00_9A4C)
    UINT32  tpiiw1_irq_ini	           	  ; // 20  (ADDR : 0x9C00_9A50)
    UINT32  tpiiw1_irq_time_out_threshold  	  ; // 21  (ADDR : 0x9C00_9A54)
    UINT32  tpiiw1_irq_line_start          	  ; // 22  (ADDR : 0x9C00_9A58)
    UINT32  tpiiw1_irq_pix_start	   	  ; // 23  (ADDR : 0x9C00_9A5C)
    UINT32  tpiiw1_irq_other_control       	  ; // 24  (ADDR : 0x9C00_9A60)
    UINT32  RGST_Group0308_Reg25           	  ; // 25  (ADDR : 0x9C00_9A64)
    UINT32  RGST_Group0308_Reg26           	  ; // 26  (ADDR : 0x9C00_9A68)
    UINT32  tpiiw1_error_flag_info         	  ; // 27  (ADDR : 0x9C00_9A6C)
    UINT32  RGST_Group0308_Reg28           	  ; // 28  (ADDR : 0x9C00_9A70)
    UINT32  RGST_Group0308_Reg29           	  ; // 29  (ADDR : 0x9C00_9A74)
    UINT32  RGST_Group0308_Reg30           	  ; // 30  (ADDR : 0x9C00_9A78)
    UINT32  RGST_Group0308_Reg31           	  ; // 31  (ADDR : 0x9C00_9A7C)

    //Group   309 : Reserved
    UINT32  RGST_Group0309_Reserved[32]           ; //     (ADDR : 0x9C00_9A80) ~ (ADDR : 0x9C00_9AFC)

    //Group   310 : TVDEC
    UINT32  RGST_Group0310_Reg00                  ; // 00  (ADDR : 0x9C00_9B00)
    UINT32  RGST_Group0310_Reg01                  ; // 01  (ADDR : 0x9C00_9B04)
    UINT32  RGST_Group0310_Reg02                  ; // 02  (ADDR : 0x9C00_9B08)
    UINT32  RGST_Group0310_Reg03                  ; // 03  (ADDR : 0x9C00_9B0C)
    UINT32  RGST_Group0310_Reg04                  ; // 04  (ADDR : 0x9C00_9B10)
    UINT32  RGST_Group0310_Reg05                  ; // 05  (ADDR : 0x9C00_9B14)
    UINT32  RGST_Group0310_Reg06                  ; // 06  (ADDR : 0x9C00_9B18)
    UINT32  RGST_Group0310_Reg07                  ; // 07  (ADDR : 0x9C00_9B1C)
    UINT32  RGST_Group0310_Reg08                  ; // 08  (ADDR : 0x9C00_9B20)
    UINT32  RGST_Group0310_Reg09                  ; // 09  (ADDR : 0x9C00_9B24)
    UINT32  RGST_Group0310_Reg10                  ; // 10  (ADDR : 0x9C00_9B28)
    UINT32  RGST_Group0310_Reg11                  ; // 11  (ADDR : 0x9C00_9B2C)
    UINT32  RGST_Group0310_Reg12                  ; // 12  (ADDR : 0x9C00_9B30)
    UINT32  RGST_Group0310_Reg13                  ; // 13  (ADDR : 0x9C00_9B34)
    UINT32  RGST_Group0310_Reg14                  ; // 14  (ADDR : 0x9C00_9B38)
    UINT32  RGST_Group0310_Reg15                  ; // 15  (ADDR : 0x9C00_9B3C)
    UINT32  RGST_Group0310_Reg16                  ; // 16  (ADDR : 0x9C00_9B40)
    UINT32  RGST_Group0310_Reg17                  ; // 17  (ADDR : 0x9C00_9B44)
    UINT32  RGST_Group0310_Reg18                  ; // 18  (ADDR : 0x9C00_9B48)
    UINT32  RGST_Group0310_Reg19                  ; // 19  (ADDR : 0x9C00_9B4C)
    UINT32  RGST_Group0310_Reg20                  ; // 20  (ADDR : 0x9C00_9B50)
    UINT32  RGST_Group0310_Reg21                  ; // 21  (ADDR : 0x9C00_9B54)
    UINT32  RGST_Group0310_Reg22                  ; // 22  (ADDR : 0x9C00_9B58)
    UINT32  RGST_Group0310_Reg23                  ; // 23  (ADDR : 0x9C00_9B5C)
    UINT32  RGST_Group0310_Reg24                  ; // 24  (ADDR : 0x9C00_9B60)
    UINT32  RGST_Group0310_Reg25                  ; // 25  (ADDR : 0x9C00_9B64)
    UINT32  RGST_Group0310_Reg26                  ; // 26  (ADDR : 0x9C00_9B68)
    UINT32  RGST_Group0310_Reg27                  ; // 27  (ADDR : 0x9C00_9B6C)
    UINT32  RGST_Group0310_Reg28                  ; // 28  (ADDR : 0x9C00_9B70)
    UINT32  RGST_Group0310_Reg29                  ; // 29  (ADDR : 0x9C00_9B74)
    UINT32  RGST_Group0310_Reg30                  ; // 30  (ADDR : 0x9C00_9B78)
    UINT32  RGST_Group0310_Reg31                  ; // 31  (ADDR : 0x9C00_9B7C)

    //Group   311 : TVDEC
    UINT32  RGST_Group0311_Reg00                  ; // 00  (ADDR : 0x9C00_9B80)
    UINT32  RGST_Group0311_Reg01                  ; // 01  (ADDR : 0x9C00_9B84)
    UINT32  RGST_Group0311_Reg02                  ; // 02  (ADDR : 0x9C00_9B88)
    UINT32  RGST_Group0311_Reg03                  ; // 03  (ADDR : 0x9C00_9B8C)
    UINT32  RGST_Group0311_Reg04                  ; // 04  (ADDR : 0x9C00_9B90)
    UINT32  RGST_Group0311_Reg05                  ; // 05  (ADDR : 0x9C00_9B94)
    UINT32  RGST_Group0311_Reg06                  ; // 06  (ADDR : 0x9C00_9B98)
    UINT32  RGST_Group0311_Reg07                  ; // 07  (ADDR : 0x9C00_9B9C)
    UINT32  RGST_Group0311_Reg08                  ; // 08  (ADDR : 0x9C00_9BA0)
    UINT32  RGST_Group0311_Reg09                  ; // 09  (ADDR : 0x9C00_9BA4)
    UINT32  RGST_Group0311_Reg10                  ; // 10  (ADDR : 0x9C00_9BA8)
    UINT32  RGST_Group0311_Reg11                  ; // 11  (ADDR : 0x9C00_9BAC)
    UINT32  RGST_Group0311_Reg12                  ; // 12  (ADDR : 0x9C00_9BB0)
    UINT32  RGST_Group0311_Reg13                  ; // 13  (ADDR : 0x9C00_9BB4)
    UINT32  RGST_Group0311_Reg14                  ; // 14  (ADDR : 0x9C00_9BB8)
    UINT32  RGST_Group0311_Reg15                  ; // 15  (ADDR : 0x9C00_9BBC)
    UINT32  RGST_Group0311_Reg16                  ; // 16  (ADDR : 0x9C00_9BC0)
    UINT32  RGST_Group0311_Reg17                  ; // 17  (ADDR : 0x9C00_9BC4)
    UINT32  RGST_Group0311_Reg18                  ; // 18  (ADDR : 0x9C00_9BC8)
    UINT32  RGST_Group0311_Reg19                  ; // 19  (ADDR : 0x9C00_9BCC)
    UINT32  RGST_Group0311_Reg20                  ; // 20  (ADDR : 0x9C00_9BD0)
    UINT32  RGST_Group0311_Reg21                  ; // 21  (ADDR : 0x9C00_9BD4)
    UINT32  RGST_Group0311_Reg22                  ; // 22  (ADDR : 0x9C00_9BD8)
    UINT32  RGST_Group0311_Reg23                  ; // 23  (ADDR : 0x9C00_9BDC)
    UINT32  RGST_Group0311_Reg24                  ; // 24  (ADDR : 0x9C00_9BE0)
    UINT32  RGST_Group0311_Reg25                  ; // 25  (ADDR : 0x9C00_9BE4)
    UINT32  RGST_Group0311_Reg26                  ; // 26  (ADDR : 0x9C00_9BE8)
    UINT32  RGST_Group0311_Reg27                  ; // 27  (ADDR : 0x9C00_9BEC)
    UINT32  RGST_Group0311_Reg28                  ; // 28  (ADDR : 0x9C00_9BF0)
    UINT32  RGST_Group0311_Reg29                  ; // 29  (ADDR : 0x9C00_9BF4)
    UINT32  RGST_Group0311_Reg30                  ; // 30  (ADDR : 0x9C00_9BF8)
    UINT32  RGST_Group0311_Reg31                  ; // 31  (ADDR : 0x9C00_9BFC)

    //Group   312 : TVDEC
    UINT32  RGST_Group0312_Reg00                  ; // 00  (ADDR : 0x9C00_9C00)
    UINT32  RGST_Group0312_Reg01                  ; // 01  (ADDR : 0x9C00_9C04)
    UINT32  RGST_Group0312_Reg02                  ; // 02  (ADDR : 0x9C00_9C08)
    UINT32  RGST_Group0312_Reg03                  ; // 03  (ADDR : 0x9C00_9C0C)
    UINT32  RGST_Group0312_Reg04                  ; // 04  (ADDR : 0x9C00_9C10)
    UINT32  RGST_Group0312_Reg05                  ; // 05  (ADDR : 0x9C00_9C14)
    UINT32  RGST_Group0312_Reg06                  ; // 06  (ADDR : 0x9C00_9C18)
    UINT32  RGST_Group0312_Reg07                  ; // 07  (ADDR : 0x9C00_9C1C)
    UINT32  RGST_Group0312_Reg08                  ; // 08  (ADDR : 0x9C00_9C20)
    UINT32  RGST_Group0312_Reg09                  ; // 09  (ADDR : 0x9C00_9C24)
    UINT32  RGST_Group0312_Reg10                  ; // 10  (ADDR : 0x9C00_9C28)
    UINT32  RGST_Group0312_Reg11                  ; // 11  (ADDR : 0x9C00_9C2C)
    UINT32  RGST_Group0312_Reg12                  ; // 12  (ADDR : 0x9C00_9C30)
    UINT32  RGST_Group0312_Reg13                  ; // 13  (ADDR : 0x9C00_9C34)
    UINT32  RGST_Group0312_Reg14                  ; // 14  (ADDR : 0x9C00_9C38)
    UINT32  RGST_Group0312_Reg15                  ; // 15  (ADDR : 0x9C00_9C3C)
    UINT32  RGST_Group0312_Reg16                  ; // 16  (ADDR : 0x9C00_9C40)
    UINT32  RGST_Group0312_Reg17                  ; // 17  (ADDR : 0x9C00_9C44)
    UINT32  RGST_Group0312_Reg18                  ; // 18  (ADDR : 0x9C00_9C48)
    UINT32  RGST_Group0312_Reg19                  ; // 19  (ADDR : 0x9C00_9C4C)
    UINT32  RGST_Group0312_Reg20                  ; // 20  (ADDR : 0x9C00_9C50)
    UINT32  RGST_Group0312_Reg21                  ; // 21  (ADDR : 0x9C00_9C54)
    UINT32  RGST_Group0312_Reg22                  ; // 22  (ADDR : 0x9C00_9C58)
    UINT32  RGST_Group0312_Reg23                  ; // 23  (ADDR : 0x9C00_9C5C)
    UINT32  RGST_Group0312_Reg24                  ; // 24  (ADDR : 0x9C00_9C60)
    UINT32  RGST_Group0312_Reg25                  ; // 25  (ADDR : 0x9C00_9C64)
    UINT32  RGST_Group0312_Reg26                  ; // 26  (ADDR : 0x9C00_9C68)
    UINT32  RGST_Group0312_Reg27                  ; // 27  (ADDR : 0x9C00_9C6C)
    UINT32  RGST_Group0312_Reg28                  ; // 28  (ADDR : 0x9C00_9C70)
    UINT32  RGST_Group0312_Reg29                  ; // 29  (ADDR : 0x9C00_9C74)
    UINT32  RGST_Group0312_Reg30                  ; // 30  (ADDR : 0x9C00_9C78)
    UINT32  RGST_Group0312_Reg31                  ; // 31  (ADDR : 0x9C00_9C7C)

    //Group   313 : TVDEC
    UINT32  RGST_Group0313_Reg00                  ; // 00  (ADDR : 0x9C00_9C80)
    UINT32  RGST_Group0313_Reg01                  ; // 01  (ADDR : 0x9C00_9C84)
    UINT32  RGST_Group0313_Reg02                  ; // 02  (ADDR : 0x9C00_9C88)
    UINT32  RGST_Group0313_Reg03                  ; // 03  (ADDR : 0x9C00_9C8C)
    UINT32  RGST_Group0313_Reg04                  ; // 04  (ADDR : 0x9C00_9C90)
    UINT32  RGST_Group0313_Reg05                  ; // 05  (ADDR : 0x9C00_9C94)
    UINT32  RGST_Group0313_Reg06                  ; // 06  (ADDR : 0x9C00_9C98)
    UINT32  RGST_Group0313_Reg07                  ; // 07  (ADDR : 0x9C00_9C9C)
    UINT32  RGST_Group0313_Reg08                  ; // 08  (ADDR : 0x9C00_9CA0)
    UINT32  RGST_Group0313_Reg09                  ; // 09  (ADDR : 0x9C00_9CA4)
    UINT32  RGST_Group0313_Reg10                  ; // 10  (ADDR : 0x9C00_9CA8)
    UINT32  RGST_Group0313_Reg11                  ; // 11  (ADDR : 0x9C00_9CAC)
    UINT32  RGST_Group0313_Reg12                  ; // 12  (ADDR : 0x9C00_9CB0)
    UINT32  RGST_Group0313_Reg13                  ; // 13  (ADDR : 0x9C00_9CB4)
    UINT32  RGST_Group0313_Reg14                  ; // 14  (ADDR : 0x9C00_9CB8)
    UINT32  RGST_Group0313_Reg15                  ; // 15  (ADDR : 0x9C00_9CBC)
    UINT32  RGST_Group0313_Reg16                  ; // 16  (ADDR : 0x9C00_9CC0)
    UINT32  RGST_Group0313_Reg17                  ; // 17  (ADDR : 0x9C00_9CC4)
    UINT32  RGST_Group0313_Reg18                  ; // 18  (ADDR : 0x9C00_9CC8)
    UINT32  RGST_Group0313_Reg19                  ; // 19  (ADDR : 0x9C00_9CCC)
    UINT32  RGST_Group0313_Reg20                  ; // 20  (ADDR : 0x9C00_9CD0)
    UINT32  RGST_Group0313_Reg21                  ; // 21  (ADDR : 0x9C00_9CD4)
    UINT32  RGST_Group0313_Reg22                  ; // 22  (ADDR : 0x9C00_9CD8)
    UINT32  RGST_Group0313_Reg23                  ; // 23  (ADDR : 0x9C00_9CDC)
    UINT32  RGST_Group0313_Reg24                  ; // 24  (ADDR : 0x9C00_9CE0)
    UINT32  RGST_Group0313_Reg25                  ; // 25  (ADDR : 0x9C00_9CE4)
    UINT32  RGST_Group0313_Reg26                  ; // 26  (ADDR : 0x9C00_9CE8)
    UINT32  RGST_Group0313_Reg27                  ; // 27  (ADDR : 0x9C00_9CEC)
    UINT32  RGST_Group0313_Reg28                  ; // 28  (ADDR : 0x9C00_9CF0)
    UINT32  RGST_Group0313_Reg29                  ; // 29  (ADDR : 0x9C00_9CF4)
    UINT32  RGST_Group0313_Reg30                  ; // 30  (ADDR : 0x9C00_9CF8)
    UINT32  RGST_Group0313_Reg31                  ; // 31  (ADDR : 0x9C00_9CFC)

    //Group   314 : TVDEC
    UINT32  RGST_Group0314_Reg00                  ; // 00  (ADDR : 0x9C00_9D00)
    UINT32  RGST_Group0314_Reg01                  ; // 01  (ADDR : 0x9C00_9D04)
    UINT32  RGST_Group0314_Reg02                  ; // 02  (ADDR : 0x9C00_9D08)
    UINT32  RGST_Group0314_Reg03                  ; // 03  (ADDR : 0x9C00_9D0C)
    UINT32  RGST_Group0314_Reg04                  ; // 04  (ADDR : 0x9C00_9D10)
    UINT32  RGST_Group0314_Reg05                  ; // 05  (ADDR : 0x9C00_9D14)
    UINT32  RGST_Group0314_Reg06                  ; // 06  (ADDR : 0x9C00_9D18)
    UINT32  RGST_Group0314_Reg07                  ; // 07  (ADDR : 0x9C00_9D1C)
    UINT32  RGST_Group0314_Reg08                  ; // 08  (ADDR : 0x9C00_9D20)
    UINT32  RGST_Group0314_Reg09                  ; // 09  (ADDR : 0x9C00_9D24)
    UINT32  RGST_Group0314_Reg10                  ; // 10  (ADDR : 0x9C00_9D28)
    UINT32  RGST_Group0314_Reg11                  ; // 11  (ADDR : 0x9C00_9D2C)
    UINT32  RGST_Group0314_Reg12                  ; // 12  (ADDR : 0x9C00_9D30)
    UINT32  RGST_Group0314_Reg13                  ; // 13  (ADDR : 0x9C00_9D34)
    UINT32  RGST_Group0314_Reg14                  ; // 14  (ADDR : 0x9C00_9D38)
    UINT32  RGST_Group0314_Reg15                  ; // 15  (ADDR : 0x9C00_9D3C)
    UINT32  RGST_Group0314_Reg16                  ; // 16  (ADDR : 0x9C00_9D40)
    UINT32  RGST_Group0314_Reg17                  ; // 17  (ADDR : 0x9C00_9D44)
    UINT32  RGST_Group0314_Reg18                  ; // 18  (ADDR : 0x9C00_9D48)
    UINT32  RGST_Group0314_Reg19                  ; // 19  (ADDR : 0x9C00_9D4C)
    UINT32  RGST_Group0314_Reg20                  ; // 20  (ADDR : 0x9C00_9D50)
    UINT32  RGST_Group0314_Reg21                  ; // 21  (ADDR : 0x9C00_9D54)
    UINT32  RGST_Group0314_Reg22                  ; // 22  (ADDR : 0x9C00_9D58)
    UINT32  RGST_Group0314_Reg23                  ; // 23  (ADDR : 0x9C00_9D5C)
    UINT32  RGST_Group0314_Reg24                  ; // 24  (ADDR : 0x9C00_9D60)
    UINT32  RGST_Group0314_Reg25                  ; // 25  (ADDR : 0x9C00_9D64)
    UINT32  RGST_Group0314_Reg26                  ; // 26  (ADDR : 0x9C00_9D68)
    UINT32  RGST_Group0314_Reg27                  ; // 27  (ADDR : 0x9C00_9D6C)
    UINT32  RGST_Group0314_Reg28                  ; // 28  (ADDR : 0x9C00_9D70)
    UINT32  RGST_Group0314_Reg29                  ; // 29  (ADDR : 0x9C00_9D74)
    UINT32  RGST_Group0314_Reg30                  ; // 30  (ADDR : 0x9C00_9D78)
    UINT32  RGST_Group0314_Reg31                  ; // 31  (ADDR : 0x9C00_9D7C)

    //Group   315 : TVDEC
    UINT32  RGST_Group0315_Reg00                  ; // 00  (ADDR : 0x9C00_9D80)
    UINT32  RGST_Group0315_Reg01                  ; // 01  (ADDR : 0x9C00_9D84)
    UINT32  RGST_Group0315_Reg02                  ; // 02  (ADDR : 0x9C00_9D88)
    UINT32  RGST_Group0315_Reg03                  ; // 03  (ADDR : 0x9C00_9D8C)
    UINT32  RGST_Group0315_Reg04                  ; // 04  (ADDR : 0x9C00_9D90)
    UINT32  RGST_Group0315_Reg05                  ; // 05  (ADDR : 0x9C00_9D94)
    UINT32  RGST_Group0315_Reg06                  ; // 06  (ADDR : 0x9C00_9D98)
    UINT32  RGST_Group0315_Reg07                  ; // 07  (ADDR : 0x9C00_9D9C)
    UINT32  RGST_Group0315_Reg08                  ; // 08  (ADDR : 0x9C00_9DA0)
    UINT32  RGST_Group0315_Reg09                  ; // 09  (ADDR : 0x9C00_9DA4)
    UINT32  RGST_Group0315_Reg10                  ; // 10  (ADDR : 0x9C00_9DA8)
    UINT32  RGST_Group0315_Reg11                  ; // 11  (ADDR : 0x9C00_9DAC)
    UINT32  RGST_Group0315_Reg12                  ; // 12  (ADDR : 0x9C00_9DB0)
    UINT32  RGST_Group0315_Reg13                  ; // 13  (ADDR : 0x9C00_9DB4)
    UINT32  RGST_Group0315_Reg14                  ; // 14  (ADDR : 0x9C00_9DB8)
    UINT32  RGST_Group0315_Reg15                  ; // 15  (ADDR : 0x9C00_9DBC)
    UINT32  RGST_Group0315_Reg16                  ; // 16  (ADDR : 0x9C00_9DC0)
    UINT32  RGST_Group0315_Reg17                  ; // 17  (ADDR : 0x9C00_9DC4)
    UINT32  RGST_Group0315_Reg18                  ; // 18  (ADDR : 0x9C00_9DC8)
    UINT32  RGST_Group0315_Reg19                  ; // 19  (ADDR : 0x9C00_9DCC)
    UINT32  RGST_Group0315_Reg20                  ; // 20  (ADDR : 0x9C00_9DD0)
    UINT32  RGST_Group0315_Reg21                  ; // 21  (ADDR : 0x9C00_9DD4)
    UINT32  RGST_Group0315_Reg22                  ; // 22  (ADDR : 0x9C00_9DD8)
    UINT32  RGST_Group0315_Reg23                  ; // 23  (ADDR : 0x9C00_9DDC)
    UINT32  RGST_Group0315_Reg24                  ; // 24  (ADDR : 0x9C00_9DE0)
    UINT32  RGST_Group0315_Reg25                  ; // 25  (ADDR : 0x9C00_9DE4)
    UINT32  RGST_Group0315_Reg26                  ; // 26  (ADDR : 0x9C00_9DE8)
    UINT32  RGST_Group0315_Reg27                  ; // 27  (ADDR : 0x9C00_9DEC)
    UINT32  RGST_Group0315_Reg28                  ; // 28  (ADDR : 0x9C00_9DF0)
    UINT32  RGST_Group0315_Reg29                  ; // 29  (ADDR : 0x9C00_9DF4)
    UINT32  RGST_Group0315_Reg30                  ; // 30  (ADDR : 0x9C00_9DF8)
    UINT32  RGST_Group0315_Reg31                  ; // 31  (ADDR : 0x9C00_9DFC)

    //Group   316 : TVDEC
    UINT32  RGST_Group0316_Reg00                  ; // 00  (ADDR : 0x9C00_9E00)
    UINT32  RGST_Group0316_Reg01                  ; // 01  (ADDR : 0x9C00_9E04)
    UINT32  RGST_Group0316_Reg02                  ; // 02  (ADDR : 0x9C00_9E08)
    UINT32  RGST_Group0316_Reg03                  ; // 03  (ADDR : 0x9C00_9E0C)
    UINT32  RGST_Group0316_Reg04                  ; // 04  (ADDR : 0x9C00_9E10)
    UINT32  RGST_Group0316_Reg05                  ; // 05  (ADDR : 0x9C00_9E14)
    UINT32  RGST_Group0316_Reg06                  ; // 06  (ADDR : 0x9C00_9E18)
    UINT32  RGST_Group0316_Reg07                  ; // 07  (ADDR : 0x9C00_9E1C)
    UINT32  RGST_Group0316_Reg08                  ; // 08  (ADDR : 0x9C00_9E20)
    UINT32  RGST_Group0316_Reg09                  ; // 09  (ADDR : 0x9C00_9E24)
    UINT32  RGST_Group0316_Reg10                  ; // 10  (ADDR : 0x9C00_9E28)
    UINT32  RGST_Group0316_Reg11                  ; // 11  (ADDR : 0x9C00_9E2C)
    UINT32  RGST_Group0316_Reg12                  ; // 12  (ADDR : 0x9C00_9E30)
    UINT32  RGST_Group0316_Reg13                  ; // 13  (ADDR : 0x9C00_9E34)
    UINT32  RGST_Group0316_Reg14                  ; // 14  (ADDR : 0x9C00_9E38)
    UINT32  RGST_Group0316_Reg15                  ; // 15  (ADDR : 0x9C00_9E3C)
    UINT32  RGST_Group0316_Reg16                  ; // 16  (ADDR : 0x9C00_9E40)
    UINT32  RGST_Group0316_Reg17                  ; // 17  (ADDR : 0x9C00_9E44)
    UINT32  RGST_Group0316_Reg18                  ; // 18  (ADDR : 0x9C00_9E48)
    UINT32  RGST_Group0316_Reg19                  ; // 19  (ADDR : 0x9C00_9E4C)
    UINT32  RGST_Group0316_Reg20                  ; // 20  (ADDR : 0x9C00_9E50)
    UINT32  RGST_Group0316_Reg21                  ; // 21  (ADDR : 0x9C00_9E54)
    UINT32  RGST_Group0316_Reg22                  ; // 22  (ADDR : 0x9C00_9E58)
    UINT32  RGST_Group0316_Reg23                  ; // 23  (ADDR : 0x9C00_9E5C)
    UINT32  RGST_Group0316_Reg24                  ; // 24  (ADDR : 0x9C00_9E60)
    UINT32  RGST_Group0316_Reg25                  ; // 25  (ADDR : 0x9C00_9E64)
    UINT32  RGST_Group0316_Reg26                  ; // 26  (ADDR : 0x9C00_9E68)
    UINT32  RGST_Group0316_Reg27                  ; // 27  (ADDR : 0x9C00_9E6C)
    UINT32  RGST_Group0316_Reg28                  ; // 28  (ADDR : 0x9C00_9E70)
    UINT32  RGST_Group0316_Reg29                  ; // 29  (ADDR : 0x9C00_9E74)
    UINT32  RGST_Group0316_Reg30                  ; // 30  (ADDR : 0x9C00_9E78)
    UINT32  RGST_Group0316_Reg31                  ; // 31  (ADDR : 0x9C00_9E7C)

    //Group   317 : TVDEC
    UINT32  RGST_Group0317_Reg00                  ; // 00  (ADDR : 0x9C00_9E80)
    UINT32  RGST_Group0317_Reg01                  ; // 01  (ADDR : 0x9C00_9E84)
    UINT32  RGST_Group0317_Reg02                  ; // 02  (ADDR : 0x9C00_9E88)
    UINT32  RGST_Group0317_Reg03                  ; // 03  (ADDR : 0x9C00_9E8C)
    UINT32  RGST_Group0317_Reg04                  ; // 04  (ADDR : 0x9C00_9E90)
    UINT32  RGST_Group0317_Reg05                  ; // 05  (ADDR : 0x9C00_9E94)
    UINT32  RGST_Group0317_Reg06                  ; // 06  (ADDR : 0x9C00_9E98)
    UINT32  RGST_Group0317_Reg07                  ; // 07  (ADDR : 0x9C00_9E9C)
    UINT32  RGST_Group0317_Reg08                  ; // 08  (ADDR : 0x9C00_9EA0)
    UINT32  RGST_Group0317_Reg09                  ; // 09  (ADDR : 0x9C00_9EA4)
    UINT32  RGST_Group0317_Reg10                  ; // 10  (ADDR : 0x9C00_9EA8)
    UINT32  RGST_Group0317_Reg11                  ; // 11  (ADDR : 0x9C00_9EAC)
    UINT32  RGST_Group0317_Reg12                  ; // 12  (ADDR : 0x9C00_9EB0)
    UINT32  RGST_Group0317_Reg13                  ; // 13  (ADDR : 0x9C00_9EB4)
    UINT32  RGST_Group0317_Reg14                  ; // 14  (ADDR : 0x9C00_9EB8)
    UINT32  RGST_Group0317_Reg15                  ; // 15  (ADDR : 0x9C00_9EBC)
    UINT32  RGST_Group0317_Reg16                  ; // 16  (ADDR : 0x9C00_9EC0)
    UINT32  RGST_Group0317_Reg17                  ; // 17  (ADDR : 0x9C00_9EC4)
    UINT32  RGST_Group0317_Reg18                  ; // 18  (ADDR : 0x9C00_9EC8)
    UINT32  RGST_Group0317_Reg19                  ; // 19  (ADDR : 0x9C00_9ECC)
    UINT32  RGST_Group0317_Reg20                  ; // 20  (ADDR : 0x9C00_9ED0)
    UINT32  RGST_Group0317_Reg21                  ; // 21  (ADDR : 0x9C00_9ED4)
    UINT32  RGST_Group0317_Reg22                  ; // 22  (ADDR : 0x9C00_9ED8)
    UINT32  RGST_Group0317_Reg23                  ; // 23  (ADDR : 0x9C00_9EDC)
    UINT32  RGST_Group0317_Reg24                  ; // 24  (ADDR : 0x9C00_9EE0)
    UINT32  RGST_Group0317_Reg25                  ; // 25  (ADDR : 0x9C00_9EE4)
    UINT32  RGST_Group0317_Reg26                  ; // 26  (ADDR : 0x9C00_9EE8)
    UINT32  RGST_Group0317_Reg27                  ; // 27  (ADDR : 0x9C00_9EEC)
    UINT32  RGST_Group0317_Reg28                  ; // 28  (ADDR : 0x9C00_9EF0)
    UINT32  RGST_Group0317_Reg29                  ; // 29  (ADDR : 0x9C00_9EF4)
    UINT32  RGST_Group0317_Reg30                  ; // 30  (ADDR : 0x9C00_9EF8)
    UINT32  RGST_Group0317_Reg31                  ; // 31  (ADDR : 0x9C00_9EFC)

    //Group   318 : TVDEC
    UINT32  RGST_Group0318_Reg00                  ; // 00  (ADDR : 0x9C00_9F00)
    UINT32  RGST_Group0318_Reg01                  ; // 01  (ADDR : 0x9C00_9F04)
    UINT32  RGST_Group0318_Reg02                  ; // 02  (ADDR : 0x9C00_9F08)
    UINT32  RGST_Group0318_Reg03                  ; // 03  (ADDR : 0x9C00_9F0C)
    UINT32  RGST_Group0318_Reg04                  ; // 04  (ADDR : 0x9C00_9F10)
    UINT32  RGST_Group0318_Reg05                  ; // 05  (ADDR : 0x9C00_9F14)
    UINT32  RGST_Group0318_Reg06                  ; // 06  (ADDR : 0x9C00_9F18)
    UINT32  RGST_Group0318_Reg07                  ; // 07  (ADDR : 0x9C00_9F1C)
    UINT32  RGST_Group0318_Reg08                  ; // 08  (ADDR : 0x9C00_9F20)
    UINT32  RGST_Group0318_Reg09                  ; // 09  (ADDR : 0x9C00_9F24)
    UINT32  RGST_Group0318_Reg10                  ; // 10  (ADDR : 0x9C00_9F28)
    UINT32  RGST_Group0318_Reg11                  ; // 11  (ADDR : 0x9C00_9F2C)
    UINT32  RGST_Group0318_Reg12                  ; // 12  (ADDR : 0x9C00_9F30)
    UINT32  RGST_Group0318_Reg13                  ; // 13  (ADDR : 0x9C00_9F34)
    UINT32  RGST_Group0318_Reg14                  ; // 14  (ADDR : 0x9C00_9F38)
    UINT32  RGST_Group0318_Reg15                  ; // 15  (ADDR : 0x9C00_9F3C)
    UINT32  RGST_Group0318_Reg16                  ; // 16  (ADDR : 0x9C00_9F40)
    UINT32  RGST_Group0318_Reg17                  ; // 17  (ADDR : 0x9C00_9F44)
    UINT32  RGST_Group0318_Reg18                  ; // 18  (ADDR : 0x9C00_9F48)
    UINT32  RGST_Group0318_Reg19                  ; // 19  (ADDR : 0x9C00_9F4C)
    UINT32  RGST_Group0318_Reg20                  ; // 20  (ADDR : 0x9C00_9F50)
    UINT32  RGST_Group0318_Reg21                  ; // 21  (ADDR : 0x9C00_9F54)
    UINT32  RGST_Group0318_Reg22                  ; // 22  (ADDR : 0x9C00_9F58)
    UINT32  RGST_Group0318_Reg23                  ; // 23  (ADDR : 0x9C00_9F5C)
    UINT32  RGST_Group0318_Reg24                  ; // 24  (ADDR : 0x9C00_9F60)
    UINT32  RGST_Group0318_Reg25                  ; // 25  (ADDR : 0x9C00_9F64)
    UINT32  RGST_Group0318_Reg26                  ; // 26  (ADDR : 0x9C00_9F68)
    UINT32  RGST_Group0318_Reg27                  ; // 27  (ADDR : 0x9C00_9F6C)
    UINT32  RGST_Group0318_Reg28                  ; // 28  (ADDR : 0x9C00_9F70)
    UINT32  RGST_Group0318_Reg29                  ; // 29  (ADDR : 0x9C00_9F74)
    UINT32  RGST_Group0318_Reg30                  ; // 30  (ADDR : 0x9C00_9F78)
    UINT32  RGST_Group0318_Reg31                  ; // 31  (ADDR : 0x9C00_9F7C)

    //Group   319 : TVDEC
    UINT32  RGST_Group0319_Reg00                  ; // 00  (ADDR : 0x9C00_9F80)
    UINT32  RGST_Group0319_Reg01                  ; // 01  (ADDR : 0x9C00_9F84)
    UINT32  RGST_Group0319_Reg02                  ; // 02  (ADDR : 0x9C00_9F88)
    UINT32  RGST_Group0319_Reg03                  ; // 03  (ADDR : 0x9C00_9F8C)
    UINT32  RGST_Group0319_Reg04                  ; // 04  (ADDR : 0x9C00_9F90)
    UINT32  RGST_Group0319_Reg05                  ; // 05  (ADDR : 0x9C00_9F94)
    UINT32  RGST_Group0319_Reg06                  ; // 06  (ADDR : 0x9C00_9F98)
    UINT32  RGST_Group0319_Reg07                  ; // 07  (ADDR : 0x9C00_9F9C)
    UINT32  RGST_Group0319_Reg08                  ; // 08  (ADDR : 0x9C00_9FA0)
    UINT32  RGST_Group0319_Reg09                  ; // 09  (ADDR : 0x9C00_9FA4)
    UINT32  RGST_Group0319_Reg10                  ; // 10  (ADDR : 0x9C00_9FA8)
    UINT32  RGST_Group0319_Reg11                  ; // 11  (ADDR : 0x9C00_9FAC)
    UINT32  RGST_Group0319_Reg12                  ; // 12  (ADDR : 0x9C00_9FB0)
    UINT32  RGST_Group0319_Reg13                  ; // 13  (ADDR : 0x9C00_9FB4)
    UINT32  RGST_Group0319_Reg14                  ; // 14  (ADDR : 0x9C00_9FB8)
    UINT32  RGST_Group0319_Reg15                  ; // 15  (ADDR : 0x9C00_9FBC)
    UINT32  RGST_Group0319_Reg16                  ; // 16  (ADDR : 0x9C00_9FC0)
    UINT32  RGST_Group0319_Reg17                  ; // 17  (ADDR : 0x9C00_9FC4)
    UINT32  RGST_Group0319_Reg18                  ; // 18  (ADDR : 0x9C00_9FC8)
    UINT32  RGST_Group0319_Reg19                  ; // 19  (ADDR : 0x9C00_9FCC)
    UINT32  RGST_Group0319_Reg20                  ; // 20  (ADDR : 0x9C00_9FD0)
    UINT32  RGST_Group0319_Reg21                  ; // 21  (ADDR : 0x9C00_9FD4)
    UINT32  RGST_Group0319_Reg22                  ; // 22  (ADDR : 0x9C00_9FD8)
    UINT32  RGST_Group0319_Reg23                  ; // 23  (ADDR : 0x9C00_9FDC)
    UINT32  RGST_Group0319_Reg24                  ; // 24  (ADDR : 0x9C00_9FE0)
    UINT32  RGST_Group0319_Reg25                  ; // 25  (ADDR : 0x9C00_9FE4)
    UINT32  RGST_Group0319_Reg26                  ; // 26  (ADDR : 0x9C00_9FE8)
    UINT32  RGST_Group0319_Reg27                  ; // 27  (ADDR : 0x9C00_9FEC)
    UINT32  RGST_Group0319_Reg28                  ; // 28  (ADDR : 0x9C00_9FF0)
    UINT32  RGST_Group0319_Reg29                  ; // 29  (ADDR : 0x9C00_9FF4)
    UINT32  RGST_Group0319_Reg30                  ; // 30  (ADDR : 0x9C00_9FF8)
    UINT32  RGST_Group0319_Reg31                  ; // 31  (ADDR : 0x9C00_9FFC)

    //Group   320 : TVDEC
    UINT32  RGST_Group0320_Reg00                  ; // 00  (ADDR : 0x9C00_A000)
    UINT32  RGST_Group0320_Reg01                  ; // 01  (ADDR : 0x9C00_A004)
    UINT32  RGST_Group0320_Reg02                  ; // 02  (ADDR : 0x9C00_A008)
    UINT32  RGST_Group0320_Reg03                  ; // 03  (ADDR : 0x9C00_A00C)
    UINT32  RGST_Group0320_Reg04                  ; // 04  (ADDR : 0x9C00_A010)
    UINT32  RGST_Group0320_Reg05                  ; // 05  (ADDR : 0x9C00_A014)
    UINT32  RGST_Group0320_Reg06                  ; // 06  (ADDR : 0x9C00_A018)
    UINT32  RGST_Group0320_Reg07                  ; // 07  (ADDR : 0x9C00_A01C)
    UINT32  RGST_Group0320_Reg08                  ; // 08  (ADDR : 0x9C00_A020)
    UINT32  RGST_Group0320_Reg09                  ; // 09  (ADDR : 0x9C00_A024)
    UINT32  RGST_Group0320_Reg10                  ; // 10  (ADDR : 0x9C00_A028)
    UINT32  RGST_Group0320_Reg11                  ; // 11  (ADDR : 0x9C00_A02C)
    UINT32  RGST_Group0320_Reg12                  ; // 12  (ADDR : 0x9C00_A030)
    UINT32  RGST_Group0320_Reg13                  ; // 13  (ADDR : 0x9C00_A034)
    UINT32  RGST_Group0320_Reg14                  ; // 14  (ADDR : 0x9C00_A038)
    UINT32  RGST_Group0320_Reg15                  ; // 15  (ADDR : 0x9C00_A03C)
    UINT32  RGST_Group0320_Reg16                  ; // 16  (ADDR : 0x9C00_A040)
    UINT32  RGST_Group0320_Reg17                  ; // 17  (ADDR : 0x9C00_A044)
    UINT32  RGST_Group0320_Reg18                  ; // 18  (ADDR : 0x9C00_A048)
    UINT32  RGST_Group0320_Reg19                  ; // 19  (ADDR : 0x9C00_A04C)
    UINT32  RGST_Group0320_Reg20                  ; // 20  (ADDR : 0x9C00_A050)
    UINT32  RGST_Group0320_Reg21                  ; // 21  (ADDR : 0x9C00_A054)
    UINT32  RGST_Group0320_Reg22                  ; // 22  (ADDR : 0x9C00_A058)
    UINT32  RGST_Group0320_Reg23                  ; // 23  (ADDR : 0x9C00_A05C)
    UINT32  RGST_Group0320_Reg24                  ; // 24  (ADDR : 0x9C00_A060)
    UINT32  RGST_Group0320_Reg25                  ; // 25  (ADDR : 0x9C00_A064)
    UINT32  RGST_Group0320_Reg26                  ; // 26  (ADDR : 0x9C00_A068)
    UINT32  RGST_Group0320_Reg27                  ; // 27  (ADDR : 0x9C00_A06C)
    UINT32  RGST_Group0320_Reg28                  ; // 28  (ADDR : 0x9C00_A070)
    UINT32  RGST_Group0320_Reg29                  ; // 29  (ADDR : 0x9C00_A074)
    UINT32  RGST_Group0320_Reg30                  ; // 30  (ADDR : 0x9C00_A078)
    UINT32  RGST_Group0320_Reg31                  ; // 31  (ADDR : 0x9C00_A07C)

    //Group   321 : TVDEC
    UINT32  RGST_Group0321_Reg00                  ; // 00  (ADDR : 0x9C00_A080)
    UINT32  RGST_Group0321_Reg01                  ; // 01  (ADDR : 0x9C00_A084)
    UINT32  RGST_Group0321_Reg02                  ; // 02  (ADDR : 0x9C00_A088)
    UINT32  RGST_Group0321_Reg03                  ; // 03  (ADDR : 0x9C00_A08C)
    UINT32  RGST_Group0321_Reg04                  ; // 04  (ADDR : 0x9C00_A090)
    UINT32  RGST_Group0321_Reg05                  ; // 05  (ADDR : 0x9C00_A094)
    UINT32  RGST_Group0321_Reg06                  ; // 06  (ADDR : 0x9C00_A098)
    UINT32  RGST_Group0321_Reg07                  ; // 07  (ADDR : 0x9C00_A09C)
    UINT32  RGST_Group0321_Reg08                  ; // 08  (ADDR : 0x9C00_A0A0)
    UINT32  RGST_Group0321_Reg09                  ; // 09  (ADDR : 0x9C00_A0A4)
    UINT32  RGST_Group0321_Reg10                  ; // 10  (ADDR : 0x9C00_A0A8)
    UINT32  RGST_Group0321_Reg11                  ; // 11  (ADDR : 0x9C00_A0AC)
    UINT32  RGST_Group0321_Reg12                  ; // 12  (ADDR : 0x9C00_A0B0)
    UINT32  RGST_Group0321_Reg13                  ; // 13  (ADDR : 0x9C00_A0B4)
    UINT32  RGST_Group0321_Reg14                  ; // 14  (ADDR : 0x9C00_A0B8)
    UINT32  RGST_Group0321_Reg15                  ; // 15  (ADDR : 0x9C00_A0BC)
    UINT32  RGST_Group0321_Reg16                  ; // 16  (ADDR : 0x9C00_A0C0)
    UINT32  RGST_Group0321_Reg17                  ; // 17  (ADDR : 0x9C00_A0C4)
    UINT32  RGST_Group0321_Reg18                  ; // 18  (ADDR : 0x9C00_A0C8)
    UINT32  RGST_Group0321_Reg19                  ; // 19  (ADDR : 0x9C00_A0CC)
    UINT32  RGST_Group0321_Reg20                  ; // 20  (ADDR : 0x9C00_A0D0)
    UINT32  RGST_Group0321_Reg21                  ; // 21  (ADDR : 0x9C00_A0D4)
    UINT32  RGST_Group0321_Reg22                  ; // 22  (ADDR : 0x9C00_A0D8)
    UINT32  RGST_Group0321_Reg23                  ; // 23  (ADDR : 0x9C00_A0DC)
    UINT32  RGST_Group0321_Reg24                  ; // 24  (ADDR : 0x9C00_A0E0)
    UINT32  RGST_Group0321_Reg25                  ; // 25  (ADDR : 0x9C00_A0E4)
    UINT32  RGST_Group0321_Reg26                  ; // 26  (ADDR : 0x9C00_A0E8)
    UINT32  RGST_Group0321_Reg27                  ; // 27  (ADDR : 0x9C00_A0EC)
    UINT32  RGST_Group0321_Reg28                  ; // 28  (ADDR : 0x9C00_A0F0)
    UINT32  RGST_Group0321_Reg29                  ; // 29  (ADDR : 0x9C00_A0F4)
    UINT32  RGST_Group0321_Reg30                  ; // 30  (ADDR : 0x9C00_A0F8)
    UINT32  RGST_Group0321_Reg31                  ; // 31  (ADDR : 0x9C00_A0FC)

    //Group   322 : TVDEC
    UINT32  RGST_Group0322_Reg00                  ; // 00  (ADDR : 0x9C00_A100)
    UINT32  RGST_Group0322_Reg01                  ; // 01  (ADDR : 0x9C00_A104)
    UINT32  RGST_Group0322_Reg02                  ; // 02  (ADDR : 0x9C00_A108)
    UINT32  RGST_Group0322_Reg03                  ; // 03  (ADDR : 0x9C00_A10C)
    UINT32  RGST_Group0322_Reg04                  ; // 04  (ADDR : 0x9C00_A110)
    UINT32  RGST_Group0322_Reg05                  ; // 05  (ADDR : 0x9C00_A114)
    UINT32  RGST_Group0322_Reg06                  ; // 06  (ADDR : 0x9C00_A118)
    UINT32  RGST_Group0322_Reg07                  ; // 07  (ADDR : 0x9C00_A11C)
    UINT32  RGST_Group0322_Reg08                  ; // 08  (ADDR : 0x9C00_A120)
    UINT32  RGST_Group0322_Reg09                  ; // 09  (ADDR : 0x9C00_A124)
    UINT32  RGST_Group0322_Reg10                  ; // 10  (ADDR : 0x9C00_A128)
    UINT32  RGST_Group0322_Reg11                  ; // 11  (ADDR : 0x9C00_A12C)
    UINT32  RGST_Group0322_Reg12                  ; // 12  (ADDR : 0x9C00_A130)
    UINT32  RGST_Group0322_Reg13                  ; // 13  (ADDR : 0x9C00_A134)
    UINT32  RGST_Group0322_Reg14                  ; // 14  (ADDR : 0x9C00_A138)
    UINT32  RGST_Group0322_Reg15                  ; // 15  (ADDR : 0x9C00_A13C)
    UINT32  RGST_Group0322_Reg16                  ; // 16  (ADDR : 0x9C00_A140)
    UINT32  RGST_Group0322_Reg17                  ; // 17  (ADDR : 0x9C00_A144)
    UINT32  RGST_Group0322_Reg18                  ; // 18  (ADDR : 0x9C00_A148)
    UINT32  RGST_Group0322_Reg19                  ; // 19  (ADDR : 0x9C00_A14C)
    UINT32  RGST_Group0322_Reg20                  ; // 20  (ADDR : 0x9C00_A150)
    UINT32  RGST_Group0322_Reg21                  ; // 21  (ADDR : 0x9C00_A154)
    UINT32  RGST_Group0322_Reg22                  ; // 22  (ADDR : 0x9C00_A158)
    UINT32  RGST_Group0322_Reg23                  ; // 23  (ADDR : 0x9C00_A15C)
    UINT32  RGST_Group0322_Reg24                  ; // 24  (ADDR : 0x9C00_A160)
    UINT32  RGST_Group0322_Reg25                  ; // 25  (ADDR : 0x9C00_A164)
    UINT32  RGST_Group0322_Reg26                  ; // 26  (ADDR : 0x9C00_A168)
    UINT32  RGST_Group0322_Reg27                  ; // 27  (ADDR : 0x9C00_A16C)
    UINT32  RGST_Group0322_Reg28                  ; // 28  (ADDR : 0x9C00_A170)
    UINT32  RGST_Group0322_Reg29                  ; // 29  (ADDR : 0x9C00_A174)
    UINT32  RGST_Group0322_Reg30                  ; // 30  (ADDR : 0x9C00_A178)
    UINT32  RGST_Group0322_Reg31                  ; // 31  (ADDR : 0x9C00_A17C)

    //Group   323 : TVDEC
    UINT32  RGST_Group0323_Reg00                  ; // 00  (ADDR : 0x9C00_A180)
    UINT32  RGST_Group0323_Reg01                  ; // 01  (ADDR : 0x9C00_A184)
    UINT32  RGST_Group0323_Reg02                  ; // 02  (ADDR : 0x9C00_A188)
    UINT32  RGST_Group0323_Reg03                  ; // 03  (ADDR : 0x9C00_A18C)
    UINT32  RGST_Group0323_Reg04                  ; // 04  (ADDR : 0x9C00_A190)
    UINT32  RGST_Group0323_Reg05                  ; // 05  (ADDR : 0x9C00_A194)
    UINT32  RGST_Group0323_Reg06                  ; // 06  (ADDR : 0x9C00_A198)
    UINT32  RGST_Group0323_Reg07                  ; // 07  (ADDR : 0x9C00_A19C)
    UINT32  RGST_Group0323_Reg08                  ; // 08  (ADDR : 0x9C00_A1A0)
    UINT32  RGST_Group0323_Reg09                  ; // 09  (ADDR : 0x9C00_A1A4)
    UINT32  RGST_Group0323_Reg10                  ; // 10  (ADDR : 0x9C00_A1A8)
    UINT32  RGST_Group0323_Reg11                  ; // 11  (ADDR : 0x9C00_A1AC)
    UINT32  RGST_Group0323_Reg12                  ; // 12  (ADDR : 0x9C00_A1B0)
    UINT32  RGST_Group0323_Reg13                  ; // 13  (ADDR : 0x9C00_A1B4)
    UINT32  RGST_Group0323_Reg14                  ; // 14  (ADDR : 0x9C00_A1B8)
    UINT32  RGST_Group0323_Reg15                  ; // 15  (ADDR : 0x9C00_A1BC)
    UINT32  RGST_Group0323_Reg16                  ; // 16  (ADDR : 0x9C00_A1C0)
    UINT32  RGST_Group0323_Reg17                  ; // 17  (ADDR : 0x9C00_A1C4)
    UINT32  RGST_Group0323_Reg18                  ; // 18  (ADDR : 0x9C00_A1C8)
    UINT32  RGST_Group0323_Reg19                  ; // 19  (ADDR : 0x9C00_A1CC)
    UINT32  RGST_Group0323_Reg20                  ; // 20  (ADDR : 0x9C00_A1D0)
    UINT32  RGST_Group0323_Reg21                  ; // 21  (ADDR : 0x9C00_A1D4)
    UINT32  RGST_Group0323_Reg22                  ; // 22  (ADDR : 0x9C00_A1D8)
    UINT32  RGST_Group0323_Reg23                  ; // 23  (ADDR : 0x9C00_A1DC)
    UINT32  RGST_Group0323_Reg24                  ; // 24  (ADDR : 0x9C00_A1E0)
    UINT32  RGST_Group0323_Reg25                  ; // 25  (ADDR : 0x9C00_A1E4)
    UINT32  RGST_Group0323_Reg26                  ; // 26  (ADDR : 0x9C00_A1E8)
    UINT32  RGST_Group0323_Reg27                  ; // 27  (ADDR : 0x9C00_A1EC)
    UINT32  RGST_Group0323_Reg28                  ; // 28  (ADDR : 0x9C00_A1F0)
    UINT32  RGST_Group0323_Reg29                  ; // 29  (ADDR : 0x9C00_A1F4)
    UINT32  RGST_Group0323_Reg30                  ; // 30  (ADDR : 0x9C00_A1F8)
    UINT32  RGST_Group0323_Reg31                  ; // 31  (ADDR : 0x9C00_A1FC)

    //Group   324 : TVDEC
    UINT32  RGST_Group0324_Reg00                  ; // 00  (ADDR : 0x9C00_A200)
    UINT32  RGST_Group0324_Reg01                  ; // 01  (ADDR : 0x9C00_A204)
    UINT32  RGST_Group0324_Reg02                  ; // 02  (ADDR : 0x9C00_A208)
    UINT32  RGST_Group0324_Reg03                  ; // 03  (ADDR : 0x9C00_A20C)
    UINT32  RGST_Group0324_Reg04                  ; // 04  (ADDR : 0x9C00_A210)
    UINT32  RGST_Group0324_Reg05                  ; // 05  (ADDR : 0x9C00_A214)
    UINT32  RGST_Group0324_Reg06                  ; // 06  (ADDR : 0x9C00_A218)
    UINT32  RGST_Group0324_Reg07                  ; // 07  (ADDR : 0x9C00_A21C)
    UINT32  RGST_Group0324_Reg08                  ; // 08  (ADDR : 0x9C00_A220)
    UINT32  RGST_Group0324_Reg09                  ; // 09  (ADDR : 0x9C00_A224)
    UINT32  RGST_Group0324_Reg10                  ; // 10  (ADDR : 0x9C00_A228)
    UINT32  RGST_Group0324_Reg11                  ; // 11  (ADDR : 0x9C00_A22C)
    UINT32  RGST_Group0324_Reg12                  ; // 12  (ADDR : 0x9C00_A230)
    UINT32  RGST_Group0324_Reg13                  ; // 13  (ADDR : 0x9C00_A234)
    UINT32  RGST_Group0324_Reg14                  ; // 14  (ADDR : 0x9C00_A238)
    UINT32  RGST_Group0324_Reg15                  ; // 15  (ADDR : 0x9C00_A23C)
    UINT32  RGST_Group0324_Reg16                  ; // 16  (ADDR : 0x9C00_A240)
    UINT32  RGST_Group0324_Reg17                  ; // 17  (ADDR : 0x9C00_A244)
    UINT32  RGST_Group0324_Reg18                  ; // 18  (ADDR : 0x9C00_A248)
